import { Action, ISpell, Source, MagicSchool, DamageType } from '@/types/spell';
import { Spell } from '@/spells/list';
// import { Spell } from '@/spells/list/elemental-evil';

const spells: { -readonly [key in keyof typeof Spell]?: ISpell } = {
  /*
   * БАЧЕННЯ НЕВИДИМОГО
2 рівень, віщування
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (щіпка тальку і товченого срібла) Тривалість: 1 година
Доки це заклинання триває, ти бачиш невидимих істот і предмети, як ніби б вони були видимі, а твій зір простяга- ється на Ефірну Площину. Ефірні істоти і предмети вигля- дають примарними і напівпрозорими.

* */
  [Spell.SeeInvisibility]: {
    name: 'БАЧЕННЯ НЕВИДИМОГО',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Доки це заклинання триває, ти бачиш невидимих істот і предмети, як ніби б вони були видимі, а твій зір простягається на Ефірну Площину. Ефірні істоти і предмети виглядають примарними і напівпрозорими.',
    components: {
      c: true,
      t: true,
      m: 'щіпка тальку і товченого срібла',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },

  /*
      * БЕЗСЛІДНЕ ПЕРЕСУВАННЯ
  2 рівень, огородження
  Час виконання: 1 вчинок
  Дистанція: На себе
  Компоненти: С, Т, М (попіл від спаленого листка омели і
  гілочка ялини)
  Тривалість: Концентрація, не довше 1 години
  Від тебе починає виходити покрив тіней і тиші, який прихо- вує тебе та твоїх супутників від виявлення. Доки заклинан- ня триває, всі істоти, обрані тобою в межах 6 метрів (вклю- чаючи тебе) отримують бонус +10 до перевірок Вправності (Скритності), і їх не можливо вистежити без допомоги магії. Істота, яка отримала цей бонус, не залишає за собою слідів.

  * */
  [Spell.PassWithoutTrace]: {
    name: 'БЕЗСЛІДНЕ ПЕРЕСУВАННЯ',
    lvl: 2,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Від тебе починає виходити покрив тіней і тиші, який приховує тебе та твоїх супутників від виявлення. Доки заклинання триває, всі істоти, обрані тобою в межах 6 метрів (включаючи тебе) отримують бонус +10 до перевірок Вправності (Скритності), і їх не можливо вистежити без допомоги магії. Істота, яка отримала цей бонус, не залишає за собою слідів.',
    components: {
      c: true,
      t: true,
      m: 'попіл від спаленого листка омели і гілочка ялини',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
      * ВИЯВЛЕННЯ НАМІРІВ
  2 рівень, віщування
  Час виконання: 1 вчинок
  Дистанція: На себе
  Компоненти: С, Т, М (мідна монета) Тривалість: Концентрація, не довше 1 хвилини
  Доки це заклинання триває, ти можеш читати думки дея- ких істот. Після того, як ти виконав це заклинання, і доти, доки воно триває, ти можеш у свій хід використовувати вчинок, щоб зосередитися на одній істоті, яку бачиш в ме- жах 6 метрів. Якщо у обраної істоти показник Інтелекту 3 або нижчий, або якщо вона не може говорити ні на одній мові, вона не потрапляє під дію цього заклинання.
  Спочатку ти дізнаєшся поверхневі думки істоти — те, що знаходиться в її свідомості на даний момент. Ти можеш вчинком або перенести увагу на думки іншої істоти, або спробувати заглибитися в думки поточної істоти. Якщо ти занурюєшся глибше, ціль повинна зробити кидок рятунку Мудрості. У разі провалу ти отримуєш розуміння її думок (якщо є), її емоційного стану, і того, що її найбільше турбує (а також того, що вона любить і ненавидить). Якщо істо- та досягне успіху, заклинання закінчується. У будь-якому випадку, ціль знає, що ти прощупував її свідомість, і якщо ти не перевів увагу на думки іншої істоти, попередня істота може в свій хід вчинком здійснити перевірку Інтелекту, протиставлену твоїй перевірці Інтелекту, в разі успіху якої заклинання закінчується.
  Питання, які задаються цілі усно, впливають на хід її ду- мок, тому це заклинання надзвичайно ефективно під час допитів.
  Ти можеш також використовувати це заклинання для виявлення присутності розумних істот, яких ти не бачиш. Коли ти виконуєш це заклинання, або пізніше, доки воно активне, витративши вчинок, ти можеш пошукати думки іс- тот в межах 6 метрів від тебе. Заклинання пронизує більшу частину бар’єрів, але блокується 50 сантиметрами каменю, 5 сантиметрами звичайного металу або тонким листом свин- цю. Ти не можеш виявити істот з Інтелектом 3 або нижчим, а також тих, хто не говорить ні на одній мові.
  Виявивши таким методом присутність істоти, ти можеш до закінчення дії заклинання читати її думки, як описано вище, навіть якщо ти її не бачиш, але при цьому вона повин- на знаходитись в межах дистанції.
      * */

  [Spell.DetectThoughts]: {
    name: 'ВИЯВЛЕННЯ НАМІРІВ',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,

    target: '',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
      m: 'мідна монета',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: 'Мудрість', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Доки це заклинання триває, ти можеш читати думки деяких істот. Після того, як ти виконав це заклинання, і доти, доки воно триває, ти можеш у свій хід використовувати вчинок, щоб зосередитися на одній істоті, яку бачиш в межах 6 метрів. Якщо у обраної істоти показник Інтелекту 3 або нижчий, або якщо вона не може говорити ні на одній мові, вона не потрапляє під дію цього заклинання. Спочатку ти дізнаєшся поверхневі думки істоти — те, що знаходиться в її свідомості на даний момент. Ти можеш вчинком або перенести увагу на думки іншої істоти, або спробувати заглибитися в думки поточної істоти. Якщо ти занурюєшся глибше, ціль повинна зробити кидок рятунку Мудрості. У разі провалу ти отримуєш розуміння її думок (якщо є), її емоційного стану, і того, що її найбільше турбує (а також того, що вона любить і ненавидить). Якщо істота досягне успіху, заклинання закінчується. У будь-якому випадку, ціль знає, що ти прощупував її свідомість, і якщо ти не перевів увагу на думки іншої істоти, попередня істота може в свій хід вчинком здійснити перевірку Інтелекту, протиставлену твоїй перевірці Інтелекту, в разі успіху якої заклинання закінчується. Питання, які задаються цілі усно, впливають на хід її думок, тому це заклинання надзвичайно ефективно під час допитів. Ти можеш також використовувати це заклинання для виявлення присутності розумних істот, яких ти не бачиш. Коли ти виконуєш це заклинання, або пізніше, доки воно активне, витративши вчинок, ти можеш пошукати думки істот в межах  6 метрів від тебе. Заклинання пронизує більшу частину бар’єрів, але блокується 50 сантиметрами каменю, 5 сантиметрами звичайного металу або тонким листом свин- цю. Ти не можеш виявити істот з Інтелектом 3 або нижчим, а також тих, хто не говорить ні на одній мові.Виявивши таким методом присутність істоти, ти можеш до закінчення дії заклинання читати її думки, як описано вище, навіть якщо ти її не бачиш, але при цьому вона повин- на знаходитись в межах дистанції.',
  },
  /*
    * ВІДДЗЕРКАЛЕННЯ
  2 рівень, ілюзія
  Час виконання: 1 вчинок Дистанція: На себе Компоненти: С, Т Тривалість: 1 хвилина
  У твоєму просторі з’являються три твоїх ілюзорних копії. Доки заклинання триває, копії пересуваються разом з то- бою і повторюють твої дії, рухаючись так, що неможливо зрозуміти, хто з вас справжній. Ти можеш використати вчи- нок, щоб змусити свої копії зникнути.
  Кожен раз, коли істота націлюється на тебе атакою, доки заклинання триває, кидай к20, щоб визначити, чи не поці- лила атака замість тебе по одній із твоїх копій. Якщо у тебе три копії, ти повинен викинути «6» або більше, щоб зро- бити ціллю свою копію. Якщо копій дві, викинути потріб- но «8» або більше. Якщо копія одна, ти повинен викинути «11» або більше.
  КО копії дорівнює 10 + твій модифікатор Вправності. Якщо атака поцілила по копії, вона знищується. Копію може знищити тільки атака, яка поцілила по ній. Вона іг- норує інші ушкодження і ефекти. Заклинання закінчується, якщо всі три копії будуть знищені.
  * */
  [Spell.MirrorImage]: {
    name: 'ВІДДЗЕРКАЛЕННЯ',
    lvl: 2,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'У твоєму просторі з’являються три твоїх ілюзорних копії. Доки заклинання триває, копії пересуваються разом з тобою і повторюють твої дії, рухаючись так, що неможливо зрозуміти, хто з вас справжній. Ти можеш використати вчинок, щоб змусити свої копії зникнути. Кожен раз, коли істота націлюється на тебе атакою, доки заклинання триває, кидай к20, щоб визначити, чи не поцілила атака замість тебе по одній із твоїх копій. Якщо у тебе три копії, ти повинен викинути «6» або більше, щоб зробити ціллю свою копію. Якщо копій дві, викинути потрібно «8» або більше. Якщо копія одна, ти повинен викинути «11» або більше. КО копії дорівнює 10 + твій модифікатор Вправності. Якщо атака поцілила по копії, вона знищується. Копію може знищити тільки атака, яка поцілила по ній. Вона ігнорує інші ушкодження і ефекти. Заклинання закінчується, якщо всі три копії будуть знищені.',
  },
  /*
    * ВІДКРИВАННЯ
  2 рівень, видозміна
  Час виконання: 1 вчинок Дистанція: 12 метрів Компоненти: С Тривалість: Миттєва
  Вибери предмет, який бачиш в межах дистанції. Це можуть бути двері, ящик, скриня, кайдани, навісний замок, або ін- ший предмет, яких закритий простим або магічний засо- бом, який запобігає доступу.
  Ціль, яка замкнена звичайним замком, яку заклинило або вона замкнена на засув, стає незамкненою, незаклине- ною, а засуви самі відкриваються. Якщо на предметі було кілька замків, відкривається тільки один з них.
  Якщо ти вибрав ціль, замкнену магічним замком, то те заклинання пригнічується на 10 хвилин, під час яких ціль може відкриватися і закриватися як зазвичай.
  Коли ти виконуєш це заклинання, від цілі виходить гуч- ний гуркіт, чутний на відстані 60 метрів.
    * */
  [Spell.Knock]: {
    name: 'ВІДКРИВАННЯ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 12,
    self: false,
    target: 'предмет, який бачиш в межах дистанції',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Вибери предмет, який бачиш в межах дистанції. Це можуть бути двері, ящик, скриня, кайдани, навісний замок, або інший предмет, яких закритий простим або магічний засобом, який запобігає доступу. Ціль, яка замкнена звичайним замком, яку заклинило або вона замкнена на засув, стає незамкненою, незаклиненою, а засуви самі відкриваються. Якщо на предметі було кілька замків, відкривається тільки один з них. Якщо ти вибрав ціль, замкнену магічним замком, то те заклинання пригнічується на 10 хвилин, під час яких ціль може відкриватися і закриватися як зазвичай. Коли ти виконуєш це заклинання, від цілі виходить гучний гуркіт, чутний на відстані 60 метрів.',
  },
  /*
    * ВІЧНИЙ ВОГОНЬ
  2 рівень, втілення
  Час виконання: 1 вчинок
  Дистанція: Дотик
  Компоненти: С, Т, М (Порошок рубіна вартістю 50 зм,
  який поглинається заклинанням) Тривалість: Доки не розсіється
  Із предмета, до якого ти торкаєшся, виходить полум’я, екві- валентне за яскравістю полум’ю факела. Ефект виглядає, як звичайне полум’я, але не створює тепла і не використовує кисень. Вічний вогонь можна накрити або заховати, але не згасити.
    * */
  [Spell.ContinualFlame]: {
    name: 'ВІЧНИЙ ВОГОНЬ',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 0,
    self: false,
    target: 'предмет, до якого ти торкаєшся',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'Порошок рубіна вартістю 50 зм, який поглинається заклинанням',
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Із предмета, до якого ти торкаєшся, виходить полум’я, еквівалентне за яскравістю полум’ю факела. Ефект виглядає, як звичайне полум’я, але не створює тепла і не використовує кисень. Вічний вогонь можна накрити або заховати, але не згасити.',
  },
  /*
    * ВОГНЯНА СФЕРА
  2 рівень, виклик
  Час виконання: 1 вчинок
  Дистанція: 12 метрів
  Компоненти: С, Т, М (шматок сала, щіпка сірки і товчено-
  го заліза)
  Тривалість: Концентрація, не довше 1 хвилини
  У вільному просторі на твій вибір в межах дистанції з’явля- ється вогняна сфера діаметром 1 метр, яка існує, доки закли- нання триває. Всі істоти, які закінчують хід в межах 1 метра від цієї сфери, повинні зробити кидок рятунку Вправності. Істоти отримують 2к6 ушкоджень вогнем при провалі або половину цих ушкоджень при успіху.
  Ти можеш бонусним вчинком пересунути цю сферу на відстань не більше 6 метрів. Якщо ти тараниш кулею істоту, ця істота повинна зробити кидок рятунку від ушкоджень кулі, і куля зупиняється до кінця цього ходу.
  Коли ти пересуваєш кулю, ти можеш підіймати її над пе- решкодами до 1 метра у висоту і перестрибувати нею роз- ломи до 2 метрів у довжину. Куля підпалює легкозаймисті предмети, які ніхто не тримає і не носить, та випромінює яскраве світло в межах 4 метрів і тьмяне світло в межах ще 4 метрів.
  На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, його ушко- дження збільшуються на 1к6 за кожен рівень слота вище 2-го.
  * */
  [Spell.FlamingSphere]: {
    name: 'ВОГНЯНА СФЕРА',
    lvl: 2,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target: 'вільний простір на твій вибір в межах дистанції',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
      m: 'шматок сала, щіпка сірки і товченого заліза',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: true,
      from: 3,
      description: 'ушкодження збільшуються на 1к6 за кожен рівень слота вище 2-го',
      effect: '1к6',
    },
    area: '',
    saveThough: 'Вправності', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: ['fire'],
    source: Source.BasicRules,
    description:
      'У вільному просторі на твій вибір в межах дистанції з’являється вогняна сфера діаметром 1 метр, яка існує, доки заклинання триває. Всі істоти, які закінчують хід в межах 1 метра від цієї сфери, повинні зробити кидок рятунку Вправності. Істоти отримують 2к6 ушкоджень вогнем при провалі або половину цих ушкоджень при успіху. Ти можеш бонусним вчинком пересунути цю сферу на відстань не більше 6 метрів. Якщо ти тараниш кулею істоту, ця істота повинна зробити кидок рятунку від ушкоджень кулі, і куля зупиняється до кінця цього ходу. Коли ти пересуваєш кулю, ти можеш підіймати її над перешкодами до 1 метра у висоту і перестрибувати нею розломи до 2 метрів у довжину. Куля підпалює легкозаймисті предмети, які ніхто не тримає і не носить, та випромінює яскраве світло в межах 4 метрів і тьмяне світло в межах ще 4 метрів.',
  },
  /*
    * Thunderclap
Evocation cantrip
Casting Time: 1 action Range: Self (5-foot radius) Components: S Duration: Instantaneous
You create a burst of thunderous sound, which can be heard 100 feet away. Each creature other than
you within 5 feet of you must make a Constitution saving throw. On a failed save, the creature takes 1d6 thunder damage.
The spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).
*
* translate to ukranian
* */

  [Spell.Thunderclap]: {
    name: 'ГРОМОВИЙ ХЛОПОК',
    lvl: 0,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 1,
    self: true,
    target: '',
    numberOfTargets: 0,
    components: {
      c: false, // verbal
      t: true, // somatic
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: true,
      from: 5,
      description: 'збільшується на 1к6 на 5, 11 і 17 рівнях',
      effect: '1к6',
    },
    area: '1 метр радіус', // 5-foot radius
    saveThough: 'Конституції', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [DamageType.Thunder],
    source: Source.ElementalEvilPlayersCompanion,
    description:
      'Ти створюєш вибух грізного звуку, який можна почути на відстані 100 футів. Кожна істота, крім тебе, в межах 5 футів від тебе повинна зробити кидок рятунку Конституції. При провалі істота отримує 1к6 ушкоджень від грому. Ушкодження заклинання збільшуються на 1к6 за кожен рівень слота вище 2-го.',
  },
};

// console.log('0 lvl spells: ', Object.keys(spells));

export default spells;
