import { Action, ISpell, Source, MagicSchool } from '@/types/spell';
import { Spell } from '@/types/spells';

// const spells: Partial<Record<keyof typeof Spell, ISpell>> = {
const spells: { -readonly [key in keyof typeof Spell]?: ISpell } = {
  /*
  *
БЕЗМОВНИЙ ОБРАЗ
1 рівень, ілюзія
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (шматок овечої вовни) Тривалість: Концентрація, не довше 10 хвилин
Ти створюєш образ предмета, істоти або іншого відомого явища, яке поміщається в об’ємі куба з довжиною ребра 3 метри. Образ з’являється в точці, яку ти бачиш в межах дис- танції, і існує доти, доки заклинання триває. Це виключно зорова ілюзія, яка не супроводжується звуками, запахами чи іншими сенсорними ефектами.
Ти можеш витратити свій вчинок, щоб змусити образ пе- ресунутись у будь-яке місце в межах дистанції. Доки образ змінює місце розташування, ти можеш змінювати його зов- нішність, щоб пересування виглядало природним. Напри- клад, якщо ти створюєш образ істоти та пересуваєш її, то ти можеш змінювати образ так, щоб здавалось, ніби вона йде.
Фізична взаємодія з цим образом дає зрозуміти, що це ілюзія, тому що крізь нього все проходить наскрізь. Істоти, які досліджують образ вчинком, можуть визначити, що це ілюзія, зробивши успішну перевірку Інтелекту (Обстежен- ня) проти СК твоїх заклинань. Якщо істота розпізнає ілю- зію, вона може бачити крізь неї.
  * */
  [Spell.SilentImage]: {
    name: 'БЕЗМОВНИЙ ОБРАЗ',
    lvl: 1,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 12,
    target: 'об’єкт, істота або явище',
    numberOfTargets: 1,
    description:
      'Ти створюєш образ предмета, істоти або іншого відомого явища, яке поміщається в об’ємі куба з довжиною ребра 3 метри. Образ з’являється в точці, яку ти бачиш в межах дистанції, і існує доти, доки заклинання триває. Це виключно зорова ілюзія, яка не супроводжується звуками, запахами чи іншими сенсорними ефектами. Ти можеш витратити свій вчинок, щоб змусити образ пересунутись у будь-яке місце в межах дистанції. Доки образ змінює місце розташування, ти можеш змінювати його зовнішність, щоб пересування виглядало природним. Наприклад, якщо ти створюєш образ істоти та пересуваєш її, то ти можеш змінювати образ так, щоб здавалось, ніби вона йде. Фізична взаємодія з цим образом дає зрозуміти, що це ілюзія, тому що крізь нього все проходить наскрізь. Істоти, які досліджують образ вчинком, можуть визначити, що це ілюзія, зробивши успішну перевірку Інтелекту (Обстеження) проти СК твоїх заклинань. Якщо істота розпізнає ілюзію, вона може бачити крізь неї.',
    components: {
      c: true,
      t: true,
      m: 'шматок овечої вовни',
    },
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    self: false,
    area: 'куб 3 метри',
    saveThough: 'Інтелект (Обстеження)', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * БЛАГОСЛОВЕННЯ
1 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 6 метрів
Компоненти: С, Т, М (крапля святої води) Тривалість: Концентрація, не довше 1 хвилини
Ти благословляєш не більше трьох істот на твій вибір в ме- жах дистанції. Кожен раз, коли до закінчення ефекту закли- нання ціль здійснює кидок атаки або кидок рятунку, вона може кинути додатково к4 і додати число, яке випало, до результату того кидка.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, ти можеш об- рати його цілями по одній додатковій істоті за кожен рівень витраченого слота вище 1-го.
  * */
  [Spell.Bless]: {
    name: 'БЛАГОСЛОВЕННЯ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // // 1 вчинок === 0 секунд
    duration: 60,
    distance: 6,
    target: 'до трьох істот на вибір',
    numberOfTargets: 3,
    description:
      'Ти благословляєш не більше трьох істот на твій вибір в межах дистанції. Кожен раз, коли до закінчення ефекту заклинання ціль здійснює кидок атаки або кидок рятунку, вона може кинути додатково к4 і додати число, яке випало, до результату того кидка.',
    components: {
      c: true,
      t: true,
      m: 'крапля святої води',
    },
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    self: false,
    area: '',
    saveThough: '', // Немає кидка рятунку для цього заклинання
    attack: '', // Немає кидка атаки для цього заклинання
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  *
БОЖЕСТВЕННА ПІДТРИМКА
1 рівень, втілення
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 хвилини
Твоя молитва наповнює тебе божественною енергією. Доки заклинання триває, твої атаки зброєю завдають при попа- данні 1к4 додаткових ушкоджень.
  * */
  [Spell.DivineFavor]: {
    name: 'БОЖЕСТВЕННА ПІДТРИМКА',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.BonusAction,
    castTime: 0, // 1 бонусний вчинок === 0
    duration: 60,
    distance: 0,
    self: true,
    target: 'На себе',
    numberOfTargets: 0,
    description:
      'Твоя молитва наповнює тебе божественною енергією. Доки заклинання триває, твої атаки зброєю завдають при попаданні 1к4 додаткових ушкоджень.',
    components: {
      c: true,
      t: true,
    },
    area: '',
    saveThough: '',
    attack: '',
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ВИКЛИК НА ДУЕЛЬ
1 рівень, причарування
Час виконання: 1 бонусний вчинок Дистанція: 6 метрів
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
Ти намагаєшся викликати істоту на дуель. Одна істота, яку ти бачиш в межах дистанції, повинна здійснити кидок ря- тунку Мудрості. При провалі істота притягується до тебе, слідуючи за твоєю божественною вимогою. Доки закли- нання триває, це істота робить з перешкодою кидки атак по всіх істотах крім тебе, і мусить проводити кидок рятунку Мудрості щоразу, коли намагається просунутись в простір, який знаходиться більш ніж в 6 метрах від тебе; в разі успіху кидка рятунку це заклинання не обмежує пересування цілі в цей хід.
Заклинання закінчується, якщо ти атакуєш іншу істоту, якщо ти виконуєш заклинання, яке націлене на ворожу іс- тоту, але не на ціль, якщо дружня до тебе істота завдає цілі ушкодження або виконає на неї шкідливе заклинання, або якщо ти закінчуєш свій хід далі, ніж за 6 метрів від цілі.

  * */
  [Spell.CompelledDuel]: {
    name: 'ВИКЛИК НА ДУЕЛЬ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.BonusAction,
    castTime: 0, // 1 бонусний вчинок === 0 сек
    duration: 60,
    distance: 6,
    self: false,
    target: 'Істота, яку ти бачиш в межах дистанції',
    numberOfTargets: 1,
    description:
      'Ти намагаєшся викликати істоту на дуель. Одна істота, яку ти бачиш в межах дистанції, повинна здійснити кидок рятунку Мудрості. При провалі істота притягується до тебе, слідуючи за твоєю божественною вимогою. Доки заклинання триває, це істота робить з перешкодою кидки атак по всіх істотах крім тебе, і мусить проводити кидок рятунку Мудрості щоразу, коли намагається просунутись в простір, який знаходиться більш ніж в 6 метрах від тебе; в разі успіху кидка рятунку це заклинання не обмежує пересування цілі в цей хід. Заклинання закінчується, якщо ти атакуєш іншу істоту, якщо ти виконуєш заклинання, яке націлене на ворожу іс- тоту, але не на ціль, якщо дружня до тебе істота завдає цілі ушкодження або виконає на неї шкідливе заклинання, або якщо ти закінчуєш свій хід далі, ніж за 6 метрів від цілі.',
    components: {
      c: true,
      t: false,
    },
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: 'Мудрість', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ВИЯВЛЕННЯ ЗЛА І ДОБРА
1 рівень, віщування
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т
Тривалість: Концентрація, не довше 10 хвилин
Доки заклинання триває, ти дізнаєшся, чи є в межах 6 ме- трів від тебе аберації, породження, небожителі, нежить, феї або елементалі, а також їх точне місце розташування. Крім того, ти дізнаєшся, чи є в межах 6 метрів від тебе місце або предмет, який був магічно освячений або осквернений.
Заклинання пронизує більшу частину бар’єрів, але блоку- ється 30 сантиметрами каменю, 3 сантиметрами звичайно- го металу, тонким листом свинцю або 1 метром дерева чи землі.
  * */
  [Spell.DetectEvilAndGood]: {
    name: 'ВИЯВЛЕННЯ ЗЛА І ДОБРА',
    lvl: 1,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, //  1 вчинок === 0 секунд
    duration: 600,
    distance: 0, // На себе
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Доки заклинання триває, ти дізнаєшся, чи є в межах 6 мет- рів від тебе аберації, породження, небожителі, нежить, феї або елементалі, а також їх точне місце розташування. Крім того, ти дізнаєшся, чи є в межах 6 метрів від тебе місце або предмет, який був магічно освячений або осквернений. Заклинання пронизує більшу частину бар’єрів, але блокується 30 сантиметрами каменю, 3 сантиметрами звичайного металу, тонким листом свинцю або 1 метром дерева чи землі.',
    components: {
      c: true,
      t: true,
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  *
ВИЯВЛЕННЯ МАГІЇ
1 рівень, віщування (ритуал)
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т
Тривалість: Концентрація, не довше 10 хвилин
Доки заклинання триває, ти відчуваєш присутність магії в межах 6 метрів від тебе. Якщо ти відчув за рахунок цього заклинання присутність магії, ти можеш використати свій вчинок, щоб побачити слабку ауру навколо видимої істоти або предмета, що несе на собі магію, а також дізнатися шко- лу цієї магії, якщо вона є.
Це заклинання пронизує більшу частину бар’єрів, але блокується 30 сантиметрами каменю, 3 сантиметрами зви- чайного металу, тонким листом свинцю або 1 метром дере- ва або землі.
*/
  [Spell.DetectMagic]: {
    name: 'ВИЯВЛЕННЯ МАГІЇ',
    lvl: 1,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 0, // На себе
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Доки заклинання триває, ти відчуваєш присутність магії в межах 6 метрів від тебе. Якщо ти відчув за рахунок цього заклинання присутність магії, ти можеш використати свій вчинок, щоб побачити слабку ауру навколо видимої істоти або предмета, що несе на собі магію, а також дізнатися шко- лу цієї магії, якщо вона є. Це заклинання пронизує більшу частину бар’єрів, але блокується 30 сантиметрами каменю, 3 сантиметрами звичайного металу, тонким листом свинцю або 1 метром дере- ва або землі.',
    components: {
      c: true,
      t: true,
    },
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    freeWay: true,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ВИЯВЛЕННЯ ОТРУТ І ХВОРОБ
1 рівень, віщування (ритуал)
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (лист тису)
Тривалість: Концентрація, не довше 10 хвилин
Доки це заклинання триває, ти можеш відчувати присут- ність та місцезнаходження отрут, отруйних істот і хвороб в межах 6 метрів від себе. Ти також розпізнаєш вид отрути, отруйної істоти або хвороби.
Заклинання пронизує більшу частину бар’єрів, але блоку- ється 30 сантиметрами каменю, 3 сантиметрами звичайно- го металу, тонким листом свинцю або 1 метром дерева або землі.
*  */
  [Spell.DetectPoisonAndDisease]: {
    name: 'ВИЯВЛЕННЯ ОТРУТ І ХВОРОБ',
    lvl: 1,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 0, // На себе
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Доки це заклинання триває, ти можеш відчувати присутність та місцезнаходження отрут, отруйних істот і хвороб в межах 6 метрів від себе. Ти також розпізнаєш вид отрути, отруйної істоти або хвороби. Заклинання пронизує більшу частину бар’єрів, але блокується 30 сантиметрами каменю, 3 сантиметрами звичайного металу, тонким листом свинцю або 1 метром дерева або землі.',
    components: {
      c: true,
      t: true,
      m: 'лист тису',
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ВІДЬМИН СПАЛАХ
1 рівень, втілення
Час виконання: 1 вчинок
Дистанція: 6 метрів
Компоненти: С, Т, М (гілочка дерева, в яке вдарила бли-
скавка)
Тривалість: Концентрація, не довше 1 хвилини
Промінь потріскуючої синюватої енергії спрямовується до істоти в межах дистанції, формуючи між тобою і ціллю без- перервний дуговий розряд. Здійсни далекобійну атаку за- клинанням по цій істоті. При попаданні ціль отримує 1к12 ушкоджень електрикою, і доки заклинання триває, ти мо- жеш в кожен свій хід вчинком автоматично завдавати цілі 1к12 ушкоджень електрикою. Це заклинання закінчується, якщо ти використаєш вчинок на щось інше. Заклинання та- кож закінчується, якщо ціль виявиться поза межами дистан- ції заклинання або опиниться у повному укритті від тебе.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, первинні уш- кодження збільшуються на 1к12 за кожен рівень слота вище 1-го.
  * */
  [Spell.WitchBolt]: {
    name: 'ВІДЬМИН СПАЛАХ',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 6, // 6 метрів
    self: false,
    target: '',
    numberOfTargets: 1,
    description:
      'Промінь потріскуючої синюватої енергії спрямовується до істоти в межах дистанції, формуючи між тобою і ціллю безперервний дуговий розряд. Здійсни далекобійну атаку заклинанням по цій істоті. При попаданні ціль отримує 1к12 ушкоджень електрикою, і доки заклинання триває, ти можеш в кожен свій хід вчинком автоматично завдавати цілі 1к12 ушкоджень електрикою. Це заклинання закінчується, якщо ти використаєш вчинок на щось інше. Заклинання також закінчується, якщо ціль виявиться поза межами дистанції заклинання або опиниться у повному укритті від тебе.',
    components: {
      c: true,
      t: true,
      m: 'гілочка дерева, в яке вдарила блискавка',
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: ['електрика'],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, первинні ушкодження збільшуються на 1к12 за кожен рівень слота вище 1-го.',
      effect: '',
    },
  },
  /*
  *
ВОГНЯНІ ДОЛОНІ
1 рівень, втілення
Час виконання: 1 вчинок
Дистанція: На себе (3-метровий конус) Компоненти: С, Т
Тривалість: Миттєва
Поєднавши долоні і розчепіривши пальці віялом, ти ви- пускаєш із них тонкі язики полум’я. Усі істоти в межах 3-ме- трового конуса повинні зробити кидки рятунку Вправно- сті. Істота отримує 3к6 ушкоджень вогнем у разі провалу, або половину цих ушкоджень у разі успіху.
Полум’я підпалює всі легкозаймисті предмети, які ніхто не тримає та не носить.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження збільшуються на 1к6 за кожен рівень слота вище 1-го.

  * */
  [Spell.BurningHands]: {
    name: 'ВОГНЯНІ ДОЛОНІ',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 3, //  3-метровий конус
    self: true,
    target: 'cone', // 3-метровий конус
    numberOfTargets: Infinity, // Залежить від місця та умов
    description:
      'Поєднавши долоні і розчепіривши пальці віялом, ти випускаєш із них тонкі язики полум’я. Усі істоти в межах 3-метрового конуса повинні зробити кидки рятунку Вправності. Істота отримує 3к6 ушкоджень вогнем у разі провалу, або половину цих ушкоджень у разі успіху. Полум’я підпалює всі легкозаймисті предмети, які ніхто не тримає та не носить.',
    components: {
      c: true,
      t: true,
    },
    area: 'конус 3 ',
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: ['вогонь'],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушкодження збільшуються на 1к6 за кожен рівень слота вище 1-го.',
      effect: '',
    },
  },
  /*
  * ГЕРОЇЗМ
1 рівень, причарування
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 хвилини
Згідну істоту, до якої ти торкаєшся, переповнює хоробрість. Доки заклинання триває, істота отримує імунітет до стану переляку, і на початку кожного її ходу отримує тимчасове здоров’я, рівне модифікатору твоєї базової характеристики. Коли це заклинання закінчується, ціль втрачає все тимчасо- ве здоров’я, яке залишилося від цього заклинання.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, ти можеш об- рати його цілями по одній додатковій істоті за кожен рівень слота вище 1-го.
  * */
  [Spell.Heroism]: {
    name: 'ГЕРОЇЗМ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0, // Дотик
    self: false,
    target: 'creature', // Згідну істоту
    numberOfTargets: 1,
    description:
      'Згідну істоту, до якої ти торкаєшся, переповнює хоробрість. Доки заклинання триває, істота отримує імунітет до стану переляку, і на початку кожного її ходу отримує тимчасове здоров’я, рівне модифікатору твоєї базової характеристики. Коли це заклинання закінчується, ціль втрачає все тимчасове здоров’я, яке залишилося від цього заклинання.',
    components: {
      c: true,
      t: true,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, ти можеш обрати його цілями по одній додатковій істоті за кожен рівень слота вище 1-го.',
      effect: '',
    },
  },
  /*
  * ГНІВНА КАРА
1 рівень, втілення
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
Наступного разу, коли ти попадеш атакою рукопашною зброєю доки це заклинання триває, твоя атака завдасть до- датково 1к6 ушкоджень психічною енергією.
Також, якщо ціль цієї атаки — істота, вона повинна успішно здійснити кидок рятунку Мудрості або ж вона ста- не переляканою тобою до кінця дії заклинання. Ця істота також може зробити перевірку Мудрості проти СК твого заклинання своїм вчинком, щоб протистояти ефекту закли- нання та обірвати його.
  * */
  [Spell.WrathfulSmite]: {
    name: 'ГНІВНА КАРА',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 бонусний вчинок === 0 секунд
    duration: 60,
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    description:
      'Наступного разу, коли ти попадеш атакою рукопашною зброєю доки це заклинання триває, твоя атака завдасть додатково 1к6 ушкоджень психічною енергією. Також, якщо ціль цієї атаки — істота, вона повинна успішно здійснити кидок рятунку Мудрості або ж вона стане переляканою тобою до кінця дії заклинання. Ця істота також може зробити перевірку Мудрості проти СК твого заклинання своїм вчинком, щоб протистояти ефекту заклинання та обірвати його.',
    components: {
      c: true,
      t: false,
    },
    concentration: true,
    canEndEarlier: true,
    saveThough: 'Мудрості',
    freeWay: false,
    ritual: false,
    damageType: ['психіка'],
    source: Source.BasicRules,
  },
  /*
  * ГРАД ШИПІВ
1 рівень, виклик
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
Наступного разу, коли ти попадеш по істоті атакою дале- кобійною зброєю, доки це заклинання триває, з твоєї дале- кобійної зброї або боєприпасів вилетить град шипів. На до- даток до звичайного ефекту атаки, ціль та всі істоти в межах 1 метра від неї, повинні зробити кидок рятунку Вправності. При провалі істота отримує 1к10 колотих ушкоджень, або половину цих ушкоджень при успіху.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його коло- ті ушкодження збільшуються на 1к10 за кожен рівень слота вище 1-го (аж до максимуму 6к10).
  * */
  [Spell.HailOfThorns]: {
    name: 'ГРАД ШИПІВ',
    lvl: 1,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 бонусний вчинок === 0 секунд
    duration: 60,
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    description:
      'Наступного разу, коли ти попадеш по істоті атакою далекобійною зброєю, доки це заклинання триває, з твоєї далекобійної зброї або боєприпасів вилетить град шипів. На додаток до звичайного ефекту атаки, ціль та всі істоти в межах 1 метра від неї, повинні зробити кидок рятунку Вправності. При провалі істота отримує 1к10 колотих ушкоджень, або половину цих ушкоджень при успіху. На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його колоті ушкодження збільшуються на 1к10 за кожен рівень слота вище 1-го (аж до максимуму 6к10).',
    components: {
      c: true,
      t: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: ['колота'],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його колоті ушкодження збільшуються на 1к10 за кожен рівень слота вище 1-го (аж до максимуму 6к10).',
    },
  },
  /*
  * ГРОМОВА КАРА
1 рівень, втілення
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
В перший раз, коли ти попадаєш атакою рукопашною збро- єю, доки це заклинання триває, твоя зброя видає громовий гуркіт, чутний з відстані 60 метрів, і ця атака заподіює цілі додатково 2к6 ушкоджень звуком. Крім того, якщо ціль — істота, вона повинна зробити успішний кидок рятунку Сили, інакше вона буде відштовхнута на 2 метри від тебе і збита долілиць.

  * */
  [Spell.ThunderousSmite]: {
    name: 'ГРОМОВА КАРА',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 бонусний вчинок === 0 секунд
    duration: 60,
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    description:
      'В перший раз, коли ти попадаєш атакою рукопашною зброєю, доки це заклинання триває, твоя зброя видає громовий гуркіт, чутний з відстані 60 метрів, і ця атака заподіює цілі додатково 2к6 ушкоджень звуком. Крім того, якщо ціль — істота, вона повинна зробити успішний кидок рятунку Сили, інакше вона буде відштовхнута на 2 метри від тебе і збита долілиць.',
    components: {
      c: true,
      t: false,
    },
    concentration: true,
    canEndEarlier: true,
    saveThough: 'Сили',

    freeWay: false,
    ritual: false,
    source: Source.BasicRules,
    damageType: ['звук'],
  },
  /*
  * ГРОМОВА ХВИЛЯ
1 рівень, втілення
Час виконання: 1 вчинок Дистанція: На себе (3-метровий куб) Компоненти: С, Т
Тривалість: Миттєва
Від тебе лунає хвиля громовий сили. Всі істоти в кубі з дов- жиною ребра 3 метри, який виходить від тебе, повинні зро- бити кидок рятунку Статури. При провалі істота отримує 2к8 ушкоджень звуком і штовхається на 2 метри від тебе. При успіху істота отримує половину цих ушкоджень і не штовхається. Крім того, незакріплені предмети, які опини- лися повністю в області ефекту, автоматично штовхаються на 2 метри від тебе ефектом заклинання, і заклинання видає громовий гуркіт, чутний на відстані 60 метрів.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження збільшуються на 1к8 за кожен рівень слота вище 1-го.
  * */
  [Spell.Thunderwave]: {
    name: 'ГРОМОВА ХВИЛЯ',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 3, // 3-метровий куб
    self: true,
    target: 'cube', // куб з довжиною ребра 3 метри

    numberOfTargets: Infinity, // Залежить від місця та умов

    saveThough: 'Статура', // кидок рятунку Статури
    area: 'куб 3 метри',
    description:
      'Від тебе лунає хвиля громовий сили. Всі істоти в кубі з довжиною ребра 3 метри, який виходить від тебе, повинні зробити кидок рятунку Статури. При провалі істота отримує 2к8 ушкоджень звуком і штовхається на 2 метри від тебе. При успіху істота отримує половину цих ушкоджень і не штовхається. Крім того, незакріплені предмети, які опинились повністю в області ефекту, автоматично штовхаються на 2 метри від тебе ефектом заклинання, і заклинання видає громовий гуркіт, чутний на відстані 60 метрів.',
    components: {
      c: true,
      t: true,
    },
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: ['звук'],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушкодження збільшуються на 1к8 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * ДИСОНУЮЧИЙ ШЕПІТ
1 рівень, причарування
Час виконання: 1 вчинок Дистанція: 12 метрів Компоненти: С Тривалість: Миттєва
Ти пошепки наспівуєш негучну мелодію, яку чує тільки ви- брана тобою істота в межах дистанції, і яка завдає тій істоті страшний біль. Ціль повинна зробити кидок рятунку Му- дрості. У разі провалу вона отримує 3к6 ушкоджень психіч- ною енергією і повинна негайно реакцією пересунутись геть від тебе на відстань, рівну своїй швидкості. Істота не буде пересуватись в очевидно небезпечні місця, такі як вогонь або яма. При успішному кидку рятунку ціль отримує поло- вину цих ушкоджень і не повинна відступати. Глуха істота автоматично досягає успіху в цьому кидку рятунку.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження психічною енергією збільшуються на 1к6 за кожен рівень слота вище 1-го.
  * */
  [Spell.DissonantWhispers]: {
    name: 'ДИСОНУЮЧИЙ ШЕПІТ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 12, // 12 метрів
    components: {
      c: true,
      t: false,
    },
    saveThough: 'Мудрість', // кидок рятунку Мудрості
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: ['психіка'],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушкодження психічною енергією збільшуються на 1к6 за кожен рівень слота вище 1-го.',
    },
    description:
      'Ти пошепки наспівуєш негучну мелодію, яку чує тільки вибрана тобою істота в межах дистанції, і яка завдає тій істоті страшний біль. Ціль повинна зробити кидок рятунку Мудрості. У разі провалу вона отримує 3к6 ушкоджень психічною енергією і повинна негайно реакцією пересунутись геть від тебе на відстань, рівну своїй швидкості. Істота не буде пересуватись в очевидно небезпечні місця, такі як вогонь або яма. При успішному кидку рятунку ціль отримує половину цих ушкоджень і не повинна відступати. Глуха істота автоматично досягає успіху в цьому кидку рятунку.',
  },
  /*
  * ДОБРОЯГОДИ
1 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (гілочка омели) Тривалість: Миттєва
У твоїй руці з’являються не більше десяти ягід, наповнених магією. Будь-яка істота може своїм вчинком з’їсти одну ягоду. Це відновлює 1 очко здоров’я, а сама ягода настільки поживна, що насичує істоту на весь день. Ягоди втрачають силу, якщо їх не з’їсти через 24 години після створення.
  * */
  [Spell.Goodberry]: {
    name: 'ДОБРОЯГОДИ',
    lvl: 1,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 0, // Дотик
    components: {
      c: true,
      t: true,
      m: 'гілочка омели',
    },
    numberOfTargets: 0,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,

    description:
      'У твоїй руці з’являються не більше десяти ягід, наповнених магією. Будь-яка істота може своїм вчинком з’їсти одну ягоду. Це відновлює 1 очко здоров’я, а сама ягода настільки поживна, що насичує істоту на весь день. Ягоди втрачають силу, якщо їх не з’їсти через 24 години після створення.',
  },
  /*
  * ДРУЖБА З ТВАРИНАМИ
1 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 6 метрів
Компоненти: С, Т, М (шматочок їжі) Тривалість: 24 години
Це заклинання дозволяє переконати звіра, що ти не маєш наміру завдавати йому шкоди. Вибери звіра, якого ти бачиш в межах дистанції. Він повинен бачити і чути тебе. Якщо у звіра Інтелект нижче 4, заклинання провалюється. В іншо- му випадку звір повинен зробити успішний кидок рятунку Мудрості, інакше він стане причарованим тобою на час дії заклинання. Якщо ти або один із твоїх союзників завдасть цілі ушкодження, заклинання закінчиться.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, ти можеш вплинути ним на одного додаткового звіра за кожен рівень слота вище 1-го.

  * */
  [Spell.AnimalFriendship]: {
    name: 'ДРУЖБА З ТВАРИНАМИ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 86400, // 24 години
    distance: 6, // 6 метрів
    components: {
      c: true,
      t: true,
      m: 'шматочок їжі',
    },
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, ти можеш вплинути ним на одного додаткового звіра за кожен рівень слота вище 1-го.',
    },
    description:
      'Це заклинання дозволяє переконати звіра, що ти не маєш наміру завдавати йому шкоди. Вибери звіра, якого ти бачиш в межах дистанції. Він повинен бачити і чути тебе. Якщо у звіра Інтелект нижче 4, заклинання провалюється. В іншому випадку звір повинен зробити успішний кидок рятунку Мудрості, інакше він стане причарованим тобою на час дії заклинання. Якщо ти або один із твоїх союзників завдасть цілі ушкодження, заклинання закінчиться.',
  },
  /*
  * ЗАПЛУТУЮЧИЙ УДАР
1 рівень, виклик
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
Коли ти наступного разу попадеш по цілі атакою рукопаш- ною зброєю, доки це заклинання триває, в точці удару з’яв- ляється маса рослин з шипами, яка пробує обвити істоту, і ціль повинна зробити успішний кидок рятунку Сили, інак- ше вона стане окована магічними лозами, доки заклинання триває.
Істоти Великого і більшого розміру роблять цей кидок рятунку з перевагою. Якщо ціль досягає успіху в кидку ря- тунку, лози всихають. Будучи окованою цим заклинанням, ціль отримує 1к6 колотих ушкоджень на початку кожного свого ходу. Заплутана істота або істота, яка здатна торкну- тися до неї, може вчинком зробити перевірку Сили проти СК твоїх заклинань. При успіху ціль звільняється.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження збільшуються на 1к6 за кожен рівень слота вище 1-го.
  * */
  [Spell.EnsnaringStrike]: {
    name: 'ЗАПЛУТУЮЧИЙ УДАР',
    lvl: 1,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 бонусний вчинок === 0 секунд
    duration: 60,
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота

    components: {
      c: true,
    },
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: ['колота'],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушкодження збільшуються на 1к6 за кожен рівень слота вище 1-го.',
    },
    description:
      'Коли ти наступного разу попадеш по цілі атакою рукопашною зброєю, доки це заклинання триває, в точці удару з’являється маса рослин з шипами, яка пробує обвити істоту, і ціль повинна зробити успішний кидок рятунку Сили, інакше вона стане окована магічними лозами, доки заклинання триває. Істоти Великого і більшого розміру роблять цей кидок рятунку з перевагою. Якщо ціль досягає успіху в кидку рятунку, лози всихають. Будучи окованою цим заклинанням, ціль отримує 1к6 колотих ушкоджень на початку кожного свого ходу. Заплутана істота або істота, яка здатна торкнутися до неї, може вчинком зробити перевірку Сили проти СК твоїх заклинань. При успіху ціль звільняється.',
  },
  /*
  * ЗАХИСТ ВІД ЗЛА І ДОБРА
1 рівень, огородження
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (Свята вода або порошок срібла і за-
ліза, які поглинаються заклинанням) Тривалість: Концентрація, не довше 10 хвилин
Доки заклинання триває, одна згідна істота, до якої ти торкнувся, стає захищена від певного виду істот: аберацій, породжень, небожителів, нежиті, фей або елементалів.
Захист надає кілька переваг. Істоти обраного виду здій- снюють з перешкодою кидки атаки по цілі. Ціль також не може бути причарована, перелякана або одержима обра- ним типом істот. Якщо ціль вже причарована, перелякана або одержима такою істотою, ціль робить подальші кидки рятунку від таких ефектів з перевагою.
  * */
  [Spell.ProtectionFromEvilAndGood]: {
    name: 'ЗАХИСТ ВІД ЗЛА І ДОБРА',
    lvl: 1,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600, // 10 хвилин
    distance: 'Дотик',
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,

    components: {
      c: true,
      t: true,
      m: 'Свята вода або порошок срібла і заліза, які поглинаються заклинанням',
    },
    description:
      'Доки заклинання триває, одна згідна істота, до якої ти торкнувся, стає захищеною від певного виду істот: аберацій, породжень, небожителів, нежиті, фей або елементалів. Захист надає кілька переваг. Істоти обраного виду здійснюють з перешкодою кидки атаки по цілі. Ціль також не може бути причарована, перелякана або одержима обраним типом істот. Якщо ціль вже причарована, перелякана або одержима такою істотою, ціль робить подальші кидки рятунку від таких ефектів з перевагою.',
  },
  /*
КОВЗКІСТЬ
1 рівень, виклик
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (шматок масла або свинячого сала) Тривалість: 1 хвилина
Слизький жир покриває підлогу в квадраті з довжиною сторони 2 метри з центром в точці в межах дистанції, ро- блячи цю місцевість важкопрохідною, доки заклинання триває.
Коли жир з’являється, всі істоти, які стоять у цій області, повинні зробити успішний кидок рятунку Вправності, інак- ше вони падають долілиць. Істоти, які входять в цю область або закінчують там хід, теж повинні зробити успішний ки- док рятунку Вправності, аби не впасти долілиць.
 */
  [Spell.Grease]: {
    name: 'КОВЗКІСТЬ',
    lvl: 1,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60, // 1 хвилина
    distance: 12, // 12 метрів
    components: {
      c: true,
      t: true,
      m: 'шматок масла або свинячого сала',
    },
    numberOfTargets: 0,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    area: 'квадрат 2 метри',
    saveThough: 'Вправності',

    description:
      'Слизький жир покриває підлогу в квадраті з довжиною сторони 2 метри з центром в точці в межах дистанції, роблячи цю місцевість важкопрохідною, доки заклинання триває. Коли жир з’являється, всі істоти, які стоять у цій області, повинні зробити успішний кидок рятунку Вправності, інакше вони падають долілиць. Істоти, які входять в цю область або закінчують там хід, теж повинні зробити успішний кидок рятунку Вправності, аби не впасти долілиць.',
  },
  /*
  * ЛІКУВАННЯ РАН
1 рівень, втілення
Час виконання: 1 вчинок Дистанція: Дотик Компоненти: С, Т Тривалість: Миттєва
Істота, до якої ти торкаєшся, відновлює собі кількість здо- ров’я, рівну 1к8 + модифікатор твоєї базової характеристи- ки. Це заклинання не робить ніякого ефекту на нежить і конструктів.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, лікування збільшується на 1к8 за кожен рівень слота вище 1-го.

* */
  [Spell.CureWounds]: {
    name: 'ЛІКУВАННЯ РАН',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 'Дотик',
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,

    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Істота, до якої ти торкаєшся, відновлює собі кількість здоров’я, рівну 1к8 + модифікатор твоєї базової характеристики. Це заклинання не робить ніякого ефекту на нежить і конструктів.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, лікування збільшується на 1к8 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * МАГІЧНИЙ ПОСТРІЛ
1 рівень, втілення
Час виконання: 1 вчинок Дистанція: 24 метри Компоненти: С, Т Тривалість: Миттєва
Ти випускаєш три яскраві магічні постріли. Кожен постріл націлюється на істоту за твоїм вибором, яку ти можеш ба- чити в межах дистанції. Кожен постріл наносить цілі 1к4 + 1 ушкоджень силовим полем. Усі постріли вистрілюють одночасно і ти сам обираєш, чи вони направлені в одну ціль, чи в різні.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, то воно ство- рює по одному додатковому пострілу за кожен рівень слота вище 1-го.
  * */

  [Spell.MagicMissile]: {
    name: 'МАГІЧНИЙ ПОСТРІЛ',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 24, // 24 метри
    components: {
      c: true,
      t: true,
    },
    numberOfTargets: 3,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: ['сила'],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, то воно створює по одному додатковому пострілу за кожен рівень слота вище 1-го.',
    },
    description:
      'Ти випускаєш три яскраві магічні постріли. Кожен постріл націлюється на істоту за твоїм вибором, яку ти можеш бачити в межах дистанції. Кожен постріл наносить цілі 1к4 + 1 ушкоджень силовим полем. Усі постріли вистрілюють одночасно і ти сам обираєш, чи вони направлені в одну ціль, чи в різні.',
  },
  /*
  * МАСКУВАННЯ
1 рівень, ілюзія
Час виконання: 1 вчинок Дистанція: На себе Компоненти: С, Т Тривалість: 1 година
Ти примушуєш себе — включаючи твій одяг, обладунки, зброю та інше майно — виглядати інакше, доки заклинан- ня не скінчиться, або доки ти не закінчиш його передчасно, використавши вчинок. Ти можеш виглядати на 30 сантиме- трів вищим або нижчим, а також стати худим, товстим або отримати середню статуру. Ти не можеш змінювати основу тіла, тому у нової форми повинен бути такий же набір кін- цівок. У всьому іншому ти сам визначаєш характер ілюзії.
Зміни, викликані цим заклинанням, провалюють пере- вірку фізичною взаємодією. Наприклад, якщо ти додав до свого спорядження капелюх, предмети будуть проходити крізь нього, а всі, хто до нього доторкнуться, нічого не від- чують, або відчують твою голову і волосся. Якщо ти станеш худішим, то рука того, хто до тебе тягнеться, наткнеться на тебе на півдорозі, ще в повітрі.
Для виявлення того, що ти замаскований, істота має вчинком обстежити твою зовнішність і досягти успіху в пе- ревірці Інтелекту (Обстеження) проти СК твоїх заклинань.
  * */
  [Spell.DisguiseSelf]: {
    name: 'МАСКУВАННЯ',
    lvl: 1,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600, // 1 година
    distance: 'На себе',
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 0,
    concentration: false,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Ти примушуєш себе — включаючи твій одяг, обладунки, зброю та інше майно — виглядати інакше, доки заклинання не скінчиться, або доки ти не закінчиш його передчасно, використавши вчинок. Ти можеш виглядати на 30 сантиметрів вищим або нижчим, а також стати худим, товстим або отримати середню статуру. Ти не можеш змінювати основу тіла, тому у нової форми повинен бути такий же набір кінцівок. У всьому іншому ти сам визначаєш характер ілюзії. Зміни, викликані цим заклинанням, провалюють перевірку фізичною взаємодією. Наприклад, якщо ти додав до свого спорядження капелюх, предмети будуть проходити крізь нього, а всі, хто до нього доторкнуться, нічого не відчують, або відчують твою голову і волосся. Якщо ти станеш худішим, то рука того, хто до тебе тягнеться, наткнеться на тебе на півдорозі, ще в повітрі. Для виявлення того, що ти замаскований, істота має вчинком обстежити твою зовнішність і досягти успіху в перевірці Інтелекту (Обстеження) проти СК твоїх заклинань.',
  },
  /*
  * МІТКА МИСЛИВЦЯ
1 рівень, віщування
Час виконання: 1 бонусний вчинок Дистанція: 18 метрів
Компоненти: С
Тривалість: Концентрація, не довше 1 години
Ти вибираєш істоту, яку бачиш у межах дистанції, та імену- єш її своєю здобиччю. Доки заклинання триває, ти завдаєш цій цілі додатково 1к6 ушкоджень кожен раз, коли попада- єш по ній атакою зброєю, і ти робиш з перевагою перевірки Мудрості (Уважності) та Мудрості (Виживання), здійснені для її пошуку. Якщо здоров’я цілі опускається до 0, коли заклинання активне, ти можеш у свій наступний хід бонус- ним вчинком вибрати ціллю нову істоту.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 або 4 рівня, ти можеш підтри- мувати концентрацію до 8 годин. Якщо ти використовуєш магічний слот 5 рівня або вищого, ти можеш підтримувати концентрацію до 24 годин.
  * */

  [Spell.HunterMark]: {
    name: 'МІТКА МИСЛИВЦЯ',
    lvl: 1,
    school: MagicSchool.Divination, // віщування
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 бонусний вчинок === 0 секунд
    duration: 3600, // 1 година
    distance: 18, // 18 метрів
    components: {
      c: true,
    },
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    saveThough: 'Мудрості (Уважності) та Мудрості (Виживання)',
    damageType: [],
    source: Source.BasicRules,

    highLvl: {
      has: true,
      from: 3,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 або 4 рівня, ти можеш підтримувати концентрацію до 8 годин. Якщо ти використовуєш магічний слот 5 рівня або вищого, ти можеш підтримувати концентрацію до 24 годин.',
    },
    description:
      'Ти вибираєш істоту, яку бачиш у межах дистанції, та іменуєш її своєю здобиччю. Доки заклинання триває, ти завдаєш цій цілі додатково 1к6 ушкоджень кожен раз, коли попадаєш по ній атакою зброєю, і ти робиш з перевагою перевірки Мудрості (Уважності) та Мудрості (Виживання), здійснені для її пошуку. Якщо здоров’я цілі опускається до 0, коли заклинання активне, ти можеш у свій наступний хід бонусним вчинком вибрати ціллю нову істоту.',
  },
  /*
  * МОТОРОШНИЙ СМІХ ТАШІ
1 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 6 метрів
Компоненти: С, Т, М (маленькі тістечка і перо, яким по-
трібно махати в повітрі)
Тривалість: Концентрація, не довше 1 хвилини
Доки заклинання триває, істота на твій вибір, яку ти бачиш в межах дистанції, сприймає все неймовірно смішним, і корчиться від сміху. Ціль повинна зробити успішний кидок рятунку Мудрості, інакше вона падає долілиць, стає недієз- датною, і протягом дії заклинання не може встати. Істоти зі значенням Інтелекту 4 і нижчим не потрапляють під дію цього заклинання. В кінці кожного свого ходу, і кожен раз при отриманні ушкоджень, ціль може здійснювати новий кидок рятунку Мудрості. Кидок рятунку відбувається з пе- ревагою, якщо він був викликаний нанесенням ушкоджень. При успішному кидку заклинання закінчується.
  * */

  [Spell.TashaHideousLaughter]: {
    name: 'МОТОРОШНИЙ СМІХ ТАШІ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60, // 1 хвилина
    distance: 6, // 6 метрів
    components: {
      c: true,
      t: true,
      m: 'маленькі тістечка і перо, яким потрібно махати в повітрі',
    },
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    saveThough: 'Мудрості',
    damageType: [],
    source: Source.BasicRules,
    description:
      'Доки заклинання триває, істота на твій вибір, яку ти бачиш в межах дистанції, сприймає все неймовірно смішним, і корчиться від сміху. Ціль повинна зробити успішний кидок рятунку Мудрості, інакше вона падає долілиць, стає недієздатною, і протягом дії заклинання не може встати. Істоти зі значенням Інтелекту 4 і нижчим не потрапляють під дію цього заклинання. В кінці кожного свого ходу, і кожен раз при отриманні ушкоджень, ціль може здійснювати новий кидок рятунку Мудрості. Кидок рятунку відбувається з перевагою, якщо він був викликаний нанесенням ушкоджень. При успішному кидку заклинання закінчується.',
  },
  /*
  * НАКАЗ
1 рівень, причарування
Час виконання: 1 вчинок Дистанція: 12 метрів Компоненти: С Тривалість: 1 раунд
Ти вимовляєш наказ із одного слова істоті, яку бачиш в ме- жах дистанції. Ціль повинна зробити успішний кидок ря- тунку Мудрості, інакше вона у свій наступний хід мусить виконувати цей наказ. Заклинання не дає ефекту, якщо ціль — нежить, якщо ціль не розуміє твою мову, або якщо твій наказ їй безпосередньо зашкодить. Нижче описані найтипо- віші накази та їх ефекти. Ти можеш віддавати й інші накази. У цьому випадку поведінку цілі визначає Майстер. Якщо ціль не може виконати твій наказ, заклинання закінчується.
Кидай. Ціль упускає з рук усе те, що тримає, і закінчує хід.
Падай. Ціль падає долілиць і закінчує хід.
Підійди. Ціль пересувається ближче до тебе по найкорот- шому і самому прямому маршруту, закінчуючи хід, якщо опиняється в межах 1 метра від тебе.
Стій. Ціль не пересувається і не робить ніяких вчинків. Літаюча істота продовжує парити на місці, за умови, що
 216
може це робити. Якщо вона має летіти, щоб не впасти, то пролітає мінімально необхідну відстань.
Тікай. Ціль витрачає хід на те, що просунутись геть від тебе найшвидшим шляхом.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, ти можеш вплинути на ще одну додаткову істоту за кожен рівень сло- та вище 1-го. Істоти повинні знаходитися в межах 6 метрів одна від одної, щоб їх можна було обирати цілями.
  * */

  [Spell.Command]: {
    name: 'НАКАЗ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 6, // 1 раунд
    distance: 12, // 12 метрів
    components: {
      c: true,
    },
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    saveThough: 'Мудрості',
    damageType: [],
    source: Source.BasicRules,
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, ти можеш вплинути на ще одну додаткову істоту за кожен рівень слота вище 1-го. Істоти повинні знаходитися в межах 6 метрів одна від одної, щоб їх можна було обирати цілями.',
    },
    description:
      'Ти вимовляєш наказ із одного слова істоті, яку бачиш в межах дистанції. Ціль повинна зробити успішний кидок рятунку Мудрості, інакше вона у свій наступний хід мусить виконувати цей наказ. Заклинання не дає ефекту, якщо ціль — нежить, якщо ціль не розуміє твою мову, або якщо твій наказ їй безпосередньо зашкодить. Нижче описані найтиповіші накази та їх ефекти. Ти можеш віддавати й інші накази. У цьому випадку поведінку цілі визначає Майстер. Якщо ціль не може виконати твій наказ, заклинання закінчується.',
  },

  /*
  * НАНЕСЕННЯ РАН
1 рівень, некромантія
Час виконання: 1 вчинок Дистанція: Дотик Компоненти: С, Т Тривалість: Миттєва
Здійсни рукопашну атаку заклинанням по істоті в межах досяжності. При попаданні ціль отримує 3к10 ушкоджень некротичною енергією.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження збільшуються на 1к10 за кожен рівень слота вище 1-го.
  * */
  [Spell.InflictWounds]: {
    name: 'НАНЕСЕННЯ РАН',
    lvl: 1,
    school: MagicSchool.Necromancy, // некромантія
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 'Дотик',
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: ['некротичною'],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Здійсни рукопашну атаку заклинанням по істоті в межах досяжності. При попаданні ціль отримує 3к10 ушкоджень некротичною енергією.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушкодження збільшуються на 1к10 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * НЕВИДИМЕ ПИСЬМО
1 рівень, ілюзія (ритуал)
Час виконання: 1 хвилина
Дистанція: Дотик
Компоненти: С, М (свинцеве чорнило, вартістю мінімум
10 зм, яке поглинаються заклинанням) Тривалість: 10 днів
Ти пишеш на пергаменті, папері або іншому відповідному матеріалі, і покриваєш його ілюзією, яка існує, доки закли- нання триває. Для тебе та усіх істот, зазначених тобою при
виконанні заклинання, письмена здаються звичайними, на- писаними твоєю рукою, і передають той самий сенс, який ти вклав. Для всіх інших письмена здаються написаними на невідомій або магічній мові, яку неможливо прочитати. В якості альтернативи ти можеш змусити письмена поміняти сенс, або зробити так, щоб вони виглядали написаними ін- шою рукою або іншою мовою, але мова при цьому повинна бути такою, яку ти знаєш.
Якщо заклинання розсіяти, зникає і оригінальний лист, і ілюзія. Істота з істинним зором може прочитати приховане послання.
  * */

  [Spell.IllusoryScript]: {
    name: 'НЕВИДИМЕ ПИСЬМО',
    lvl: 1,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action, // 1 вчинок
    castTime: 60, // 1 хвилина
    duration: 864000, // 10 днів
    distance: 'Дотик',
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      m: 'свинцеве чорнило, вартістю мінімум 10 зм, яке поглинаються заклинанням',
    },
    description:
      'Ти пишеш на пергаменті, папері або іншому відповідному матеріалі, і покриваєш його ілюзією, яка існує, доки заклинання триває. Для тебе та усіх істот, зазначених тобою при виконанні заклинання, письмена здаються звичайними, написаними твоєю рукою, і передають той самий сенс, який ти вклав. Для всіх інших письмена здаються написаними на невідомій або магічній мові, яку неможливо прочитати. В якості альтернативи ти можеш змусити письмена поміняти сенс, або зробити так, щоб вони виглядали написаними іншою рукою або іншою мовою, але мова при цьому повинна бути такою, яку ти знаєш. Якщо заклинання розсіяти, зникає і оригінальний лист, і ілюзія. Істота з істинним зором може прочитати приховане послання.',
  },
  /*
  * НЕЗРИМИЙ СЛУГА
1 рівень, виклик
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (частина тятиви і шматочок дерева) Тривалість: 1 година
Це заклинання створює невидиму, безсвідому і безформну силу Середнього розміру, яка виконує віддані тобою прості доручення. Слуга з’являється у вільному просторі на по- верхні в межах дистанції. У нього КО 10, 1 очко здоров’я, Сила 2, і він не може атакувати. Якщо його здоров’я опус- кається до 0, заклинання закінчується.
Один раз в кожен свій хід ти можеш бонусним вчинком віддати команду слузі пройти на 3 метри і зробити мані- пуляції з яким-небудь предметом. Слуга може виконувати прості завдання, доступні людині, такі як підношення пред- метів, чистка, лагодження та складання одягу, розпалюван- ня багаття, подача їжі і розливання вина. Отримавши ко- манду, слуга починає її виконувати, намагаючись з усіх сил, поки не виконає, після чого починає чекати твою наступну команду. Якщо ти віддаєш слузі доручення, через яке той виявиться далі ніж за 12 метрів від тебе, заклинання закін- чується.
  * */
  [Spell.UnseenServant]: {
    name: 'НЕЗРИМИЙ СЛУГА',
    lvl: 1,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600, // 1 година
    distance: 12, // 12 метрів
    components: {
      c: true,
      t: true,
      m: 'частина тятиви і шматочок дерева',
    },
    numberOfTargets: 0,
    concentration: false,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Це заклинання створює невидиму, безсвідому і безформну силу Середнього розміру, яка виконує віддані тобою прості доручення. Слуга з’являється у вільному просторі на поверхні в межах дистанції. У нього КО 10, 1 очко здоров’я, Сила 2, і він не може атакувати. Якщо його здоров’я опускається до 0, заклинання закінчується. Один раз в кожен свій хід ти можеш бонусним вчинком віддати команду слузі пройти на 3 метри і зробити маніпуляції з яким-небудь предметом. Слуга може виконувати прості завдання, доступні людині, такі як підношення предметів, чистка, лагодження та складання одягу, розпалювання багаття, подача їжі і розливання вина. Отримавши команду, слуга починає її виконувати, намагаючись з усіх сил, поки не виконає, після чого починає чекати твою наступну команду. Якщо ти віддаєш слузі доручення, через яке той виявиться далі ніж за 12 метрів від тебе, заклинання закінчується.',
  },
  /*
  * ОБЛАДУНКИ МАГА
1 рівень, огородження
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (шматочок ремісничої шкіри) Тривалість: 8 годин
Ти торкаєшся до згідної істоти, яка не має обладунків, і на час тривалості заклинання її огортає захисне магічне поле. Базовий КО істоти тепер дорівнює 13 + її модифікатор Вправності. Заклинання закінчується раніше, якщо ціль надягає обладунок, або коли ти своїм вчинком закінчуєш його.
  * */
  [Spell.MageArmor]: {
    name: 'ОБЛАДУНКИ МАГА',
    lvl: 1,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 28800, // 8 годин
    distance: 0, // Дотик
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'шматочок ремісничої шкіри',
    },
    description:
      'Ти торкаєшся до згідної істоти, яка не має обладунків, і на час тривалості заклинання її огортає захисне магічне поле. Базовий КО істоти тепер дорівнює 13 + її модифікатор Вправності. Заклинання закінчується раніше, якщо ціль надягає обладунок, або коли ти своїм вчинком закінчуєш його.',
  },
  /*
  * ОБЛАДУНОК АГАТІСА
1 рівень, огородження
Час виконання: 1 вчинок Дистанція: На себе
Компоненти: С, Т, М (чашка води) Тривалість: 1 година
Тебе оточує захисне магічне поле, яке проявляється у ви- гляді примарної паморозі, що покрила тебе і твоє споря- дження. Ти отримуєш 5 тимчасового здоров’я на період дії заклинання. Якщо істота попадає по тобі рукопашною ата- кою, доки у тебе є це здоров’я, вона отримує 5 ушкоджень холодом.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, тоді і це тимча- сове здоров’я і ушкодження холодом збільшуються на 5 за кожен рівень слота вище 1-го.
  * */
  [Spell.ArmorOfAgathys]: {
    name: 'ОБЛАДУНОК АГАТІСА',
    lvl: 1,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600, // 1 година
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 0,
    concentration: false,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: ['холодом'],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'чашка води',
    },
    description:
      'Тебе оточує захисне магічне поле, яке проявляється у вигляді примарної паморозі, що покрила тебе і твоє спорядження. Ти отримуєш 5 тимчасового здоров’я на період дії заклинання. Якщо істота попадає по тобі рукопашною атакою, доки у тебе є це здоров’я, вона отримує 5 ушкоджень холодом.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, тоді і це тимчасове здоров’я і ушкодження холодом збільшуються на 5 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * ОБПЛУТУВАННЯ
1 рівень, виклик
Час виконання: 1 вчинок
Дистанція: 18 метрів
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 хвилини
З точки в межах дистанції на площі квадрата з довжиною сторони в 4 метри виростають чіпкі бур’яни і лози. Доки заклинання триває, ці рослини перетворюють землю в важ- копрохідну місцевість. Істоти, які знаходяться в цій області, коли ти виконуєш це заклинання, повинні зробити успіш- ний кидок рятунку Сили, інакше вони стануть оковані рос- линами до закінчення дії заклинання. Окована рослинами істота може вчинком здійснювати перевірки Сили проти СК твоїх заклинань. У разі успіху вона звільняється. Коли заклинання закінчується, викликані рослини в’януть.
  * */
  [Spell.Entangle]: {
    name: 'ОБПЛУТУВАННЯ',
    lvl: 1,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60, // Концентрація, не довше 1 хвилини
    distance: 18, // 18 метрів
    self: false,
    target: 'point', // Ціль цієї атаки — істота
    numberOfTargets: 0,
    area: 'квадрат з довжиною сторони в 4 метри',
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'З точки в межах дистанції на площі квадрата з довжиною сторони в 4 метри виростають чіпкі бур’яни і лози. Доки заклинання триває, ці рослини перетворюють землю в важкопрохідну місцевість. Істоти, які знаходяться в цій області, коли ти виконуєш це заклинання, повинні зробити успішний кидок рятунку Сили, інакше вони стануть оковані рослинами до закінчення дії заклинання. Окована рослинами істота може вчинком здійснювати перевірки Сили проти СК твоїх заклинань. У разі успіху вона звільняється. Коли заклинання закінчується, викликані рослини в’януть.',
  },
  /*
  * ОЧИЩЕННЯ ЇЖІ ТА ПИТТЯ
1 рівень, видозміна (ритуал)
Час виконання: 1 вчинок Дистанція: 2 метри Компоненти: С, Т Тривалість: Миттєва
Вся немагічна їжа і пиття в межах сфери з радіусом 1 метра з центром в точці, обраній тобою в межах дистанції, очища- ється і позбавляється від отрут і хвороб.
  * */
  [Spell.PurifyFoodAndDrink]: {
    name: 'ОЧИЩЕННЯ ЇЖІ ТА ПИТТЯ',
    lvl: 1,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0, // Миттєва
    distance: 2, // 2 метри
    self: false,
    target: 'їжа', // Ціль цієї атаки — істота
    numberOfTargets: 0,
    area: 'сфера з радіусом 1 метра',
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Вся немагічна їжа і пиття в межах сфери з радіусом 1 метра з центром в точці, обраній тобою в межах дистанції, очищається і позбавляється від отрут і хвороб.',
  },
  /*
  * ПАДІННЯ ПІР’ЇНКОЮ
1 рівень, видозміна
Час виконання: 1 реакція, яку ти здійснюєш, коли ти або іс- тота в межах 12 метрів від тебе починає падати
Дистанція: 12 метрів
Компоненти: С, М (невелике перо або шматочок пуху) Тривалість: 1 хвилина
Вибери не більше п’яти падаючих істот в межах дистанції. До закінчення дії заклинання їхня швидкість падіння змен- шується на 12 метрів за раунд. Якщо така істота призем- литься до закінчення заклинання, вона не отримує ушко- дження від падіння та може приземлитися на ноги, і тоді дія заклинання на ній закінчується.
  * */
  [Spell.FeatherFall]: {
    name: 'ПАДІННЯ ПІР’ЇНКОЮ',
    lvl: 1,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Reaction, // 1 реакція, яку ти здійснюєш, коли ти або істота в межах 12 метрів від тебе починає падати
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60, // 1 хвилина
    distance: 12, // 12 метрів
    reactionCondition: 'коли ти або істота в межах 12 метрів від тебе починає падати', // при реакції
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 5,
    concentration: false,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      m: 'невелике перо або шматочок пуху',
    },
    description:
      'Вибери не більше п’яти падаючих істот в межах дистанції. До закінчення дії заклинання їхня швидкість падіння зменшується на 12 метрів за раунд. Якщо така істота приземлиться до закінчення заклинання, вона не отримує ушкодження від падіння та може приземлитися на ноги, і тоді дія заклинання на ній закінчується.',
  },
  /*
  * ПЕКЕЛЬНА ВІДПЛАТА
1 рівень, втілення
Час виконання: 1 реакція, яку ти здійснюєш у відповідь на отримання ушкоджень від істоти, яку ти бачиш в межах 12 метрів від себе
Дистанція: 12 метрів Компоненти: С, Т Тривалість: Миттєва
Ти вказуєш пальцем, і істота, яка завдала тобі ушкодження, миттєво оточується полум’ям. Істота має зробити кидок рятунку Вправності. Вона отримує 2к10 ушкоджень вогнем при провалі, або половину цих ушкоджень при успіху.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, його ушкоджен- ня збільшуються на 1к10 за кожен рівень слота вище 1-го.
  * */
  [Spell.HellishRebuke]: {
    name: 'ПЕКЕЛЬНА ВІДПЛАТА',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Reaction, // 1 реакція, яку ти здійснюєш у відповідь на отримання ушкоджень від істоти, яку ти бачиш в межах 12 метрів від себе
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0, // Миттєва
    distance: 12, // 12 метрів
    reactionCondition:
      'у відповідь на отримання ушкоджень від істоти, яку ти бачиш в межах 12 метрів від себе', // при реакції
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: ['вогнем'],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },

    description:
      'Ти вказуєш пальцем, і істота, яка завдала тобі ушкодження, миттєво оточується полум’ям. Істота має зробити кидок рятунку Вправності. Вона отримує 2к10 ушкоджень вогнем при провалі, або половину цих ушкоджень при успіху.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушкодження збільшуються на 1к10 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * ПОЛУМ’ЯНА КАРА
1 рівень, втілення
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
Коли ти наступного разу попадеш по істоті атакою руко- пашною зброєю, доки це заклинання триває, твоя зброя спалахує яскравим білим світлом, і атака заподіює цілі до- датково 1к6 ушкоджень вогнем та підпалює її. Доки закли- нання триває, ціль на початку кожного свого ходу повинна здійснювати кидок рятунку Статури. При провалі вона отримує 1к6 ушкоджень вогнем. При успіху заклинання за- кінчується.
Якщо ціль або істота, яка знаходиться в межах 1 метра від неї, витратить вчинок на гасіння полум’я, або якщо якийсь інший ефект погасив полум’я (наприклад, занурення в воду), заклинання теж закінчиться.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, то первинні до- даткові ушкодження від атаки збільшуються на 1к6 за кожен рівень слота вище 1-го.
  * */
  [Spell.SearingSmite]: {
    name: 'ПОЛУМ’ЯНА КАРА',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60, // Концентрація, не довше 1 хвилини
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 0,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: ['вогнем'],
    source: Source.BasicRules,
    components: {
      c: true,
    },
    description:
      'Коли ти наступного разу попадеш по істоті атакою рукопашною зброєю, доки це заклинання триває, твоя зброя спалахує яскравим білим світлом, і атака заподіює цілі додатково 1к6 ушкоджень вогнем та підпалює її. Доки заклинання триває, ціль на початку кожного свого ходу повинна здійснювати кидок рятунку Статури. При провалі вона отримує 1к6 ушкоджень вогнем. При успіху заклинання закінчується. Якщо ціль або істота, яка знаходиться в межах 1 метра від неї, витратить вчинок на гасіння полум’я, або якщо якийсь інший ефект погасив полум’я (наприклад, занурення в воду), заклинання теж закінчиться.',
  },
  /*
  * ПОРЧА
1 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 6 метрів
Компоненти: С, Т, М (крапля крові) Тривалість: Концентрація, не довше 1 хвилини
Не більше трьох істот в межах дистанції, яких ти бачиш, повинні зробити кидок рятунку Харизми. Доки заклинан- ня триває, кожен раз, коли ціль, яка провалила цей кидок рятунку, здійснює кидок атаки або кидок рятунку, вона по- винна кинути к4 і відняти результат, який випав, від її кидка атаки або кидка рятунку .
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, то ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 1-го.

  * */
  [Spell.Bane]: {
    name: 'ПОРЧА',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60, // Концентрація, не довше 1 хвилини
    distance: 6, // 6 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 3,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'крапля крові',
    },
    description:
      'Не більше трьох істот в межах дистанції, яких ти бачиш, повинні зробити кидок рятунку Харизми. Доки заклинання триває, кожен раз, коли ціль, яка провалила цей кидок рятунку, здійснює кидок атаки або кидок рятунку, вона повинна кинути к4 і відняти результат, який випав, від її кидка атаки або кидка рятунку.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, то ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * ПОШУК ФАМІЛЬЯРА
1 рівень, виклик (ритуал)
Час виконання: 1 година
Дистанція: 2 метри
Компоненти: С, Т, М (вугілля, пахощі і трави, які спалю-
ються в вогні або латунній жаровні, загальною вартістю
на 10 зм) Тривалість: Миттєва
Ти отримуєш на службу фамільяра — духа, який приймає вигляд обраної тобою тварини: ворона, кішки, краба, щура, летючої миші, жаби, морського коника, восьминога, паву-
ка, риби (піраньї), сови, тхора, отруйної змії, яструба або ящірки. З’явившись у вільному просторі в межах дистанції, фамільяр здобуває параметри обраної форми, хоча він не звір, а небожитель, фея або породження (на твій вибір).
Твій фамільяр діє незалежно від тебе, але завжди підкоря- ється твоїм командам. У бою він визначає власну ініціативу та діє у свій хід. Фамільяр не може атакувати, але може ро- бити інші вчинки. Коли здоров’я фамільяра опускається до 0, він зникає, не залишаючи фізичного тіла. Він повертаєть- ся, коли ти виконуєш це заклинання ще раз. Доки фамільяр знаходиться в межах 20 метрів від тебе, ти можеш спілку- ватися з ним телепатично. Крім того, ти можеш вчинком почати дивитися очима фамільяра і слухати його вухами до початку свого наступного ходу, отримуючи перевагу від особливих відчуттів, якими може володіти фамільяр. У цей час для твоїх власних відчуттів ти сліпий і глухий.
Ти можеш вчинком тимчасово відпустити свого фамі- льяра. Той зникає в кишеньковому вимірі, де буде чекати, поки ти його не викличеш. В якості альтернативи, ти мо- жеш відпустити його назовсім. Якщо фамільяр тимчасово відпущений, ти можеш вчинком повернути його у вільний простір в межах 6 метрів від себе.
У тебе не може бути більше одного фамільяра одночасно. Якщо ти виконуєш це заклинання, вже маючи фамільяра, ти змушуєш його прийняти новий вигляд. Вибери один з описаних вище видів. Твій фамільяр стає цією істотою.
Якщо ти виконуєш заклинання з дистанцією «дотик», то цей дотик може передати фамільяр, так як ніби б це він його виконував. Твій фамільяр повинен при цьому перебу- вати в межах 20 метрів від тебе, і він використовує свою ре- акцію, коли ти виконуєш заклинання цим способом. Якщо заклинання вимагає кидка атаки, ти використовуєш свій модифікатор атаки.
  * */
  [Spell.FindFamiliar]: {
    name: 'ПОШУК ФАМІЛЬЯРА',
    lvl: 1,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action, // 1 вчинок
    castTime: 3600, // 1 година
    duration: 0, // Миттєва
    distance: 2, // 2 метри
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 0,
    ritual: true,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'вугілля, пахощі і трави, які спалюються в вогні або латунній жаровні, загальною вартістю на 10 зм',
    },
    description:
      'Ти отримуєш на службу фамільяра — духа, який приймає вигляд обраної тобою тварини: ворона, кішки, краба, щура, летючої миші, жаби, морського коника, восьминога, павука, риби (піраньї), сови, тхора, отруйної змії, яструба або ящірки. З’явившись у вільному просторі в межах дистанції, фамільяр здобуває параметри обраної форми, хоча він не звір, а небожитель, фея або породження (на твій вибір). Твій фамільяр діє незалежно від тебе, але завжди підкоряється твоїм командам. У бою він визначає власну ініціативу та діє у свій хід. Фамільяр не може атакувати, але може робити інші вчинки. Коли здоров’я фамільяра опускається до 0, він зникає, не залишаючи фізичного тіла. Він повертається, коли ти виконуєш це заклинання ще раз. Доки фамільяр знаходиться в межах 20 метрів від тебе, ти можеш спілкуватися з ним телепатично. Крім того, ти можеш вчинком почати дивитися очима фамільяра і слухати його вухами до початку свого наступного ходу, отримуючи перевагу від особливих відчуттів, якими може володіти фамільяр. У цей час для твоїх власних відчуттів ти сліпий і глухий. Ти можеш вчинком тимчасово відпустити свого фамільяра. Той зникає в кишеньковому вимірі, де буде чекати, поки ти його не викличеш. В якості альтернативи, ти можеш відпустити його назовсім. Якщо фамільяр тимчасово відпущений, ти можеш вчинком повернути його у вільний простір в межах 6 метрів від себе. У тебе не може бути більше одного фамільяра одночасно. Якщо ти виконуєш це заклинання, вже маючи фамільяра, ти змушуєш його прийняти новий вигляд. Вибери один з описаних вище видів. Твій фамільяр стає цією істотою. Якщо ти виконуєш заклинання з дистанцією «дотик», то цей дотик може передати фамільяр, так як ніби б це він його виконував. Твій фамільяр повинен при цьому перебувати в межах 20 метрів від тебе, і він використовує свою реакцію, коли ти виконуєш заклинання цим способом. Якщо заклинання вимагає кидка атаки, ти використовуєш свій модифікатор атаки.',
  },
  /*
  * ПРИСПАННЯ
1 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 18 метрів
Компоненти: С, Т, М (щіпка дрібного піску, пелюстки тро-
янди або цвіркун) Тривалість: 1 хвилина
Це заклинання посилає істот в магічний сон. Кинь 5к8; ре- зультат буде кількістю здоров’я істот, на яких це заклинання може вплинути. Істоти в межах 4 метрів від точки, обраної тобою в межах дистанції, потрапляють під дію заклинання в порядку збільшення їхнього поточного здоров’я (ігнору- ючи тих істот, які знаходяться без свідомості). Починаючи з істоти з найменшою кількістю поточного здоров’я, усі іс- тоти, які потрапляють під дію цього заклинання, втрачають свідомість до закінчення тривалості заклинання, доки не отримають ушкоджень, або доки хтось інший не розбудить їх, витративши вчинок на тряску або ляпас.
Віднімай здоров’я кожної істоти від загальної суми, піс- ля чого переходь до наступної істоти з найменшим числом здоров’я. Для того щоб істота потрапила під дію закли- нання, потрібно щоб кількість її поточного здоров’я не пе- ревищувала решту суми. Нежить та істоти, які володіють імунітетом до причарування, не потрапляють під дію цього заклинання.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, кидай додатко- во по 2к8 за кожен рівень слота вище 1-го.
  * */
  [Spell.Sleep]: {
    name: 'ПРИСПАННЯ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60, // 1 хвилина
    distance: 18, // 18 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: Infinity,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'щіпка дрібного піску, пелюстки троянди або цвіркун',
    },
    description:
      'Це заклинання посилає істот в магічний сон. Кинь 5к8; результат буде кількістю здоров’я істот, на яких це заклинання може вплинути. Істоти в межах 4 метрів від точки, обраної тобою в межах дистанції, потрапляють під дію заклинання в порядку збільшення їхнього поточного здоров’я (ігноруючи тих істот, які знаходяться без свідомості). Починаючи з істоти з найменшою кількістю поточного здоров’я, усі істоти, які потрапляють під дію цього заклинання, втрачають свідомість до закінчення тривалості заклинання, доки не отримають ушкоджень, або доки хтось інший не розбудить їх, витративши вчинок на тряску або ляпас. Віднімай здоров’я кожної істоти від загальної суми, після чого переходь до наступної істоти з найменшим числом здоров’я. Для того щоб істота потрапила під дію заклинання, потрібно щоб кількість її поточного здоров’я не перевищувала решту суми. Нежить та істоти, які володіють імунітетом до причарування, не потрапляють під дію цього заклинання.',
    highLvl: {
      has: true,
      from: 2,
      description: 'кидай додатко- во по 2к8 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * ПРИТУЛОК
1 рівень, огородження
Час виконання: 1 бонусний вчинок
Дистанція: 6 метрів
Компоненти: С, Т, М (маленьке срібне дзеркальце) Тривалість: 1 хвилина
Ти захищаєш одну істоту в межах дистанції від атаки. Доки заклинання триває, всі істоти, які попадають по захищеній істоті атаками або шкідливими заклинаннями, повинні спочатку зробити кидок рятунку Мудрості. При провалі іс- тота має вибрати нову ціль або ж вона втратить атаку чи за- клинання. Це заклинання не захищає від ефектів, які діють на площу, таких як вибух від вогняної кулі. Якщо захищена істота робить атаку або виконує заклинання, яке діє на во- рожу істоту, це заклинання закінчується.
  * */

  [Spell.Sanctuary]: {
    name: 'ПРИТУЛОК',
    lvl: 1,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60, // 1 хвилина
    distance: 6, // 6 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'маленьке срібне дзеркальце',
    },
    description:
      'Ти захищаєш одну істоту в межах дистанції від атаки. Доки заклинання триває, всі істоти, які попадають по захищеній істоті атаками або шкідливими заклинаннями, повинні спочатку зробити кидок рятунку Мудрості. При провалі істота має вибрати нову ціль або ж вона втратить атаку чи заклинання. Це заклинання не захищає від ефектів, які діють на площу, таких як вибух від вогняної кулі. Якщо захищена істота робить атаку або виконує заклинання, яке діє на ворожу істоту, це заклинання закінчується.',
  },
  /*
  * ПРИЧАРУВАННЯ ОСОБИ
1 рівень, причарування
Час виконання: 1 вчинок Дистанція: 6 метрів Компоненти: С, Т Тривалість: 1 година
Ти намагаєшся причарувати гуманоїда, якого бачиш в ме- жах дистанції. Він повинен зробити кидок рятунку Мудро- сті (кидок рятунку робиться з перевагою, якщо ти або твої супутники б’єтесь з ним). Якщо він провалює цей кидок рятунку, він стає причарований тобою, доки заклинання триває або доки ти або твої супутники не завдадуть йому ушкоджень. Причарована істота вважає тебе своїм другом. Коли заклинання закінчується, істота знає, що була прича- рована тобою.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 1-го. Ці істоти повинні знаходитися в ме- жах 6 метрів одна від одної, щоб ти міг на них націлитися.
  * */
  [Spell.CharmPerson]: {
    name: 'ПРИЧАРУВАННЯ ОСОБИ',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600, // 1 година
    distance: 6, // 6 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Ти намагаєшся причарувати гуманоїда, якого бачиш в межах дистанції. Він повинен зробити кидок рятунку Мудрості (кидок рятунку робиться з перевагою, якщо ти або твої супутники б’єтесь з ним). Якщо він провалює цей кидок рятунку, він стає причарований тобою, доки заклинання триває або доки ти або твої супутники не завдадуть йому ушкоджень. Причарована істота вважає тебе своїм другом. Коли заклинання закінчується, істота знає, що була причарована тобою.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 1-го. Ці істоти повинні знаходитися в межах 6 метрів одна від одної, щоб ти міг на них націлитися.',
    },
  },
  /*
  * ПРОКЛІН
1 рівень, причарування
Час виконання: 1 бонусний вчинок
Дистанція: 18 метрів
Компоненти: С, Т, М (закам’яніле око тритона) Тривалість: Концентрація, не довше 1 години
Ти насилаєш проклін на істоту, яку бачиш в межах дис- танції. Доки заклинання триває, ти завдаєш цілі 1к6 ушко- джень некротичною енергією кожен раз, коли попадаєш по ній атакою. Крім того, вибери одну характеристику, коли виконуєш це заклинання. Ціль робить з перешкодою пере- вірки обраної характеристики.
Якщо здоров’я цілі опускається до 0, коли заклинання триває, ти можеш у свій наступний хід своїм бонусним вчинком наслати проклін на нову істоту.
Зняття прокляття, виконане на ціль, закінчує це за- клинання передчасно.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 або 4 рівня, ти можеш підтри- мувати концентрацію на ньому до 8 годин. Якщо ти вико- ристовуєш магічний слот 5 рівня або вищого, ти можеш під- тримувати концентрацію на ньому до 24 годин.
  * */

  [Spell.Hex]: {
    name: 'ПРОКЛІН',
    lvl: 1,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600, // 1 година
    distance: 18, // 18 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: ['некротичне'],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'закам’яніле око тритона',
    },
    description:
      'Ти насилаєш проклін на істоту, яку бачиш в межах дистанції. Доки заклинання триває, ти завдаєш цілі 1к6 ушкоджень некротичною енергією кожен раз, коли попадаєш по ній атакою. Крім того, вибери одну характеристику, коли виконуєш це заклинання. Ціль робить з перешкодою перевірки обраної характеристики. Якщо здоров’я цілі опускається до 0, коли заклинання триває, ти можеш у свій наступний хід своїм бонусним вчинком наслати проклін на нову істоту. Зняття прокляття, виконане на ціль, закінчує це заклинання передчасно.',
    highLvl: {
      has: true,
      from: 3,
      description:
        'ти можеш підтри- мувати концентрацію на ньому до 8 годин. Якщо ти вико- ристовуєш магічний слот 5 рівня або вищого, ти можеш під- тримувати концентрацію на ньому до 24 годин.',
    },
  },
  /*
  * ПРОМІНЬ ХВОРОБИ
1 рівень, некромантія
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т
Тривалість: Миттєва
Промінь нудотно-зеленої енергії спрямовується до істоти, яка знаходиться в межах дистанції. Здійсни далекобійну
атаку заклинанням по цілі. При попаданні ціль отримує 2к8 ушкоджень отрутою і повинна зробити кидок рятунку Статури. При провалі вона стає також отруєною до кінця твого наступного ходу.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження збільшуються на 1к8 за кожен рівень слота вище першого.
  * */
  [Spell.RayOfSickness]: {
    name: 'ПРОМІНЬ ХВОРОБИ',
    lvl: 1,
    school: MagicSchool.Necromancy, // некромантія
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0, // Миттєва
    distance: 12, // 12 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: ['отрута'],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Промінь нудотно-зеленої енергії спрямовується до істоти, яка знаходиться в межах дистанції. Здійсни далекобійну атаку заклинанням по цілі. При попаданні ціль отримує 2к8 ушкоджень отрутою і повинна зробити кидок рятунку Статури. При провалі вона стає також отруєною до кінця твого наступного ходу.',
    highLvl: {
      has: true,
      from: 2,
      description: 'його ушко- дження збільшуються на 1к8 за кожен рівень слота вище першого.',
    },
  },
  /*
  * ПРУДКИЙ ВІДСТУП
1 рівень, видозміна
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С, Т
Тривалість: Концентрація, не довше 10 хвилин
Це заклинання дозволяє пересуватись з неймовірною швидкістю. Коли ти виконуєш це заклинання, а також в на- ступні ходи, поки воно триває, ти можеш своїм бонусним вчинком здійснювати вчинок Ривок.
  * */
  [Spell.ExpeditiousRetreat]: {
    name: 'ПРУДКИЙ ВІДСТУП',
    lvl: 1,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.BonusAction, // 1 бонусний вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600, // 10 хвилин
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Це заклинання дозволяє пересуватись з неймовірною швидкістю. Коли ти виконуєш це заклинання, а також в наступні ходи, поки воно триває, ти можеш своїм бонусним вчинком здійснювати вчинок Ривок.',
  },
  /*
  * РОЗМОВА З ТВАРИНАМИ
1 рівень, віщування
Час виконання: 1 вчинок Дистанція: На себе Компоненти: С, Т Тривалість: Миттєва
На період тривалості заклинання ти отримуєш можливість розуміти звірів та спілкуватися з ними усно. Знання і сві- домість багатьох звірів обмежена їх інтелектом, але вони як мінімум можуть дати інформацію про найближчі місця і чудовиськ, включаючи тих, кого вони бачили за останній день. На розсуд Майстра, ти можеш спробувати перекона- ти звіра надати тобі невелику допомогу.

  * */
  [Spell.SpeakWithAnimals]: {
    name: 'РОЗМОВА З ТВАРИНАМИ',
    lvl: 1,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action, // 1 вчинок
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0, // Миттєва
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: Infinity,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'На період тривалості заклинання ти отримуєш можливість розуміти звірів та спілкуватися з ними усно. Знання і сві- домість багатьох звірів обмежена їх інтелектом, але вони як мінімум можуть дати інформацію про найближчі місця і чудовиськ, включаючи тих, кого вони бачили за останній день. На розсуд Майстра, ти можеш спробувати перекона- ти звіра надати тобі невелику допомогу.',
  },
  /*
  * РОЗПІЗНАВАННЯ
1 рівень, віщування (ритуал)
Час виконання: 1 година
Дистанція: Дотик
Компоненти: С, Т, М (перлина, вартістю мінімум 100 зм, і
перо сови) Тривалість: Миттєва
Ти вибираєш один предмет, і не перестаєш торкатися до нього під час усього виконання заклинання. Якщо це магіч- ний предмет, ти дізнаєшся його властивості, спосіб їх вико- ристання, чи необхідна для користування ним настройка на нього, і скільки залишилося зарядів, якщо вони є. Ти дізна- єшся, чи діють в даний момент заклинання на цей предмет, і які саме це заклинання.
Якщо предмет був створений заклинанням, ти дізнаєшся, що це було за заклинання. Якщо ти замість цього під час ви- конання заклинання торкаєшся до істоти, ти дізнаєшся, які заклинання в даний момент діють на неї.
  * */
  [Spell.Identify]: {
    name: 'РОЗПІЗНАВАННЯ',
    lvl: 1,
    school: MagicSchool.Divination, // віщування
    actionType: Action.LongTerm, // ритуал
    castTime: 3600, // 1 година
    duration: 0, // Миттєва
    distance: 0, // Дотик
    self: true,
    target: 'item', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'перлина, вартістю мінімум 100 зм, і перо сови',
    },
    description:
      'Ти вибираєш один предмет, і не перестаєш торкатися до нього під час усього виконання заклинання. Якщо це магіч- ний предмет, ти дізнаєшся його властивості, спосіб їх вико- ристання, чи необхідна для користування ним настройка на нього, і скільки залишилося зарядів, якщо вони є. Ти дізна- єшся, чи діють в даний момент заклинання на цей предмет, і які саме це заклинання. Якщо предмет був створений заклинанням, ти дізнаєшся, що це було за заклинання. Якщо ти замість цього під час ви- конання заклинання торкаєшся до істоти, ти дізнаєшся, які заклинання в даний момент діють на неї.',
  },
  /*
  * РОЗУМІННЯ МОВ
1 рівень, віщування (ритуал)
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (щіпка сажі та солі) Тривалість: 1 година
Доки заклинання триває, ти розумієш буквальний сенс усіх почутих розмов на будь-яких мовах. Ти також розумі- єш письмена на будь-яких мовах, але ти повинен торкатися до поверхні, на якій записані слова. Необхідна приблизно 1 хвилина для читання однієї сторінки тексту.
Це заклинання не розшифровує таємні послання в тек- стах та символи, такі як магічні знаки, які не є частиною тексту.

  * */
  [Spell.ComprehendLanguages]: {
    name: 'РОЗУМІННЯ МОВ',
    lvl: 1,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action, // ритуал
    castTime: 0, // 1 вчинок
    duration: 3600, // 1 година
    distance: 0, // На себе
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: Infinity,
    concentration: false,
    canEndEarlier: true,
    freeWay: true,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'щіпка сажі та солі',
    },
    description:
      'Доки заклинання триває, ти розумієш буквальний сенс усіх почутих розмов на будь-яких мовах. Ти також розумі- єш письмена на будь-яких мовах, але ти повинен торкатися до поверхні, на якій записані слова. Необхідна приблизно 1 хвилина для читання однієї сторінки тексту. Це заклинання не розшифровує таємні послання в тек- стах та символи, такі як магічні знаки, які не є частиною тексту.',
  },
  /*
  * РУКИ ГАДАРА
1 рівень, виклик (ритуал)
Час виконання: 1 вчинок
Дистанція: На себе (2-метровий радіус) Компоненти: С, Т
Тривалість: Миттєва
Ти звертаєшся до сили Гадара, Темного Алкателя. З тебе ви- риваються щупальця з темної енергії, які б’ють усіх істот в межах 2 метрів. Усі істоти в цій області повинні зробити ки- док рятунку Сили. У разі провалу ціль отримує 2к6 ушко- джень некротичною енергією і в наступному ходу не може здійснювати реакції. У разі успіху істота отримує половину цих ушкоджень без ніяких ефектів в наступний хід.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження збільшуються на 1к6 за кожен рівень слота вище першого.
* */
  [Spell.ArmsOfHadar]: {
    name: 'РУКИ ГАДАРА',
    lvl: 1,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action, // ритуал
    castTime: 0, // 1 вчинок
    duration: 0, // Миттєва
    distance: 0, // На себе (2-метровий радіус)
    self: true,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: Infinity,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: true,
    damageType: ['некротичне'],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Ти звертаєшся до сили Гадара, Темного Алкателя. З тебе ви- риваються щупальця з темної енергії, які б’ють усіх істот в межах 2 метрів. Усі істоти в цій області повинні зробити ки- док рятунку Сили. У разі провалу ціль отримує 2к6 ушко- джень некротичною енергією і в наступному ходу не може здійснювати реакції. У разі успіху істота отримує половину цих ушкоджень без ніяких ефектів в наступний хід.',
    highLvl: {
      has: true,
      from: 2,
      description: 'його ушко- дження збільшуються на 1к6 за кожен рівень слота вище першого.',
    },
  },
  /*
  * СИГНАЛІЗАЦІЯ
1 рівень, огородження (ритуал)
Час виконання: 1 хвилина
Дистанція: 6 метрів
Компоненти: С, Т, М (дзвіночок і срібний дротик) Тривалість: 8 годин
Ти встановлюєш сигналізацію на випадок вторгнення. Ви- бери двері, вікно або область в межах дистанції не більші від куба з довжиною ребра 4 метри. До закінчення тривалості заклинання сигналізація тривога повідомляє тебе кожен раз, коли до області під охороною торкається (або входить в неї) істота з розміром не менше Крихітного.
При виконанні заклинання ти можеш вказати істот, які не викликатимуть спрацювання тривоги. Ти також вибира- єш, чи буде тривога уявною або чутною. Уявна тривога по- переджає тебе дзвоном у свідомості, якщо ти перебуваєш в межах 1500 метрів від області під цією охороною. Цей дзвін пробуджує тебе, якщо ти спиш. Чутна тривога видає дзвін дзвіночка протягом 10 секунд в межах 12 метрів.
* */
  [Spell.Alarm]: {
    name: 'СИГНАЛІЗАЦІЯ',
    lvl: 1,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.LongTerm, // ритуал
    castTime: 60, // 1 хвилина
    duration: 28800, // 8 годин
    distance: 6, // 6 метрів
    self: false,
    target: 'item', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: true,
    freeWay: false,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'дзвіночок і срібний дротик',
    },
    description:
      'Ти встановлюєш сигналізацію на випадок вторгнення. Ви- бери двері, вікно або область в межах дистанції не більші від куба з довжиною ребра 4 метри. До закінчення тривалості заклинання сигналізація тривога повідомляє тебе кожен раз, коли до області під охороною торкається (або входить в неї) істота з розміром не менше Крихітного. При виконанні заклинання ти можеш вказати істот, які не викликатимуть спрацювання тривоги. Ти також вибира- єш, чи буде тривога уявною або чутною. Уявна тривога по- переджає тебе дзвоном у свідомості, якщо ти перебуваєш в межах 1500 метрів від області під цією охороною. Цей дзвін пробуджує тебе, якщо ти спиш. Чутна тривога видає дзвін дзвіночка протягом 10 секунд в межах 12 метрів.',
  },
  /*
  * СКОРОХІД
1 рівень, видозміна
Час виконання: 1 вчинок Дистанція: Дотик
Компоненти: С, Т, М (щіпка землі) Тривалість: 1 година
Ти торкаєшся до істоти. Доки заклинання триває, швид- кість цієї істоти збільшується на 2 метри.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 1-го.
* */
  [Spell.Longstrider]: {
    name: 'СКОРОХІД',
    lvl: 1,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 3600, // 1 година
    distance: 0, // Дотик
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: Infinity,
    concentration: false,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'щіпка землі',
    },
    description:
      'Ти торкаєшся до істоти. Доки заклинання триває, швид- кість цієї істоти збільшується на 2 метри.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * СПРЯМОВАНИЙ ЗАРЯД
1 рівень, втілення
Час виконання: 1 вчинок Дистанція: 24 метри Компоненти: С, Т Тривалість: 1 раунд
Спалах світла спрямовується до вибраної тобою істоти в ме- жах дистанції. Здійсни далекобійну атаку заклинанням по цілі. При попаданні ціль отримує 4к6 ушкоджень випромі- нюванням, і наступний кидок атаки по цілі, здійснений до кінця твого наступного ходу, відбувається з перевагою, зав- дяки містичному тьмяному світлу, яке недовго залишається на цілі.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження збільшуються на 1к6 за кожен рівень слота вище 1-го.
* */
  [Spell.GuidingBolt]: {
    name: 'СПРЯМОВАНИЙ ЗАРЯД',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 6, // 1 раунд
    distance: 24, // 24 метри
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    damageType: ['випромінювання'],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Спалах світла спрямовується до вибраної тобою істоти в ме- жах дистанції. Здійсни далекобійну атаку заклинанням по цілі. При попаданні ціль отримує 4к6 ушкоджень випромі- нюванням, і наступний кидок атаки по цілі, здійснений до кінця твого наступного ходу, відбувається з перевагою, зав- дяки містичному тьмяному світлу, яке недовго залишається на цілі.',
    highLvl: {
      has: true,
      from: 2,
      description: 'його ушко- дження збільшуються на 1к6 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * СТВОРЕННЯ АБО ЗНИЩЕННЯ ВОДИ
1 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: 6 метрів
Компоненти: С, Т, М (крапля води, якщо вода створюєть-
ся, або кілька піщинок, якщо вода знищується) Тривалість: Миттєва
Ти або створюєш, або знищуєш воду.
Створення води. Ти створюєш не більше 40 літрів чистої
води в межах дистанції у відкритому контейнері. В якості альтернативи, вода випадає дощем в кубі з довжиною ребра 6 метрів в межах дистанції, та тушить при цьому відкрите полум’я.
Знищення води. Ти знищуєш не більше 40 літрів води у відкритому контейнері в межах дистанції. В якості альтер- нативи, ти знищуєш туман в кубі з довжиною ребра 6 ме- трів в межах дистанції.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, ти створюєш або знищуєш по 40 додаткових літрів води, а довжина ребра куба збільшується на 1 метр за кожен рівень слота вище 1-го.
* */

  [Spell.CreateOrDestroyWater]: {
    name: 'СТВОРЕННЯ АБО ЗНИЩЕННЯ ВОДИ',
    lvl: 1,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 0, // Миттєва
    distance: 6, // 6 метрів
    self: false,
    target: 'item', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'крапля води, якщо вода створюєть-ся, або кілька піщинок, якщо вода знищується',
    },
    description:
      'Ти або створюєш, або знищуєш воду. Створення води. Ти створюєш не більше 40 літрів чистої води в межах дистанції у відкритому контейнері. В якості альтернативи, вода випадає дощем в кубі з довжиною ребра 6 метрів в межах дистанції, та тушить при цьому відкрите полум’я. Знищення води. Ти знищуєш не більше 40 літрів води у відкритому контейнері в межах дистанції. В якості альтер- нативи, ти знищуєш туман в кубі з довжиною ребра 6 ме- трів в межах дистанції.',
  },
  /*
  * СТРИБОК
1 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (задня лапка коника стрибунця) Тривалість: 1 хвилина
Ти торкаєшся до істоти. Доки заклинання триває, відстань стрибків цієї істоти збільшується в три рази.

* */

  [Spell.Jump]: {
    name: 'СТРИБОК',
    lvl: 1,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 60, // 1 хвилина
    distance: 0, // Дотик
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'задня лапка коника стрибунця',
    },
    description:
      'Ти торкаєшся до істоти. Доки заклинання триває, відстань стрибків цієї істоти збільшується в три рази.',
  },
  /*
  * ТЕНЗЕРІВ ЛЕТЮЧИЙ ДИСК
1 рівень, виклик (ритуал)
Час виконання: 1 вчинок Дистанція: 6 метрів
Компоненти: С, Т, М (крапля ртуті) Тривалість: 1 година
Це заклинання створює цілісний горизонтальний диск із силового поля діаметром 1 метр і товщиною 3 см, який парить на висоті 1 метр над підлогою у обраному тобою вільному просторі, який ти бачиш в межах дистанції. Диск існує, доки триває це заклинання, і він може нести на собі не більше 250 кілограмів. Якщо на нього помістити більшу вагу, заклинання закінчиться, і все, що було на диску, падає вниз. Диск нерухомий, доки ти перебуваєш в межах 4 ме- трів від нього. Якщо ти пересунешся від нього на відстань, яка перевищує 4 метри, диск послідує за тобою, залишаю- чись в межах 4 метрів. Він може перелітати по нерівній по- верхні, пересуватись по сходах, схилах і подібних перешко- дах, але не може перетинати перепади висотою більш як 2 метри. Наприклад, диск не зможе перелетіти над 2-метро- вою ямою, і не зможе з неї вибратися, якщо буде створений на її дні. Якщо ти пересунешся далі ніж на 20 метрів від дис- ка (наприклад, якщо він через перешкоди не зможе піти за тобою), заклинання закінчується.
* */

  [Spell.TensersFloatingDisk]: {
    name: 'ТЕНЗЕРІВ ЛЕТЮЧИЙ ДИСК',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 3600, // 1 година
    distance: 6, // 6 метрів
    self: false,
    target: 'item', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'крапля ртуті',
    },
    description:
      'Це заклинання створює цілісний горизонтальний диск із силового поля діаметром 1 метр і товщиною 3 см, який парить на висоті 1 метр над підлогою у обраному тобою вільному просторі, який ти бачиш в межах дистанції. Диск існує, доки триває це заклинання, і він може нести на собі не більше 250 кілограмів. Якщо на нього помістити більшу вагу, заклинання закінчиться, і все, що було на диску, падає вниз. Диск нерухомий, доки ти перебуваєш в межах 4 ме- трів від нього. Якщо ти пересунешся від нього на відстань, яка перевищує 4 метри, диск послідує за тобою, залишаю- чись в межах 4 метрів. Він може перелітати по нерівній по- верхні, пересуватись по сходах, схилах і подібних перешко- дах, але не може перетинати перепади висотою більш як 2 метри. Наприклад, диск не зможе перелетіти над 2-метро- вою ямою, і не зможе з неї вибратися, якщо буде створений на її дні. Якщо ти пересунешся далі ніж на 20 метрів від дис- ка (наприклад, якщо він через перешкоди не зможе піти за тобою), заклинання закінчується.',
  },
  /*
  * ТУМАННА ХМАРА
1 рівень, виклик
Час виконання: 1 вчинок
Дистанція: 24 метри
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 години
Ти створюєш туманну сферу з радіусом 4 метри з центром у точці в межах дистанції. Сфера огинає кути, а її простір — це місцевість з відсутньою видимістю. Вона існує до закін- чення тривалості заклинання, або доки її не розвіє вітер (зі швидкістю як мінімум 15 кілометрів за годину).
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, радіус туману збільшується на 4 метри за кожен рівень слота вище 1-го.
* */

  [Spell.FogCloud]: {
    name: 'ТУМАННА ХМАРА',
    lvl: 1,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 3600, // 1 година
    distance: 24, // 24 метри
    self: false,
    target: 'point', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'Ти створюєш туманну сферу з радіусом 4 метри з центром у точці в межах дистанції. Сфера огинає кути, а її простір — це місцевість з відсутньою видимістю. Вона існує до закін- чення тривалості заклинання, або доки її не розвіє вітер (зі швидкістю як мінімум 15 кілометрів за годину).',
    highLvl: {
      has: true,
      from: 2,
      description: 'радіус туману збільшується на 4 метри за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * ФАЛЬШИВЕ ЗДОРОВ’Я
1 рівень, некромантія
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (невелика кількість алкоголю або ди-
стильованого спирту) Тривалість: 1 година
Зміцнивши себе некротичною подобою життя, ти отриму- єш 1к4 + 4 тимчасового здоров’я на період тривалості за- клинання.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, ти отримуєш ще по 5 додаткового тимчасового здоров’я за кожен рівень слота вище 1-го.
* */

  [Spell.FalseLife]: {
    name: 'ФАЛЬШИВЕ ЗДОРОВ’Я',
    lvl: 1,
    school: MagicSchool.Necromancy, // некромантія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 3600, // 1 година
    distance: 0, // На себе
    self: true,
    target: 'self', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'невелика кількість алкоголю або ди-стильованого спирту',
    },
    description:
      'Зміцнивши себе некротичною подобою життя, ти отриму- єш 1к4 + 4 тимчасового здоров’я на період тривалості за- клинання.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'ти отримуєш ще по 5 додаткового тимчасового здоров’я за кожен рівень слота вище 1-го.',
    },
  },
  /*
  * ФЕЙСЬКИЙ ВОГОНЬ
1 рівень, втілення
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
Всі предмети в кубі з довжиною ребра 4 метри в межах дистанції підсвічуються синім, зеленим або фіолетовим ко-
льором (на твій вибір). Всі істоти в цій області теж підсвічу- ються, якщо провалюють кидок рятунку Вправності. На час тривалості заклинання підсвічені предмети і істоти випус- кають тьмяне світло в радіусі 2 метрів.
Всі кидки атак по істотах і предметах, на яких впливає ефект цього заклинання, відбуваються з перевагою, якщо атакуючий бачить їх, а також ці істоти і предмети не отри- мують жодних переваг від невидимості.
* */

  [Spell.FaerieFire]: {
    name: 'ФЕЙСЬКИЙ ВОГОНЬ',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 60, // 1 хвилина
    distance: 12, // 12 метрів
    self: false,
    target: 'point', // Ціль цієї атаки — істота
    numberOfTargets: Infinity,
    area: 'cube', // куб з довжиною ребра 4 метри
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
    },
    description:
      'Всі предмети в кубі з довжиною ребра 4 метри в межах дистанції підсвічуються синім, зеленим або фіолетовим ко- льором (на твій вибір). Всі істоти в цій області теж підсвічу- ються, якщо провалюють кидок рятунку Вправності. На час тривалості заклинання підсвічені предмети і істоти випус- кають тьмяне світло в радіусі 2 метрів. Всі кидки атак по істотах і предметах, на яких впливає ефект цього заклинання, відбуваються з перевагою, якщо атакуючий бачить їх, а також ці істоти і предмети не отри- мують жодних переваг від невидимості.',
  },
  /*
  * ХРОМАТИЧНА СФЕРА
1 рівень, втілення
Час виконання: 1 хвилина
Дистанція: 18 метрів
Компоненти: С, Т, М (діамант,вартістю мінімум 50 зм) Тривалість: Миттєва
Ти кидаєш 10-сантиметрову сферу енергії в живу істоту, яку бачиш в межах дистанції. Вибери звук, кислоту, вогонь, холод, електрику або отруту при створенні сфери, а потім здійсни по цілі далекобійну атаку заклинанням. Якщо ата- ка попадає, істота отримує 3к8 ушкоджень обраного тобою виду.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 2 рівня або вищого, його ушко- дження збільшуються на 1к8 за кожен рівень слота вище 1-го.
* * */

  [Spell.ChromaticOrb]: {
    name: 'ХРОМАТИЧНА СФЕРА',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.LongTerm,
    castTime: 60, // 1 хвилина
    duration: 0, // Миттєва
    distance: 18, // 18 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    area: 'sphere', // 10-сантиметрову сферу енергії
    damageType: ['звук', 'кислота', 'вогонь', 'холод', 'електрика', 'отрута'],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'діамант,вартістю мінімум 50 зм',
    },
    description:
      'Ти кидаєш 10-сантиметрову сферу енергії в живу істоту, яку бачиш в межах дистанції. Вибери звук, кислоту, вогонь, холод, електрику або отруту при створенні сфери, а потім здійсни по цілі далекобійну атаку заклинанням. Якщо ата- ка попадає, істота отримує 3к8 ушкоджень обраного тобою виду.',
    highLvl: {
      has: true,
      from: 2,
      description: 'його ушко- дження збільшуються на 1к8 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  *
  * ЦІЛЮЩЕ СЛОВО
1 рівень, втілення
Час виконання: 1 бонусний вчинок Дистанція: 12 метрів Компоненти: С
Тривалість: Миттєва
Істота на твій вибір, яку ти бачиш в межах дистанції, віднов- лює собі кількість здоров’я, рівну 1к4 + твій модифікатор базової характеристики. Це заклинання не робить ніякого ефекту на нежить і конструктів.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, кількість від- новлюваного здоров’я збільшується на 1к4 за кожен рівень слота вище 1-го.
* */

  [Spell.HealingWord]: {
    name: 'ЦІЛЮЩЕ СЛОВО',
    lvl: 1,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.BonusAction,
    castTime: 0, // 1 бонусний вчинок
    duration: 0, // Миттєва
    distance: 12, // 12 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: Infinity,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
    },
    description:
      'Істота на твій вибір, яку ти бачиш в межах дистанції, віднов- лює собі кількість здоров’я, рівну 1к4 + твій модифікатор базової характеристики. Це заклинання не робить ніякого ефекту на нежить і конструктів.',
    highLvl: {
      has: true,
      from: 2,
      description:
        'кількість від- новлюваного здоров’я збільшується на 1к4 за кожен рівень слота вище 1-го.',
    },
  },
  /*
  *
ЩИТ
1 рівень, огородження
Час виконання: 1 реакція, яку ти здійснюєш, коли по тобі попадає атака або ти стаєш ціллю магічного пострілу
Дистанція: На себе Компоненти: С, Т Тривалість: 1 раунд
З’являється невидимий бар’єр із магічної сили, який тебе захищає. До початку твого наступного ходу ти отримуєш бонус +5 до свого КО, в тому числі і проти спровокованих атак, і ти не отримуєш ушкоджень від магічного пострілу.

* */

  [Spell.Shield]: {
    name: 'ЩИТ',
    lvl: 1,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Reaction,
    castTime: 0, // 1 реакція, яку ти здійснюєш, коли по тобі попадає атака або ти стаєш ціллю магічного пострілу
    duration: 0, // 1 раунд
    distance: 0, // На себе
    self: true,
    target: 'self', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
    },
    description:
      'З’являється невидимий бар’єр із магічної сили, який тебе захищає. До початку твого наступного ходу ти отримуєш бонус +5 до свого КО, в тому числі і проти спровокованих атак, і ти не отримуєш ушкоджень від магічного пострілу.',
  },
  /*
  * ЩИТ ВІРИ
1 рівень, огородження
Час виконання: 1 бонусний вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (невеликий пергамент зі святими
письменами)
Тривалість: Концентрація, не довше 10 хвилин
З’являється мерехтливе поле, яке оточує вибрану тобою іс- тоту в межах дистанції, даруючи їй на час тривалості бонус +2 до її КО.
* */

  [Spell.ShieldOfFaith]: {
    name: 'ЩИТ ВІРИ',
    lvl: 1,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.BonusAction,
    castTime: 0, // 1 бонусний вчинок
    duration: 600, // Концентрація, не довше 10 хвилин
    distance: 12, // 12 метрів
    self: false,
    target: 'creature', // Ціль цієї атаки — істота
    numberOfTargets: 1,
    concentration: true,
    canEndEarlier: true,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'невеликий пергамент зі святими письменами',
    },
    description:
      'З’являється мерехтливе поле, яке оточує вибрану тобою іс- тоту в межах дистанції, даруючи їй на час тривалості бонус +2 до її КО.',
  },
  /*
  * ЯСКРАВИЙ СПЛЕСК
1 рівень, ілюзія
Час виконання: 1 вчинок
Дистанція: На себе (3-метровий конус)
Компоненти: С, Т, М (щіпка порошку або піску, пофарбо-
ваного в червоний, жовтий і синій колір) Тривалість: 1 раунд
З твоєї руки вилітають яскраві різнокольорові промені. Кинь 6к10; результат покаже, яка сума здоров’я істот по- трапляє під ефект. Істоти в 3-метровому конусі, який вихо- дить від тебе, потрапляють під ефект у порядку збільшення поточного здоров’я (ігноруючи тих, хто без свідомості і/або осліплений).
Починаючи від істоти з найменшим числом поточно- го здоров’я, всі істоти, які потрапили під дію заклинання, стають осліплені до кінця твого наступного ходу. Віднімай із залишку здоров’я вже осліплених істот і переходь до на- ступних. Здоров’я істоти не повинне перевищувати зали- шок, щоб ця істота потрапила під дію заклинання.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 2 рівня або вищого, кидай додатко- во по 2к10 за кожен рівень слота вище 1-го.
* */

  [Spell.ColorSpray]: {
    name: 'ЯСКРАВИЙ СПЛЕСК',
    lvl: 1,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок
    duration: 0, // 1 раунд
    distance: 0, // На себе (3-метровий конус)
    self: true,
    target: 'cone', // Ціль цієї атаки — істота
    numberOfTargets: Infinity,
    concentration: false,
    canEndEarlier: false,
    freeWay: true,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
    components: {
      c: true,
      t: true,
      m: 'щіпка порошку або піску, пофарбо- ваного в червоний, жовтий і синій колір',
    },
    highLvl: {
      has: true,
      from: 2,
      description: 'кидай додатко- во по 2к10 за кожен рівень слота вище 1-го.',
    },
    description:
      'З твоєї руки вилітають яскраві різнокольорові промені. Кинь 6к10; результат покаже, яка сума здоров’я істот по- трапляє під ефект. Істоти в 3-метровому конусі, який вихо- дить від тебе, потрапляють під ефект у порядку збільшення поточного здоров’я (ігноруючи тих, хто без свідомості і/або осліплений). Починаючи від істоти з найменшим числом поточно- го здоров’я, всі істоти, які потрапили під дію заклинання, стають осліплені до кінця твого наступного ходу. Віднімай із залишку здоров’я вже осліплених істот і переходь до на- ступних. Здоров’я істоти не повинне перевищувати зали- шок, щоб ця істота потрапила під дію заклинання.',
  },
};

// const l = Object.keys(Spell);
// const r = [];
//
// for (let i = 0; i < l.length; i += 1) {
//   if (!spells[l[i]]) r.push(l[i]);
// }
// console.log(r);

export default spells;
