import { Action, ISpell, Source, MagicSchool, DamageType } from '@/types/spell';
import { Spell } from '@/types/spells';

const spells: { -readonly [key in keyof typeof Spell]?: ISpell } = {
  /*
    * БАЧЕННЯ НЕВИДИМОГО
2 рівень, віщування
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (щіпка тальку і товченого срібла) Тривалість: 1 година
Доки це заклинання триває, ти бачиш невидимих істот і предмети, як ніби б вони були видимі, а твій зір простяга- ється на Ефірну Площину. Ефірні істоти і предмети вигля- дають примарними і напівпрозорими.

* */
  [Spell.SeeInvisibility]: {
    name: 'БАЧЕННЯ НЕВИДИМОГО',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Доки це заклинання триває, ти бачиш невидимих істот і предмети, як ніби б вони були видимі, а твій зір простягається на Ефірну Площину. Ефірні істоти і предмети виглядають примарними і напівпрозорими.',
    components: {
      c: true,
      t: true,
      m: 'щіпка тальку і товченого срібла',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },

  /*
    * БЕЗСЛІДНЕ ПЕРЕСУВАННЯ
2 рівень, огородження
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (попіл від спаленого листка омели і
гілочка ялини)
Тривалість: Концентрація, не довше 1 години
Від тебе починає виходити покрив тіней і тиші, який прихо- вує тебе та твоїх супутників від виявлення. Доки заклинан- ня триває, всі істоти, обрані тобою в межах 6 метрів (вклю- чаючи тебе) отримують бонус +10 до перевірок Вправності (Скритності), і їх не можливо вистежити без допомоги магії. Істота, яка отримала цей бонус, не залишає за собою слідів.

* */
  [Spell.PassWithoutTrace]: {
    name: 'БЕЗСЛІДНЕ ПЕРЕСУВАННЯ',
    lvl: 2,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Від тебе починає виходити покрив тіней і тиші, який приховує тебе та твоїх супутників від виявлення. Доки заклинання триває, всі істоти, обрані тобою в межах 6 метрів (включаючи тебе) отримують бонус +10 до перевірок Вправності (Скритності), і їх не можливо вистежити без допомоги магії. Істота, яка отримала цей бонус, не залишає за собою слідів.',
    components: {
      c: true,
      t: true,
      m: 'попіл від спаленого листка омели і гілочка ялини',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
    * ВИЯВЛЕННЯ НАМІРІВ
2 рівень, віщування
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (мідна монета) Тривалість: Концентрація, не довше 1 хвилини
Доки це заклинання триває, ти можеш читати думки дея- ких істот. Після того, як ти виконав це заклинання, і доти, доки воно триває, ти можеш у свій хід використовувати вчинок, щоб зосередитися на одній істоті, яку бачиш в ме- жах 6 метрів. Якщо у обраної істоти показник Інтелекту 3 або нижчий, або якщо вона не може говорити ні на одній мові, вона не потрапляє під дію цього заклинання.
Спочатку ти дізнаєшся поверхневі думки істоти — те, що знаходиться в її свідомості на даний момент. Ти можеш вчинком або перенести увагу на думки іншої істоти, або спробувати заглибитися в думки поточної істоти. Якщо ти занурюєшся глибше, ціль повинна зробити кидок рятунку Мудрості. У разі провалу ти отримуєш розуміння її думок (якщо є), її емоційного стану, і того, що її найбільше турбує (а також того, що вона любить і ненавидить). Якщо істо- та досягне успіху, заклинання закінчується. У будь-якому випадку, ціль знає, що ти прощупував її свідомість, і якщо ти не перевів увагу на думки іншої істоти, попередня істота може в свій хід вчинком здійснити перевірку Інтелекту, протиставлену твоїй перевірці Інтелекту, в разі успіху якої заклинання закінчується.
Питання, які задаються цілі усно, впливають на хід її ду- мок, тому це заклинання надзвичайно ефективно під час допитів.
Ти можеш також використовувати це заклинання для виявлення присутності розумних істот, яких ти не бачиш. Коли ти виконуєш це заклинання, або пізніше, доки воно активне, витративши вчинок, ти можеш пошукати думки іс- тот в межах 6 метрів від тебе. Заклинання пронизує більшу частину бар’єрів, але блокується 50 сантиметрами каменю, 5 сантиметрами звичайного металу або тонким листом свин- цю. Ти не можеш виявити істот з Інтелектом 3 або нижчим, а також тих, хто не говорить ні на одній мові.
Виявивши таким методом присутність істоти, ти можеш до закінчення дії заклинання читати її думки, як описано вище, навіть якщо ти її не бачиш, але при цьому вона повин- на знаходитись в межах дистанції.
    * */

  [Spell.DetectThoughts]: {
    name: 'ВИЯВЛЕННЯ НАМІРІВ',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,

    target: '',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
      m: 'мідна монета',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: 'Мудрість', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Доки це заклинання триває, ти можеш читати думки деяких істот. Після того, як ти виконав це заклинання, і доти, доки воно триває, ти можеш у свій хід використовувати вчинок, щоб зосередитися на одній істоті, яку бачиш в межах 6 метрів. Якщо у обраної істоти показник Інтелекту 3 або нижчий, або якщо вона не може говорити ні на одній мові, вона не потрапляє під дію цього заклинання. Спочатку ти дізнаєшся поверхневі думки істоти — те, що знаходиться в її свідомості на даний момент. Ти можеш вчинком або перенести увагу на думки іншої істоти, або спробувати заглибитися в думки поточної істоти. Якщо ти занурюєшся глибше, ціль повинна зробити кидок рятунку Мудрості. У разі провалу ти отримуєш розуміння її думок (якщо є), її емоційного стану, і того, що її найбільше турбує (а також того, що вона любить і ненавидить). Якщо істота досягне успіху, заклинання закінчується. У будь-якому випадку, ціль знає, що ти прощупував її свідомість, і якщо ти не перевів увагу на думки іншої істоти, попередня істота може в свій хід вчинком здійснити перевірку Інтелекту, протиставлену твоїй перевірці Інтелекту, в разі успіху якої заклинання закінчується. Питання, які задаються цілі усно, впливають на хід її думок, тому це заклинання надзвичайно ефективно під час допитів. Ти можеш також використовувати це заклинання для виявлення присутності розумних істот, яких ти не бачиш. Коли ти виконуєш це заклинання, або пізніше, доки воно активне, витративши вчинок, ти можеш пошукати думки істот в межах  6 метрів від тебе. Заклинання пронизує більшу частину бар’єрів, але блокується 50 сантиметрами каменю, 5 сантиметрами звичайного металу або тонким листом свин- цю. Ти не можеш виявити істот з Інтелектом 3 або нижчим, а також тих, хто не говорить ні на одній мові.Виявивши таким методом присутність істоти, ти можеш до закінчення дії заклинання читати її думки, як описано вище, навіть якщо ти її не бачиш, але при цьому вона повин- на знаходитись в межах дистанції.',
  },
  /*
  * ВІДДЗЕРКАЛЕННЯ
2 рівень, ілюзія
Час виконання: 1 вчинок Дистанція: На себе Компоненти: С, Т Тривалість: 1 хвилина
У твоєму просторі з’являються три твоїх ілюзорних копії. Доки заклинання триває, копії пересуваються разом з то- бою і повторюють твої дії, рухаючись так, що неможливо зрозуміти, хто з вас справжній. Ти можеш використати вчи- нок, щоб змусити свої копії зникнути.
Кожен раз, коли істота націлюється на тебе атакою, доки заклинання триває, кидай к20, щоб визначити, чи не поці- лила атака замість тебе по одній із твоїх копій. Якщо у тебе три копії, ти повинен викинути «6» або більше, щоб зро- бити ціллю свою копію. Якщо копій дві, викинути потріб- но «8» або більше. Якщо копія одна, ти повинен викинути «11» або більше.
КО копії дорівнює 10 + твій модифікатор Вправності. Якщо атака поцілила по копії, вона знищується. Копію може знищити тільки атака, яка поцілила по ній. Вона іг- норує інші ушкодження і ефекти. Заклинання закінчується, якщо всі три копії будуть знищені.
* */
  [Spell.MirrorImage]: {
    name: 'ВІДДЗЕРКАЛЕННЯ',
    lvl: 2,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'У твоєму просторі з’являються три твоїх ілюзорних копії. Доки заклинання триває, копії пересуваються разом з тобою і повторюють твої дії, рухаючись так, що неможливо зрозуміти, хто з вас справжній. Ти можеш використати вчинок, щоб змусити свої копії зникнути. Кожен раз, коли істота націлюється на тебе атакою, доки заклинання триває, кидай к20, щоб визначити, чи не поцілила атака замість тебе по одній із твоїх копій. Якщо у тебе три копії, ти повинен викинути «6» або більше, щоб зробити ціллю свою копію. Якщо копій дві, викинути потрібно «8» або більше. Якщо копія одна, ти повинен викинути «11» або більше. КО копії дорівнює 10 + твій модифікатор Вправності. Якщо атака поцілила по копії, вона знищується. Копію може знищити тільки атака, яка поцілила по ній. Вона ігнорує інші ушкодження і ефекти. Заклинання закінчується, якщо всі три копії будуть знищені.',
  },
  /*
  * ВІДКРИВАННЯ
2 рівень, видозміна
Час виконання: 1 вчинок Дистанція: 12 метрів Компоненти: С Тривалість: Миттєва
Вибери предмет, який бачиш в межах дистанції. Це можуть бути двері, ящик, скриня, кайдани, навісний замок, або ін- ший предмет, яких закритий простим або магічний засо- бом, який запобігає доступу.
Ціль, яка замкнена звичайним замком, яку заклинило або вона замкнена на засув, стає незамкненою, незаклине- ною, а засуви самі відкриваються. Якщо на предметі було кілька замків, відкривається тільки один з них.
Якщо ти вибрав ціль, замкнену магічним замком, то те заклинання пригнічується на 10 хвилин, під час яких ціль може відкриватися і закриватися як зазвичай.
Коли ти виконуєш це заклинання, від цілі виходить гуч- ний гуркіт, чутний на відстані 60 метрів.
  * */
  [Spell.Knock]: {
    name: 'ВІДКРИВАННЯ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 12,
    self: false,
    target: 'предмет, який бачиш в межах дистанції',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Вибери предмет, який бачиш в межах дистанції. Це можуть бути двері, ящик, скриня, кайдани, навісний замок, або інший предмет, яких закритий простим або магічний засобом, який запобігає доступу. Ціль, яка замкнена звичайним замком, яку заклинило або вона замкнена на засув, стає незамкненою, незаклиненою, а засуви самі відкриваються. Якщо на предметі було кілька замків, відкривається тільки один з них. Якщо ти вибрав ціль, замкнену магічним замком, то те заклинання пригнічується на 10 хвилин, під час яких ціль може відкриватися і закриватися як зазвичай. Коли ти виконуєш це заклинання, від цілі виходить гучний гуркіт, чутний на відстані 60 метрів.',
  },
  /*
  * ВІЧНИЙ ВОГОНЬ
2 рівень, втілення
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (Порошок рубіна вартістю 50 зм,
який поглинається заклинанням) Тривалість: Доки не розсіється
Із предмета, до якого ти торкаєшся, виходить полум’я, екві- валентне за яскравістю полум’ю факела. Ефект виглядає, як звичайне полум’я, але не створює тепла і не використовує кисень. Вічний вогонь можна накрити або заховати, але не згасити.
  * */
  [Spell.ContinualFlame]: {
    name: 'ВІЧНИЙ ВОГОНЬ',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 0,
    self: false,
    target: 'предмет, до якого ти торкаєшся',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'Порошок рубіна вартістю 50 зм, який поглинається заклинанням',
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Із предмета, до якого ти торкаєшся, виходить полум’я, еквівалентне за яскравістю полум’ю факела. Ефект виглядає, як звичайне полум’я, але не створює тепла і не використовує кисень. Вічний вогонь можна накрити або заховати, але не згасити.',
  },
  /*
  * ВОГНЯНА СФЕРА
2 рівень, виклик
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (шматок сала, щіпка сірки і товчено-
го заліза)
Тривалість: Концентрація, не довше 1 хвилини
У вільному просторі на твій вибір в межах дистанції з’явля- ється вогняна сфера діаметром 1 метр, яка існує, доки закли- нання триває. Всі істоти, які закінчують хід в межах 1 метра від цієї сфери, повинні зробити кидок рятунку Вправності. Істоти отримують 2к6 ушкоджень вогнем при провалі або половину цих ушкоджень при успіху.
Ти можеш бонусним вчинком пересунути цю сферу на відстань не більше 6 метрів. Якщо ти тараниш кулею істоту, ця істота повинна зробити кидок рятунку від ушкоджень кулі, і куля зупиняється до кінця цього ходу.
Коли ти пересуваєш кулю, ти можеш підіймати її над пе- решкодами до 1 метра у висоту і перестрибувати нею роз- ломи до 2 метрів у довжину. Куля підпалює легкозаймисті предмети, які ніхто не тримає і не носить, та випромінює яскраве світло в межах 4 метрів і тьмяне світло в межах ще 4 метрів.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, його ушко- дження збільшуються на 1к6 за кожен рівень слота вище 2-го.
* */
  [Spell.FlamingSphere]: {
    name: 'ВОГНЯНА СФЕРА',
    lvl: 2,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target: 'вільний простір на твій вибір в межах дистанції',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
      m: 'шматок сала, щіпка сірки і товченого заліза',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: true,
      from: 3,
      description: 'ушкодження збільшуються на 1к6 за кожен рівень слота вище 2-го',
      effect: '1к6',
    },
    area: '',
    saveThough: 'Вправності', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: ['fire'],
    source: Source.BasicRules,
    description:
      'У вільному просторі на твій вибір в межах дистанції з’являється вогняна сфера діаметром 1 метр, яка існує, доки заклинання триває. Всі істоти, які закінчують хід в межах 1 метра від цієї сфери, повинні зробити кидок рятунку Вправності. Істоти отримують 2к6 ушкоджень вогнем при провалі або половину цих ушкоджень при успіху. Ти можеш бонусним вчинком пересунути цю сферу на відстань не більше 6 метрів. Якщо ти тараниш кулею істоту, ця істота повинна зробити кидок рятунку від ушкоджень кулі, і куля зупиняється до кінця цього ходу. Коли ти пересуваєш кулю, ти можеш підіймати її над перешкодами до 1 метра у висоту і перестрибувати нею розломи до 2 метрів у довжину. Куля підпалює легкозаймисті предмети, які ніхто не тримає і не носить, та випромінює яскраве світло в межах 4 метрів і тьмяне світло в межах ще 4 метрів.',
  },
  /*
  * ВОГНЯНИЙ КЛИНОК
2 рівень, втілення
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С, Т, М (лист сумаху) Тривалість: Концентрація, не довше 10 хвилин
Ти створюєш вогняний меч у своїй вільній руці. Цей кли- нок подібний за розміром і формою на шаблю, і він існує, доки заклинання триває. Якщо ти упустиш цей клинок з руки, він зникне, але ти можеш повернути його у свою руку бонусним вчинком. Ти можеш вчинком здійснити ним ру- копашну атаку заклинанням. При попаданні ціль отримує 3к6 ушкоджень вогнем. Вогняний клинок випускає яскраве світло в межах 2 метрів і тьмяне світло в межах ще 2 метрів.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 4 рівня або вищого, його ушко- дження збільшуються на 1к6 за кожні два рівні слотів вище 2-го.

 * */
  [Spell.FlameBlade]: {
    name: 'ВОГНЯНИЙ КЛИНОК',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.BonusAction,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
      m: 'лист сумаху',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: true,
      from: 4,
      description: 'ушкодження збільшуються на 1к6 за кожні два рівні слотів вище 2-го',
      effect: '1к6',
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: 'рука', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: ['fire'],
    source: Source.BasicRules,
    description:
      'Ти створюєш вогняний меч у своїй вільній руці. Цей клинок подібний за розміром і формою на шаблю, і він існує, доки заклинання триває. Якщо ти упустиш цей клинок з руки, він зникне, але ти можеш повернути його у свою руку бонусним вчинком. Ти можеш вчинком здійснити ним рукопашну атаку заклинанням. При попаданні ціль отримує 3к6 ушкоджень вогнем. Вогняний клинок випускає яскраве світло в межах 2 метрів і тьмяне світло в межах ще 2 метрів.',
  },
  /*
  * ВСИЛЕННЯ
2 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 6 метрів
Компоненти: С, М (язик змії і або шматочок медових сот,
або крапля солодкого масла)
Тривалість: Концентрація, не довше 8 годин
Ти вселяєш певний курс дій (обмежений однією-двома фра- зами) істоті, яку бачиш в межах дистанції, і яка здатна чути і розуміти тебе. Істоти, які не можуть бути причаровані, ма- ють імунітет до цього ефекту. Всилення має бути сформова- но так, щоб дія звучала адекватно. Прохання вдарити себе мечем, кинутися на спис, спалити себе, або якось інакше заподіяти собі шкоду закінчують заклинання.
Ціль повинна зробити кидок рятунку Мудрості. При провалі вона слідує заданому курсу дій. Обрані дії можуть тривати всю тривалість заклинання. Якщо обрану дію мож- на виконати за менший період, заклинання закінчується, коли суб’єкт закінчує доручене завдання. Ти можеш також вказати умову, яка запустить обрану дію під час тривалості ефекту заклинання. Наприклад, ти можеш примусити ли- царя, щоб він віддав свого бойового коня першому зустріч- ному жебракові. Якщо до закінчення ефекту умова не буде виконана, то обрана дія не відбувається. Якщо ти або хтось із твоїх супутників завдаєте ушкодження цілі, заклинання закінчується.

* */
  [Spell.Suggestion]: {
    name: 'ВСИЛЕННЯ',
    lvl: 2,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 28800,
    distance: 6,
    self: false,
    target: 'істота, яку бачиш в межах дистанції, і яка здатна чути і розуміти тебе',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'язик змії і або шматочок медових сот, або крапля солодкого масла',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: 'Мудрості', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти вселяєш певний курс дій (обмежений однією-двома фразами) істоті, яку бачиш в межах дистанції, і яка здатна чути і розуміти тебе. Істоти, які не можуть бути причаровані, мають імунітет до цього ефекту. Всилення має бути сформовано так, щоб дія звучала адекватно. Прохання вдарити себе мечем, кинутися на спис, спалити себе, або якось інакше заподіяти собі шкоду закінчують заклинання. Ціль повинна зробити кидок рятунку Мудрості. При провалі вона слідує заданому курсу дій. Обрані дії можуть тривати всю тривалість заклинання. Якщо обрану дію можна виконати за менший період, заклинання закінчується, коли суб’єкт закінчує доручене завдання. Ти можеш також вказати умову, яка запустить обрану дію під час тривалості ефекту. Наприклад, ти можеш примусити лицаря, щоб він віддав свого бойового коня першому зустрічному жебракові. Якщо до закінчення ефекту умова не буде виконана, то обрана дія не відбувається. Якщо ти або хтось із твоїх супутників завдаєте ушкодження цілі, заклинання закінчується.',
  },
  /*
  * ВТИХОМИРЕННЯ
2 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 години
Ти намагаєшся придушити сильні емоції у групи істот. Усі гуманоїди в сфері з радіусом 4 метри з центром в точці, об- раній в межах дистанції, повинні зробити кидок рятунку Харизми; істота може добровільно провалити цей кидок рятунку, якщо побажає. Якщо істота провалює кидок ря- тунку, вибери один з двох описаних нижче ефектів:
Ти можеш придушити всі ефекти, які роблять ціль при- чарованою або переляканою. Коли це заклинання закінчу- ється, всі пригнічені ефекти відновлюються, за умови, що за цей час їх ефект не закінчився.
В якості альтернативи, ти можеш зробити ціль байдужою до обраних тобою істот, до яких вона ставилася вороже. Ця байдужість закінчується, якщо ціль атакована або їй завда- но ушкодження заклинанням, або якщо вона стане свідком того, як завдають ушкодження її союзникам. Коли закли- нання закінчується, істота знову стає ворожою, якщо тільки Майстер не вирішить інакше.
* */
  [Spell.CalmEmotions]: {
    name: 'ВТИХОМИРЕННЯ',
    lvl: 2,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target:
      'група істот, які знаходяться в сфері з радіусом 4 метри з центром в точці, обраній в межах дистанції',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '4 метри з центром в точці, обраній в межах дистанції',
    saveThough: 'Харизми', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти намагаєшся придушити сильні емоції у групи істот. Усі гуманоїди в сфері з радіусом 4 метри з центром в точці, обраній в межах дистанції, повинні зробити кидок рятунку Харизми; істота може добровільно провалити цей кидок рятунку, якщо побажає. Якщо істота провалює кидок рятунку, вибери один з двох описаних нижче ефектів: Ти можеш придушити всі ефекти, які роблять ціль при- чарованою або переляканою. Коли це заклинання закінчу- ється, всі пригнічені ефекти відновлюються, за умови, що за цей час їх ефект не закінчився. В якості альтернативи, ти можеш зробити ціль байдужою до обраних тобою істот, до яких вона ставилася вороже. Ця байдужість закінчується, якщо ціль атакована або їй завда- но ушкодження заклинанням, або якщо вона стане свідком того, як завдають ушкодження її союзникам. Коли закли- нання закінчується, істота знову стає ворожою, якщо тільки Майстер не вирішить інакше.',
  },
  /*
  * ДУБОВА ШКІРА
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (пригорща дубової кори) Тривалість: Концентрація, не довше 1 години
Ти торкаєшся до згідної істоти. Доки заклинання триває, шкіра цілі стає грубою і схожою зовні на кору дуба, а її КО не може бути нижче 16, незалежно від одягнутих обладунків.

* */
  [Spell.Barkskin]: {
    name: 'ДУБОВА ШКІРА',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: false,
    target: 'згідна істота',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'пригорща дубової кори',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти торкаєшся до згідної істоти. Доки заклинання триває, шкіра цілі стає грубою і схожою зовні на кору дуба, а її КО не може бути нижче 16, незалежно від одягнутих обладунків.',
  },
  /*
  * ДУХОВНА ЗБРОЯ
2 рівень, втілення
Час виконання: 1 бонусний вчинок Дистанція: 12 метрів Компоненти: С, Т
Тривалість: 1 хвилина
Ти створюєш в межах дистанції літаючу примарну зброю, яка існує доти, доки заклинання триває, або доки ти не ви- конаєш це заклинання ще раз. Коли ти виконуєш це закли- нання, ти можеш здійснити рукопашну атаку заклинанням по істоті, яка знаходиться в межах 1 метра від зброї. При по- паданні ціль отримує ушкодження силовим полем, які рівні 1к8 + модифікатор твоєї базової характеристики.
Ти можеш використати свій бонусний вчинок, щоб у свій хід пересунути зброю на 4 метри і повторити атаку по істо- ті, яка знаходиться в межах 1 метра від зброї.
Зброя може бути будь-якої форми. Жерці божеств, пов’я- заних з конкретною зброєю (святий Катберт відомий сво- єю булавою, а Тор — молотом), створюють ефект у вигляді саме такої зброї.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, його ушко- дження збільшуються на 1к8 за кожні два слота вище 2-го.
* */
  [Spell.SpiritualWeapon]: {
    name: 'ДУХОВНА ЗБРОЯ',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.BonusAction,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target: 'літаюча примарна зброя',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: true,
      from: 3,
      description: 'ушкодження збільшуються на 1к8 за кожні два слота вище 2-го',
      effect: '1к8',
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: 'рука', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти створюєш в межах дистанції літаючу примарну зброю, яка існує доти, доки заклинання триває, або доки ти не виконаєш це заклинання ще раз. Коли ти виконуєш це заклинання, ти можеш здійснити рукопашну атаку заклинанням по істоті, яка знаходиться в межах 1 метра від зброї. При попаданні ціль отримує ушкодження силовим полем, які рівні 1к8 + модифікатор твоєї базової характеристики. Ти можеш використати свій бонусний вчинок, щоб у свій хід пересунути зброю на 4 метри і повторити атаку по істоті, яка знаходиться в межах 1 метра від зброї. Зброя може бути будь-якої форми. Жерці божеств, пов’язаних з конкретною зброєю (святий Катберт відомий своєю булавою, а Тор — молотом), створюють ефект у вигляді саме такої зброї.',
  },
  /*
  * ЗАХИСТ ВІД ОТРУТИ
2 рівень, огородження
Час виконання: 1 вчинок Дистанція: Дотик Компоненти: С, Т Тривалість: 1 година
Ти торкаєшся до істоти. Якщо вона отруєна, ти нейтралізу- єш отруту. Якщо на ціль діють декілька отрут, ти нейтралі- зуєш ту, про яку знаєш, або ж одну випадковим чином обра- ну отруту.
Доки заклинання триває, ціль робить з перевагою кидки рятунку від отруєного стану і отримує опір до ушкоджень отрутою.
* */
  [Spell.ProtectionFromPoison]: {
    name: 'ЗАХИСТ ВІД ОТРУТИ',
    lvl: 2,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: false,
    target: 'істота',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти торкаєшся до істоти. Якщо вона отруєна, ти нейтралізуєш отруту. Якщо на ціль діють декілька отрут, ти нейтралі- зуєш ту, про яку знаєш, або ж одну випадковим чином обра- ну отруту. Доки заклинання триває, ціль робить з перевагою кидки рятунку від отруєного стану і отримує опір до ушкоджень отрутою.',
  },
  /*
  *
ЗБІЛЬШЕННЯ/ЗМЕНШЕННЯ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: 6 метрів
Компоненти: С, Т, М (щіпка товченого заліза) Тривалість: Концентрація, не довше 1 хвилини
Ти збільшуєш або зменшуєш істоту або предмет, який ба- чиш в межах дистанції, на час тривалості заклинання. Ви- бери або істоту або предмет, який ніхто не тримає і не но- сить. Якщо ціль хоче, вона може зробити кидок рятунку Статури. У разі успіху заклинання не робить на неї ніякого впливу. Якщо ціль — істота, то усе, що вона тримає і носить, змі- нює розмір разом з нею. Все, що ця істота випустить чи ски- не, тут же приймає свій природний розмір.
Збільшення. Розміри цілі подвоюються по всіх вимірах, а вага збільшується у вісім разів. Це збільшує розмір на одну категорію — від Середнього до Великого, наприклад. Якщо для цілі не вистачає простору, вона приймає максимальний можливий розмір. Доки заклинання триває, ціль робить з перевагою перевірки і кидки рятунку Сили. Зброя цілі теж збільшується. Атаки збільшеною зброєю завдають додатко- во 1к4 ушкоджень.
Зменшення. Розміри цілі зменшуються удвічі по всіх ви- мірах, а вага зменшується до однієї восьмої від звичайного. Це зменшує розмір на одну категорію — від Середнього до Маленького, наприклад. Доки заклинання триває, ціль ро- бить з перешкодою перевірки і кидки рятунку Сили. Зброя цілі теж зменшується. Атаки зменшеною зброєю завдають на 1к4 менше ушкоджень (не менше 1 ушкодження).
* */
  [Spell.EnlargeReduce]: {
    name: 'ЗБІЛЬШЕННЯ/ЗМЕНШЕННЯ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 6,
    self: false,
    target: 'істота або предмет, який бачиш в межах дистанції',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'щіпка товченого заліза',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: 'Статури', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти збільшуєш або зменшуєш істоту або предмет, який бачиш в межах дистанції, на час тривалості заклинання. Ви- бери або істоту або предмет, який ніхто не тримає і не но- сить. Якщо ціль хоче, вона може зробити кидок рятунку Статури. У разі успіху заклинання не робить на неї ніякого впливу. Якщо ціль — істота, то усе, що вона тримає і носить, змі- нює розмір разом з нею. Все, що ця істота випустить чи ски- не, тут же приймає свій природний розмір. Збільшення. Розміри цілі подвоюються по всіх вимірах, а вага збільшується у вісім разів. Це збільшує розмір на одну категорію — від Середнього до Великого, наприклад. Якщо для цілі не вистачає простору, вона приймає максимальний можливий розмір. Доки заклинання триває, ціль робить з перевагою перевірки і кидки рятунку Сили. Зброя цілі теж збільшується. Атаки збільшеною зброєю завдають додатко- во 1к4 ушкоджень. Зменшення. Розміри цілі зменшуються удвічі по всіх ви- мірах, а вага зменшується до однієї восьмої від звичайного. Це зменшує розмір на одну категорію — від Середнього до Маленького, наприклад. Доки заклинання триває, ціль ро- бить з перешкодою перевірки і кидки рятунку Сили. Зброя цілі теж зменшується. Атаки зменшеною зброєю завдають на 1к4 менше ушкоджень (не менше 1 ушкодження).',
  },
  /*
  * ЗВІРИНЕ ЧУТТЯ
2 рівень, віщування (ритуал)
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С
Тривалість: Концентрація, не довше 1 години
Ти торкаєшся до згідного звіра. Доки заклинання триває, ти можеш вчинком дивитися очима цього звіра і чути те, що чує він. Ефект триває, доки ти не переключишся вчинком назад на свої відчуття. Сприймаючи відчуттями звіра, ти користуєшся перевагами всіх його особливих чуттів, проте для свого оточення ти будеш осліпленим і оглухлим.
* */
  [Spell.BeastSense]: {
    name: 'ЗВІРИНЕ ЧУТТЯ',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: false,
    target: 'згідний звір',
    numberOfTargets: 1,
    components: {
      c: true,
      t: false,
    },
    ritual: true,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти торкаєшся до згідного звіра. Доки заклинання триває, ти можеш вчинком дивитися очима цього звіра і чути те, що чує він. Ефект триває, доки ти не переключишся вчинком назад на свої відчуття. Сприймаючи відчуттями звіра, ти користуєшся перевагами всіх його особливих чуттів, проте для свого оточення ти будеш осліпленим і оглухлим.',
  },
  /*
  * ЗВУКОВИЙ УДАР
2 рівень, втілення
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (шматочок слюди) Тривалість: Миттєва
Гучний дзвінкий звук виходить із обраної тобою точки в межах дистанції. Усі істоти в сфері з радіусом 2 метри з цен- тром в цій точці повинні зробити кидок рятунку Статури. При провалі істота отримує 3к8 ушкоджень звуком, або половину цих ушкоджень при успіху. Істоти, виготовлені з неорганічної матерії, такої як камінь, кристал або метал, роблять цей кидок рятунку з перешкодою.
Немагічні предмети, які ніхто не тримає і не носить, теж отримують ушкодження, якщо знаходяться в області закли- нання.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, його ушко- дження збільшуються на 1к8 за кожен рівень слота вище 2-го.
* */
  [Spell.Shatter]: {
    name: 'ЗВУКОВИЙ УДАР',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 12,
    self: false,
    target: 'точка в межах дистанції',
    numberOfTargets: 0,
    components: {
      c: true,
      t: true,
      m: 'шматочок слюди',
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: true,
      from: 3,
      description: 'ушкодження збільшуються на 1к8 за кожен рівень слота вище 2-го',
      effect: '1к8',
    },
    area: 'сфера з радіусом 2 метри з центром в цій точці',
    saveThough: 'Статури', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [DamageType.Thunder],
    source: Source.BasicRules,
    description:
      'Гучний дзвінкий звук виходить із обраної тобою точки в межах дистанції. Усі істоти в сфері з радіусом 2 метри з цен- тром в цій точці повинні зробити кидок рятунку Статури. При провалі істота отримує 3к8 ушкоджень звуком, або половину цих ушкоджень при успіху. Істоти, виготовлені з неорганічної матерії, такої як камінь, кристал або метал, роблять цей кидок рятунку з перешкодою. Немагічні предмети, які ніхто не тримає і не носить, теж отримують ушкодження, якщо знаходяться в області закли- нання.',
  },
  /*
  * ЗМІНА ВИГЛЯДУ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 години
Ти приймаєш інший вигляд. При виконанні вибери один з представлених нижче варіантів, ефект від якого буде трива- ти всю тривалість заклинання. Доки заклинання триває, ти можеш вчинком закінчити один ефект, щоб отримати пере- ваги іншого.
Адаптація до води. Ти пристосовуєш своє тіло для існу- вання у воді, відрощуючи зябра і перетинки між пальцями. Ти можеш дихати під водою і отримуєш швидкість плаван- ня, рівну твоїй швидкості ходьби.
Природна зброя. Ти відрощуєш пазурі, ікла, шипи, роги або іншу природну зброю на твій вибір. Твій беззбройний удар завдає 1к6 дробильних, колотих або рубаних ушко- джень, в залежності від обраної тобою зброї, і ти володієш цими беззбройними ударами. Ця зброя вважається магіч- ною, і ти отримуєш бонус +1 до кидків атак і ушкоджень нею.
Зміна зовнішності. Ти змінюєш свою зовнішність. Ти сам вирішуєш, на кого будеш схожий, включаючи зріст, вагу, особистість, тембр голосу, довжину волосся, колір шкіри чи інші риси зовнішності. Ти можеш стати схожим на пред- ставника іншої раси, але твої характеристики при цьому не змінюються. Ти також не можеш виглядати як істота іншої категорії розміру, і твоє тіло залишається приблизно тим же самим; наприклад, це заклинання не зробить з тебе чо- тириногого. Доки заклинання триває, ти можеш вчинком змінювати свою зовнішність.
* */
  [Spell.AlterSelf]: {
    name: 'ЗМІНА ВИГЛЯДУ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,
    target: 'на себе',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти приймаєш інший вигляд. При виконанні вибери один з представлених нижче варіантів, ефект від якого буде трива- ти всю тривалість заклинання. Доки заклинання триває, ти можеш вчинком закінчити один ефект, щоб отримати пере- ваги іншого. Адаптація до води. Ти пристосовуєш своє тіло для існу- вання у воді, відрощуючи зябра і перетинки між пальцями. Ти можеш дихати під водою і отримуєш швидкість плаван- ня, рівну твоїй швидкості ходьби. Природна зброя. Ти відрощуєш пазурі, ікла, шипи, роги або іншу природну зброю на твій вибір. Твій беззбройний удар завдає 1к6 дробильних, колотих або рубаних ушко- джень, в залежності від обраної тобою зброї, і ти володієш цими беззбройними ударами. Ця зброя вважається магіч- ною, і ти отримуєш бонус +1 до кидків атак і ушкоджень нею. Зміна зовнішності. Ти змінюєш свою зовнішність. Ти сам вирішуєш, на кого будеш схожий, включаючи зріст, вагу, особистість, тембр голосу, довжину волосся, колір шкіри чи інші риси зовнішності. Ти можеш стати схожим на пред- ставника іншої раси, але твої характеристики при цьому не змінюються. Ти також не можеш виглядати як істота іншої категорії розміру, і твоє тіло залишається приблизно тим же самим; наприклад, це заклинання не зробить з тебе чо- тириногого. Доки заклинання триває ти можеш вчинком змінювати свою зовнішність.',
  },
  /*
  * КОРОНА ШАЛЕНСТВА
2 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 24 метри
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 хвилини
Один гуманоїд на твій вибір, якого ти бачиш в межах дис- танції, повинен зробити успішний рятунку Мудрості, інак- ше він стане причарований тобою на час дії заклинання. Доки ціль причарована таким способом, на її голові з’явля- ється вигнута залізна корона, а в очах світиться безумство.
Причарована ціль повинна в кожен свій хід перед пересу- ванням здійснювати вчинком рукопашну атаку по будь-якій істоті крім себе, яку ти подумки вибираєш. Ціль може діяти в свій хід як зазвичай, якщо ти не вибрав істоту або в межах її досяжності немає інших істот.
У наступні ходи ти повинен вчинком підтримувати кон- троль над ціллю, інакше заклинання закінчується. Крім того, ціль в кінці кожного свого ходу може здійснювати кидки рятунку Мудрості. У разі успіху заклинання закінчу- ється.

* */
  [Spell.CrownOfMadness]: {
    name: 'КОРОНА ШАЛЕНСТВА',
    lvl: 2,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 10,
    distance: 24,
    self: false,
    target: 'гуманоїд',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: 'Мудрості', // Характеристика для кидка рятунку
    attack: 'рукопашна атака', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Один гуманоїд на твій вибір, якого ти бачиш в межах дис- танції, повинен зробити успішний рятунку Мудрості, інак- ше він стане причарований тобою на час дії заклинання. Доки ціль причарована таким способом, на її голові з’явля- ється вигнута залізна корона, а в очах світиться безумство. Причарована ціль повинна в кожен свій хід перед пересу- ванням здійснювати вчинком рукопашну атаку по будь-якій істоті крім себе, яку ти подумки вибираєш. Ціль може діяти в свій хід як зазвичай, якщо ти не вибрав істоту або в межах її досяжності немає інших істот. У наступні ходи ти повинен вчинком підтримувати кон- троль над ціллю, інакше заклинання закінчується. Крім того, ціль в кінці кожного свого ходу може здійснювати кидки рятунку Мудрості. У разі успіху заклинання закінчу- ється.',
  },
  /*
  * ЛЕВІТАЦІЯ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (маленька шкіряна петля або шмато-
чок золотого дроту, зігнутий в формі кубка з довгою ніж-
кою)
Тривалість: Концентрація, не довше 10 хвилин
Одна вибрана тобою істота або незакріплений (або неутри- муваний) предмет, який ти бачиш в межах дистанції, здій- мається вертикально на висоту не більше 4 метрів, і залиша- ється висіти там на час тривалості заклинання. Заклинання може змусити левітувати ціль, яка важить не більше 220 кілограм. Незгідна істота, яка зробила успішний кидок ря- тунку Статури, не підпадає під дію цього заклинання.
Ціль може пересуватись тільки відштовхуючись від твер- дих предметів і поверхонь (таких як стіни і стеля), а також підтягуючись за них, що дозволяє пересуватись так, як ніби б вони лазили. У свій хід ти можеш змінити висоту цілі на
4 метри в будь-якому напрямку. Якщо ціллю є ти сам, ти можеш частиною пересування рухатися вгору або вниз. В іншому випадку, ти можеш вчинком пересувати ціль, яка повинна залишатися при цьому в межах досяжності закли- нання.
Коли заклинання закінчується, якщо ціль все ще знахо- диться в повітрі, вона плавно опускається на землю.
* */
  [Spell.Levitate]: {
    name: 'ЛЕВІТАЦІЯ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 10,
    distance: 12,
    self: false,
    target: 'істота або предмет',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'маленька шкіряна петля або шматочок золотого дроту, зігнутий в формі кубка з довгою ніжкою',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: 'вертикально на висоту не більше 4 метрів',
    saveThough: 'Статури', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Одна вибрана тобою істота або незакріплений (або неутри- муваний) предмет, який ти бачиш в межах дистанції, здій- мається вертикально на висоту не більше 4 метрів, і залиша- ється висіти там на час тривалості заклинання. Заклинання може змусити левітувати ціль, яка важить не більше 220 кілограм. Незгідна істота, яка зробила успішний кидок ря- тунку Статури, не підпадає під дію цього заклинання. Ціль може пересуватись тільки відштовхуючись від твер- дих предметів і поверхонь (таких як стіни і стеля), а також підтягуючись за них, що дозволяє пересуватись так, як ніби б вони лазили. У свій хід ти можеш змінити висоту цілі на 4 метри в будь-якому напрямку. Якщо ціллю є ти сам, ти можеш частиною пересування рухатися вгору або вниз. В іншому випадку, ти можеш вчинком пересувати ціль, яка повинна залишатися при цьому в межах досяжності закли- нання. Коли заклинання закінчується, якщо ціль все ще знахо- диться в повітрі, вона плавно опускається на землю.',
  },
  /*
  * МАГІЧНА ЗБРОЯ
2 рівень, видозміна
Час виконання: 1 бонусний вчинок Дистанція: Дотик
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 години
Ти торкаєшся до немагічної зброї. Доки заклинання три- ває, ця зброя стає магічною зброєю з бонусом +1 до кидків атаки і кидків ушкоджень.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 4 рівня або вищого, цей бонус збільшується до +2. Якщо ти використовуєш магічний слот 6 рівня або вищого, бонус збільшується до +3.
* */
  [Spell.MagicWeapon]: {
    name: 'МАГІЧНА ЗБРОЯ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.BonusAction,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,
    target: 'немагічна зброя',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: true,
      from: 4,
      description: 'бонус збільшується до +2',
      effect: '+1',
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти торкаєшся до немагічної зброї. Доки заклинання три- ває, ця зброя стає магічною зброєю з бонусом +1 до кидків атаки і кидків ушкоджень.',
  },
  /*
  * МАГІЧНИЙ ЗАМОК
2 рівень, огородження
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (золотий пил, вартістю мінімум 25
зм, який поглинається заклинанням) Тривалість: Доки не розсіється
Ти торкаєшся до зачинених дверей, вікна, воріт, скрині або іншого входу, і він стає замкненим. Ти і зазначені при вико- нанні цього заклинання істоти можете без проблем відкри- вати предмет. Ти можеш також встановити пароль, вимова якого в межах 1 метра від предмета пригнічує заклинання на 1 хвилину. В іншому випадку предмет не відкривається, доки його не зламають, або доки заклинання не розсіють або не пригнітять.
Виконання заклинання відкривання на предмет пригні- чує магічний замок на 10 хвилин. Предмет, який знаходить- ся під дією цього заклинання, набагато складніше зламати і відкрити силою; СК виламування і злому таких замків збільшується на 10.

* */
  [Spell.ArcaneLock]: {
    name: 'МАГІЧНИЙ ЗАМОК',
    lvl: 2,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 0,
    self: true,
    target: 'зачинений вхід',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'золотий пил, вартістю мінімум 25 зм, який поглинається заклинанням',
    },
    ritual: false,
    concentration: false,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти торкаєшся до зачинених дверей, вікна, воріт, скрині або іншого входу, і він стає замкненим. Ти і зазначені при вико- нанні цього заклинання істоти можете без проблем відкри- вати предмет. Ти можеш також встановити пароль, вимова якого в межах 1 метра від предмета пригнічує заклинання на 1 хвилину. В іншому випадку предмет не відкривається, доки його не зламають, або доки заклинання не розсіють або не пригнітять. Виконання заклинання відкривання на предмет пригні- чує магічний замок на 10 хвилин. Предмет, який знаходить- ся під дією цього заклинання, набагато складніше зламати і відкрити силою; СК виламування і злому таких замків збільшується на 10.',
  },
  /*
  * МАГІЧНІ ВУСТА
2 рівень, ілюзія (ритуал)
Час виконання: 1 хвилина
Дистанція: 6 метрів
Компоненти: С, Т, М (шматочок медових сот і порошок
нефриту, вартістю мінімум 10 зм, і які поглинаються за-
клинанням)
Тривалість: Доки не розсіється
Ти вкладаєш в предмет, який знаходиться в межах дистан- ції, послання, яке буде вимовлено, коли будуть виконані умови. Вибери предмет, який ти бачиш, і який не тримає і не носить інша істота. Промов послання, яке може скла- датися не більш ніж з 25 слів, хоча його можна вимовляти протягом 10 хвилин. Потім визнач умову, виконання якої змусить заклинання передати твоє послання.
Коли умова буде виконана, на предметі з’являється ма- гічний рот, який зачитує послання твоїм голосом з тією ж самою гучністю. Якщо у обраного тобою предмета є рот, або щось схоже на рот (наприклад, рот статуї), магічний рот з’являється на його місці, і здається, що слова виходять звідти. При виконанні заклинання ти можеш зробити так, що заклинання закінчиться, передавши повідомлення, або ж залишиться активним і буде повторювати повідомлення при кожному спрацюванні умови.
Умова, яка змушує спрацювати передачу послання, може бути як загальною, так і деталізованою, але має ґрунтувати- ся на зорових або чутних умовах, що відбуватимуться в ме- жах 6 метрів від предмета. Наприклад, ти можеш змусити рот говорити, коли в межах 6 метрів від нього пройде істо- та, або коли в межах 6 метрів від нього задзвенить срібний дзвіночок.
* */
  [Spell.MagicMouth]: {
    name: 'МАГІЧНІ ВУСТА',
    lvl: 2,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 60, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 6,
    self: false,
    target: 'предмет',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'шматочок медових сот і порошок нефриту, вартістю мінімум 10 зм, і які поглинаються заклинанням',
    },
    ritual: true,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти вкладаєш в предмет, який знаходиться в межах дистан- ції, послання, яке буде вимовлено, коли будуть виконані умови. Вибери предмет, який ти бачиш, і який не тримає і не носить інша істота. Промов послання, яке може скла- датися не більш ніж з 25 слів, хоча його можна вимовляти протягом 10 хвилин. Потім визнач умову, виконання якої змусить заклинання передати твоє послання. Коли умова буде виконана, на предметі з’являється ма- гічний рот, який зачитує послання твоїм голосом з тією ж самою гучністю. Якщо у обраного тобою предмета є рот, або щось схоже на рот (наприклад, рот статуї), магічний рот з’являється на його місці, і здається, що слова виходять звідти. При виконанні заклинання ти можеш зробити так, що заклинання закінчиться, передавши повідомлення, або ж залишиться активним і буде повторювати повідомлення при кожному спрацюванні умови. Умова, яка змушує спрацювати передачу послання, може бути як загальною, так і деталізованою, але має ґрунтувати- ся на зорових або чутних умовах, що відбуватимуться в ме- жах 6 метрів від предмета. Наприклад, ти можеш змусити рот говорити, коли в межах 6 метрів від нього пройде істо- та, або коли в межах 6 метрів від нього задзвенить срібний дзвіночок.',
  },
  /*
  * МАЛЕ ВІДНОВЛЕННЯ
2 рівень, огородження
Час виконання: 1 вчинок Дистанція: Дотик Компоненти: С, Т Тривалість: Миттєва
Ти торкаєшся до істоти і можеш закінчити одну хворобу або один стан, в якому вона знаходиться. Цим станом може бути глухота, отруєння, параліч або сліпота.
* */
  [Spell.LesserRestoration]: {
    name: 'МАЛЕ ВІДНОВЛЕННЯ',
    lvl: 2,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 0,
    self: false,
    target: 'істота',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти торкаєшся до істоти і можеш закінчити одну хворобу або один стан, в якому вона знаходиться. Цим станом може бути глухота, отруєння, параліч або сліпота.',
  },
  /*
  * МЕЛЬФОВА КИСЛОТНА СТРІЛА
2 рівень, втілення
Час виконання: 1 вчинок
Дистанція: 18 метрів
Компоненти: С, Т, М (порошок з листя ревеню і шлунок
гадюки) Тривалість: Миттєва
До цілі, яка знаходиться в межах дистанції, спрямовується мерехтлива зелена стріла, яка розлітається бризками кис- лоти. Здійсни по цілі далекобійну атаку заклинанням. При попаданні ціль одноразово отримує 4к4 ушкоджень кис- лотою і ще 2к4 ушкоджень кислотою в кінці її наступного ходу. При промаху стріла трохи зачіпає ціль і заподіює по- ловину цих одноразових ушкоджень, а в кінці наступного ходу ціль ушкоджень не отримує.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 3 рівня або вищого, ушкодження (і одноразові, і наступні) збільшуються на 1к4 за кожен рівень слота вище 2-го.
* */
  [Spell.MelFAcidsArrow]: {
    name: 'МЕЛЬФОВА КИСЛОТНА СТРІЛА',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 18,
    self: false,
    target: 'ціль',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'порошок з листя ревеню і шлунок гадюки',
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: true,
      from: 3,
      description:
        'ушкодження (і одноразові, і наступні) збільшуються на 1к4 за кожен рівень слота вище 2-го',
      effect: '+1d4',
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: 'далекобійна атака', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [DamageType.Acid],
    source: Source.BasicRules,
    description:
      'До цілі, яка знаходиться в межах дистанції, спрямовується мерехтлива зелена стріла, яка розлітається бризками кис- лоти. Здійсни по цілі далекобійну атаку заклинанням. При попаданні ціль одноразово отримує 4к4 ушкоджень кис- лотою і ще 2к4 ушкоджень кислотою в кінці її наступного ходу. При промаху стріла трохи зачіпає ціль і заподіює по- ловину цих одноразових ушкоджень, а в кінці наступного ходу ціль ушкоджень не отримує.',
  },

  /*
  * МІСЯЧНИЙ ПРОМІНЬ
2 рівень, втілення
Час виконання: 1 вчинок
Дистанція: 24 метри
Компоненти: С, Т, М (кілька насінин місяцесімянника і
шматочок опалесцентного польового шпату) Тривалість: Концентрація, не довше 1 хвилини
Блідий сріблястий промінь сяє в циліндрі з радіусом 1 метр і висотою 8 метрів з центром у точці в межах дистан- ції. Доки заклинання триває, циліндр освітлений тьмяним світлом. Коли істота вперше за хід входить у область закли- нання або починає там хід, вона огортається примарним полум’ям, яке завдає їй справжнього болю, і вона має зро- бити кидок рятунку Статури. Вона отримує 2к10 ушко- джень випромінюванням при провалі або половину цих ушкоджень при успіху. Перекидні здійснюють цей кидок рятунку з перешкодою. При провалі вони миттєво приймають свій справжній вигляд, і не можуть приймати інші форми, доки не вийдуть зі світла від заклинання. В кожен наступний після виконання заклинання хід ти можеш сво- їм вчинком пересувати промінь не більш як на 12 метрів у будь-якому напрямку.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, його ушко- дження збільшуються на 1к10 за кожен рівень слота вище 2-го.
* */
  [Spell.Moonbeam]: {
    name: 'МІСЯЧНИЙ ПРОМІНЬ',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 24,
    self: false,
    target: 'ціль',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'кілька насінин місяцесімянника і шматочок опалесцентного польового шпату',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: true,
      from: 3,
      description: 'його ушкодження збільшуються на 1к10 за кожен рівень слота вище 2-го',
      effect: '+1d10',
    },
    area: 'циліндр з радіусом 1 метр і висотою 8 метрів',
    saveThough: 'Статури', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [DamageType.Radiant],
    source: Source.BasicRules,
    description:
      'Блідий сріблястий промінь сяє в циліндрі з радіусом 1 метр і висотою 8 метрів з центром у точці в межах дистан- ції. Доки заклинання триває, циліндр освітлений тьмяним світлом. Коли істота вперше за хід входить у область закли- нання або починає там хід, вона огортається примарним полум’ям, яке завдає їй справжнього болю, і вона має зро- бити кидок рятунку Статури. Вона отримує 2к10 ушко- джень випромінюванням при провалі або половину цих ушкоджень при успіху. Перекидні здійснюють цей кидок рятунку з перешкодою. При провалі вони миттєво приймають свій справжній вигляд, і не можуть приймати інші форми, доки не вийдуть зі світла від заклинання. В кожен наступний після виконання заклинання хід ти можеш сво- їм вчинком пересувати промінь не більш як на 12 метрів у будь-якому напрямку.',
  },
  /*
  * МОЛИТВА ЗЦІЛЕННЯ
2 рівень, втілення
Час виконання: 10 хвилин Дистанція: 6 метрів Компоненти: С Тривалість: Миттєва
Кожна з шести істот на твій вибір, яких ти бачиш в межах дистанції, відновлює кількість здоров’я, рівну 2к8 + моди- фікатор твоєї базової характеристики. Це заклинання не робить ніякого ефекту на нежить і конструктів.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, лікування збільшується на 1к8 за кожен рівень слота вище 2-го.
* */
  [Spell.PrayerOfHealing]: {
    name: 'МОЛИТВА ЗЦІЛЕННЯ',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.LongTerm,
    castTime: 600, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 6,
    self: false,
    target: '6 істот на твій вибір',
    numberOfTargets: 6,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: true,
      from: 3,
      description: 'лікування збільшується на 1к8 за кожен рівень слота вище 2-го',
      effect: '+1d8',
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Кожна з шести істот на твій вибір, яких ти бачиш в межах дистанції, відновлює кількість здоров’я, рівну 2к8 + моди- фікатор твоєї базової характеристики. Це заклинання не робить ніякого ефекту на нежить і конструктів.',
  },
  /* НЕВИДИМІСТЬ
2 рівень, ілюзія
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (вія в смолі) Тривалість: Концентрація, не довше 1 години
Істота, до якої ти торкаєшся, стає невидимою до закінчен- ня тривалості заклинання. Усе, що ціль тримає або носить, стає невидимим, доки залишається у неї. Заклинання за- кінчується на цілі, якщо вона здійснює атаку або виконує заклинання.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 2-го.
*/
  [Spell.Invisibility]: {
    name: 'НЕВИДИМІСТЬ',
    lvl: 2,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: false,
    target: 'істота',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'вія в смолі',
    },
    ritual: false,
    concentration: true,
    canEndEarlier: true,
    highLvl: {
      has: true,
      from: 3,
      description:
        'ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 2-го',
      effect: '+1',
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Істота, до якої ти торкаєшся, стає невидимою до закінчен- ня тривалості заклинання. Усе, що ціль тримає або носить, стає невидимим, доки залишається у неї. Заклинання за- кінчується на цілі, якщо вона здійснює атаку або виконує заклинання.',
  },
  /*
  * НЕТЛІННІ ОСТАНКИ
2 рівень, некромантія (ритуал)
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (щіпка солі і по одній мідній монеті
на кожне око трупа, які повинні залишатися там весь час,
доки заклинання триває) Тривалість: 10 днів
Ти торкаєшся до трупа або до останків істоти. Доки за- клинання триває, ціль захищена від розкладання і не може стати нежиттю. Це заклинання також збільшує обмеження по часу, протягом якого труп можна воскресити, так як дні, проведені під впливом цього заклинання, не враховуються при підрахунку часу з дня смерті для таких заклинань як оживлення.

* */
  [Spell.GentleRepose]: {
    name: 'НЕТЛІННІ ОСТАНКИ',
    lvl: 2,
    school: MagicSchool.Necromancy, // некромантія
    actionType: Action.LongTerm,
    castTime: 60, // 1 вчинок === 0 секунд
    duration: 14400,
    distance: 0,
    self: false,
    target: 'труп або до останків істоти',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'щіпка солі і по одній мідній монеті на кожне око трупа, які повинні залишатися там весь час, доки заклинання триває',
    },
    ritual: true,
    concentration: false,
    canEndEarlier: false,
    highLvl: {
      has: false,
    },
    area: 'труп або до останків істоти',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти торкаєшся до трупа або до останків істоти. Доки за- клинання триває, ціль захищена від розкладання і не може стати нежиттю. Це заклинання також збільшує обмеження по часу, протягом якого труп можна воскресити, так як дні, проведені під впливом цього заклинання, не враховуються при підрахунку часу з дня смерті для таких заклинань як оживлення.',
  },
  /*
  * НІСТУЛОВА МАГІЧНА АУРА
2 рівень, ілюзія
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (невеликий клапоть шовку) Тривалість: 24 години
Ти накладаєш ілюзію на істоту або предмет, до якого тор- каєшся, щоб заклинання школи Віщування отримували про нього неправдиву інформацію. Ціллю може бути згідна іс- тота або предмет, який не тримає і не носить інша істота. При виконанні цього заклинання вибери один з описаних нижче ефектів або відразу обидва. Ефект триває, доки три- ває заклинання. Якщо ти виконуєш це заклинання на одну і ту ж істоту або предмет кожен день протягом 30 днів, вико- ристовуючи один і той же ефект, ілюзія буде тривати, доки не буде розсіяна.
Хибна аура. Ти змінюєш те, як ціль представляється для заклинань і магічних ефектів, таких як виявлення магії, які сканують магічну ауру. Ти можеш змусити немагічний предмет виглядати магічним, магічний предмет змусити виглядати немагічним, або змінити магічну ауру предмета, щоб здавалося, що магія, яка в ньому знаходиться, належить іншій школі магії, обраній тобою. Якщо ти використовував цей ефект на предмет, можеш зробити так, що нова магія буде відразу помітна істоті, яка тримає його в руках.
Маскування. Ти змінюєш те, як ціль представляється для заклинань і магічних ефектів, які визначають вид істот, та- ких як Божественне чуття паладина та чинник заклинання символ. Ти вибираєш вид істоти, і всі заклинання та магічні ефекти будуть вважати, що ціль належить цьому виду або має цей світогляд.
* */
  [Spell.NystulsMagicAura]: {
    name: 'НІСТУЛОВА МАГІЧНА АУРА',
    lvl: 2,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 1440,
    distance: 0,
    self: false,
    target: 'істота або предмет',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'невеликий клапоть шовку',
    },
    ritual: false,
    concentration: false,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: 'істота або предмет',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: false,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти накладаєш ілюзію на істоту або предмет, до якого тор- каєшся, щоб заклинання школи Віщування отримували про нього неправдиву інформацію. Ціллю може бути згідна іс- тота або предмет, який не тримає і не носить інша істота. При виконанні цього заклинання вибери один з описаних нижче ефектів або відразу обидва. Ефект триває, доки три- ває заклинання. Якщо ти виконуєш це заклинання на одну і ту ж істоту або предмет кожен день протягом 30 днів, вико- ристовуючи один і той же ефект, ілюзія буде тривати, доки не буде розсіяна. Хибна аура. Ти змінюєш те, як ціль представляється для заклинань і магічних ефектів, таких як виявлення магії, які сканують магічну ауру. Ти можеш змусити немагічний предмет виглядати магічним, магічний предмет змусити виглядати немагічним, або змінити магічну ауру предмета, щоб здавалося, що магія, яка в ньому знаходиться, належить іншій школі магії, обраній тобою. Якщо ти використовував цей ефект на предмет, можеш зробити так, що нова магія буде відразу помітна істоті, яка тримає його в руках. Маскування. Ти змінюєш те, як ціль представляється для заклинань і магічних ефектів, які визначають вид істот, та- ких як Божественне чуття паладина та чинник заклинання символ. Ти вибираєш вид істоти, і всі заклинання та магічні ефекти будуть вважати, що ціль належить цьому виду або має цей світогляд.',
  },
  /*
  ОБЛАСТЬ ІСТИНИ
2 рівень, причарування
Час виконання: 1 вчинок Дистанція: 12 метрів Компоненти: С, Т Тривалість: 10 хвилин
Ти створюєш магічну зону, яка захищає від обману в сфері з радіусом 3 метри з центром в точці, обраній тобою в ме- жах дистанції. Доки заклинання триває, істота, яка вперше за хід входить в область цього заклинання або починає в ній хід, мусить зробити кидок рятунку Харизми. При провалі істота не може навмисне брехати, перебуваючи в зазначе- ному радіусі. Ти дізнаєшся, які істоти пройшли кидок ря- тунку, а які провалили. Істота, яка потрапила під дію цього ефекту, знає про заклинання, і тому може уникати відпові- дати на питання, на які вона вважала б за краще збрехати. Такі істоти можуть ухилятись від відповіді, доки змушені говорити правду.
*/
  [Spell.ZoneOfTruth]: {
    name: 'ОБЛАСТЬ ІСТИНИ',
    lvl: 2,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 12,
    self: false,
    target: 'область з радіусом 3 метри з центром в точці, обраній тобою в межах дистанції',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
    },
    ritual: false,
    concentration: false,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: 'область з радіусом 3 метри з центром в точці, обраній тобою в межах дистанції',
    saveThough: 'Харизми', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Ти створюєш магічну зону, яка захищає від обману в сфері з радіусом 3 метри з центром в точці, обраній тобою в ме- жах дистанції. Доки заклинання триває, істота, яка вперше за хід входить в область цього заклинання або починає в ній хід, мусить зробити кидок рятунку Харизми. При провалі істота не може навмисне брехати, перебуваючи в зазначе- ному радіусі. Ти дізнаєшся, які істоти пройшли кидок ря- тунку, а які провалили. Істота, яка потрапила під дію цього ефекту, знає про заклинання, і тому може уникати відпові- дати на питання, на які вона вважала б за краще збрехати. Такі істоти можуть ухилятись від відповіді, доки змушені говорити правду.',
  },
  /*
  * ОХОРОННИЙ ЗВ’ЯЗОК
2 рівень, огородження
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (пара платинових кілець, вартістю мі-
німум 50 зм кожне, які ти з ціллю повинен носити на час
тривалості заклинання) Тривалість: 1 година
Це заклинання захищає згідну істоту, до якої ти торкаєшся, і створює між вами містичний зв’язок. Доки ціль знахо- диться в межах 12 метрів від тебе, вона отримує бонус +1 до КО і кидків рятунку, а також опір до всіх видів ушкоджень. Крім того, кожен раз, коли вона отримує ушкодження, ти отримуєш таку ж кількість ушкоджень.
Це заклинання закінчується, якщо твоє здоров’я опуска- ється до 0 або якщо відстань між тобою і ціллю стає більше 12 метрів. Воно також закінчується, якщо це заклинання ви- конати повторно на одну з пов’язаних ним істот. Ти також можеш своїм вчинком закінчити це заклинання.
* */
  [Spell.WardingBond]: {
    name: 'ОХОРОННИЙ ЗВ’ЯЗОК',
    lvl: 2,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: false,
    target: 'істота',
    numberOfTargets: 1,
    components: {
      c: true,
      t: true,
      m: 'пара платинових кілець, вартістю мінімум 50 зм кожне, які ти з ціллю повинен носити на час тривалості заклинання',
    },
    ritual: false,
    concentration: false,
    canEndEarlier: true,
    highLvl: {
      has: false,
    },
    area: '',
    saveThough: '', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    freeWay: true,
    damageType: [],
    source: Source.BasicRules,
    description:
      'Це заклинання захищає згідну істоту, до якої ти торкаєшся, і створює між вами містичний зв’язок. Доки ціль знахо- диться в межах 12 метрів від тебе, вона отримує бонус +1 до КО і кидків рятунку, а також опір до всіх видів ушкоджень. Крім того, кожен раз, коли вона отримує ушкодження, ти отримуєш таку ж кількість ушкоджень. Це заклинання закінчується, якщо твоє здоров’я опуска- ється до 0 або якщо відстань між тобою і ціллю стає більше 12 метрів. Воно також закінчується, якщо це заклинання ви- конати повторно на одну з пов’язаних ним істот. Ти також можеш своїм вчинком закінчити це заклинання.',
  },

  /*
  * ПАВУТИНА
2 рівень, виклик
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (шматочок павутини) Тривалість: Концентрація, не довше 1 години
Ти створюєш масу густої і клейкої павутини в точці на твій вибір в межах дистанції. Павутина заповнює куб з довжи- ною ребра 4 метри на час тривалості заклинання. Павутина є важкопрохідною місцевістю та місцевістю з поганою ви- димістю.
Якщо павутина не приєднана до двох міцних структур (таким як стіни або дерева) і не розкладена по підлозі, сті- ні або стелі, створена павутина опадає сама, і заклинання закінчується на початку твого наступного ходу. Павутина, розкладена по плоскій поверхні, має товщину 1 метр.
Кожна істота, яка починає хід в павутині, або яка по- трапляє в неї у свій хід, повинна здійснити кидок рятунку Вправності. При провалі істота стає окованою, доки зали- шається в павутині, або доки не вирветься.
Істота, окована павутиною, може вчинком здійснити пе- ревірку Сили проти СК твоїх заклинань. У разі успіху вона перестає бути окованою.
Павутина дуже легкозаймиста. Будь який 1-метровий куб павутини, до якого торкнувся вогонь, згорає за 1 раунд, зав- даючи 2к4 ушкоджень вогнем всім істотам, які починають хід у вогні.
  * */
  [Spell.Web]: {
    name: 'ПАВУТИНА',
    lvl: 2,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600,
    distance: 12,
    self: false,
    target: 'куб 4 метри',
    numberOfTargets: 0,
    description:
      'Ти створюєш масу густої і клейкої павутини в точці на твій вибір в межах дистанції. Павутина заповнює куб з довжиною ребра 4 метри на час тривалості заклинання. Павутина є важкопрохідною місцевістю та місцевістю з поганою видимістю. Якщо павутина не приєднана до двох міцних структур (таким як стіни або дерева) і не розкладена по підлозі, стіні або стелі, створена павутина опадає сама, і заклинання закінчується на початку твого наступного ходу. Павутина, розкладена по плоскій поверхні, має товщину 1 метр. Кожна істота, яка починає хід в павутині, або яка потрапляє в неї у свій хід, повинна здійснити кидок рятунку Вправності. При провалі істота стає окованою, доки залишається в павутині, або доки не вирветься. Істота, окована павутиною, може вчинком здійснити перевірку Сили проти СК твоїх заклинань. У разі успіху вона перестає бути окованою. Павутина дуже легкозаймиста. Будь який 1-метровий куб павутини, до якого торкнувся вогонь, згорає за 1 раунд, завдаючи 2к4 ушкоджень вогнем всім істотам, які починають хід у вогні.',
    components: {
      c: true,
      t: true,
      m: 'шматочок павутини',
    },
    area: '',
    saveThough: 'Вправності', // Характеристика для кидка рятунку
    attack: '', // Заклинання не вимагає кидка атаки
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
    * ПАВУЧЕ ЛАЗІННЯ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (крапля бітуму і павук) Тривалість: Концентрація, не довше 1 години
Доки заклинання триває, одна згідна істота, до якої ти торкаєшся, отримує можливість пересуватись вгору, вниз і вздовж вертикальних поверхонь, а також по стелях, залиша- ючи руки вільними. Ціль також отримує швидкість лазіння, рівну швидкості її ходьби.
    * */
  [Spell.SpiderClimb]: {
    name: 'ПАВУЧЕ ЛАЗІННЯ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600,
    distance: 0,
    self: false,
    target: 'істота, до якої ти торкаєшся',
    numberOfTargets: 1,
    description:
      'Доки заклинання триває, одна згідна істота, до якої ти торкаєшся, отримує можливість пересуватись вгору, вниз і вздовж вертикальних поверхонь, а також по стелях, залишаючи руки вільними. Ціль також отримує швидкість лазіння, рівну швидкості її ходьби.',
    components: {
      c: true,
      t: true,
      m: 'крапля бітуму і павук',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПАЛЮЧІ ПРОМЕНІ
2 рівень, втілення
Час виконання: 1 вчинок Дистанція: 24 метри Компоненти: С, Т Тривалість: Миттєва
Ти створюєш три палючі промені і направляєш їх на цілі, які перебувають в межах дистанції. Це може бути одна або декілька цілей. Для кожного променя зроби далекобійну атаку заклинанням. При попаданні ціль отримує 2к6 ушко- джень вогнем.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 3 рівня або вищого, то ти створю- єш по одному додатковому променю за кожен рівень слота вище 2-го.

* */
  [Spell.ScorchingRay]: {
    name: 'ПАЛЮЧІ ПРОМЕНІ',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 24,
    self: false,
    target: 'одна або декілька цілей',
    numberOfTargets: 0,
    description:
      'Ти створюєш три палючі промені і направляєш їх на цілі, які перебувають в межах дистанції. Це може бути одна або декілька цілей. Для кожного променя зроби далекобійну атаку заклинанням. При попаданні ціль отримує 2к6 ушко- джень вогнем.',
    components: {
      c: true,
      t: true,
    },
    area: '',
    saveThough: '',
    attack: 'далекобійна атака заклинанням',
    highLvl: {
      has: true,
      from: 3,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, то ти створюєш по одному додатковому променю за кожен рівень слота вище 2-го.',
    },
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    damageType: [DamageType.Fire],
    source: Source.BasicRules,
  },
  /*
  * ПЕРЕДВІСТЯ
2 рівень, віщування (ритуал)
Час виконання: 1 хвилина
Дистанція: На себе
Компоненти: С, Т, М (особливі палички, кості або фігурки
з мітками, вартістю як мінімум 25 зм) Тривалість: Миттєва
Підкидаючи інкрустовані камінням палички, драконівські кісточки, розкладаючи карти або використовуючи інші ін- струменти для ворожби, ти отримуєш передвістя від потой- бічної сутності про результати особливого вчинку, який ти плануєш зробити протягом наступних 30 хвилин. Майстер вибирає одне з наступних можливих передвість:
• Благо, для хороших результатів
• Горе, для поганих результатів
• Благо і горе, для результатів, одночасно хороших і пога-
них
• Ніщо, для результатів, які і не хороші, і не погані
Заклинання не приймає до уваги обставини, які здатні змі- нити результат, такі як виконання додаткових заклинань або втрату чи приєднання супутників. Якщо ти виконуєш це заклинання кілька разів до завершення тривалого відпо- чинку, існує накопичувальний шанс 25 відсотків за кожне використання, починаючи з другого, що ти отримаєш ви- падкову відповідь. Майстер робить цей кидок приховано.
* */
  [Spell.Augury]: {
    name: 'ПЕРЕДВІСТЯ',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.LongTerm,
    castTime: 60, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Підкидаючи інкрустовані камінням палички, драконівські кісточки, розкладаючи карти або використовуючи ін- ші інструменти для ворожби, ти отримуєш передвістя від потой- бічної сутності про результати особливого вчинку, який ти плануєш зробити протягом наступних 30 хвилин. Майстер вибирає одне з наступних можливих передвість: • Благо, для хороших результатів • Горе, для поганих результатів • Благо і горе, для результатів, одночасно хороших і пога- них • Ніщо, для результатів, які і не хороші, і не погані Заклинання не приймає до уваги обставини, які здатні змі- нити результат, такі як виконання додаткових заклинань або втрату чи приєднання супутників. Якщо ти виконуєш це заклинання кілька разів до завершення тривалого відпо- чинку, існує накопичувальний шанс 25 відсотків за кожне використання, починаючи з другого, що ти отримаєш ви- падкову відповідь. Майстер робить цей кидок приховано.',
    components: {
      c: true,
      t: true,
      m: 'особливі палички, кості або фігурки з мітками, вартістю як мінімум 25 зм',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПІДМОГА
2 рівень, огородження
Час виконання: 1 вчинок
Дистанція: 1.5 кілометра
Компоненти: С, Т, М (полоска білої тканини) Тривалість: 8 годин
Твоє заклинання наділяє союзників стійкістю та рішучістю. Вибери не більше трьох істот в межах дистанції. На час три- валості максимум здоров’я та поточне здоров’я усіх цілей збільшується на 5.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, то здоров’я цілей збільшується ще на 5 за кожен рівень слота вище 2-го.

*/
  [Spell.Aid]: {
    name: 'ПІДМОГА',
    lvl: 2,
    school: MagicSchool.Abjuration, // огородження
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 28800,
    distance: 1500,
    self: false,
    target: 'не більше трьох істот',
    numberOfTargets: 3,
    description:
      'Твоє заклинання наділяє союзників стійкістю та рішучістю. Вибери не більше трьох істот в межах дистанції. На час три- валості максимум здоров’я та поточне здоров’я усіх цілей збільшується на 5.',
    components: {
      c: true,
      t: true,
      m: 'полоска білої тканини',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: true,
      from: 3,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, то здоров’я цілей збільшується ще на 5 за кожен рівень слота вище 2-го.',
    },
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПІТЬМА
2 рівень, втілення
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, М (хутро кажана і або крапля дьогтю, або
шматочок вугілля)
Тривалість: Концентрація, не довше 10 хвилин
З точки, обраної тобою в межах дистанції, розповзається магічна темрява сферою з радіусом 3 метри. Темрява оги- нає кути. Істоти з темним зором не можуть бачити крізь цю темряву, а немагічне світло не може її освітити. Якщо обра- на тобою точка знаходиться на предметі, який ти тримаєш або носиш, темрява виходить із предмета та пересувається разом з ним. Якщо повністю накрити джерело темряви непрозорим предметом, наприклад, чашею або шоломом, темрява буде заблокована. Якщо частина області цього за- клинання накриває область світла, створеного заклинан- ням із рівнем не вище 2, то заклинання, яке створило світ- ло, розсіюється.
* */
  [Spell.Darkness]: {
    name: 'ПІТЬМА',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 12,
    self: false,
    target: 'область з радіусом 3 метри з центром в точці, обраній тобою в межах дистанції',
    numberOfTargets: 1,
    description:
      'З точки, обраної тобою в межах дистанції, розповзається магічна темрява сферою з радіусом 3 метри. Темрява оги- нає кути. Істоти з темним зором не можуть бачити крізь цю темряву, а немагічне світло не може її освітити. Якщо обра- на тобою точка знаходиться на предметі, який ти тримаєш або носиш, темрява виходить із предмета та пересувається разом з ним. Якщо повністю накрити джерело темряви непрозорим предметом, наприклад, чашею або шоломом, темрява буде заблокована. Якщо частина області цього за- клинання накриває область світла, створеного заклинан- ням із рівнем не вище 2, то заклинання, яке створило світ- ло, розсіюється.',
    components: {
      c: true,
      t: true,
      m: 'хутро кажана і або крапля дьогтю, або шматочок вугілля',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПОКРАЩЕННЯ ХАРАКТЕРИСТИКИ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (хутро або перо звіра) Тривалість: Концентрація, не довше 1 години
Ти торкаєшся до істоти та покращуєш її за допомогою магії. Вибери один із наступних ефектів; ціль отримує цей ефект, доки заклинання триває.
Ведмежа витривалість. Ціль робить з перевагою пере- вірки Статури. Вона також отримує 2к6 тимчасового здо- ров’я, яке зникає в кінці заклинання.
Котяча спритність. Ціль робить з перевагою перевір- ки Вправності. Крім того, вона не отримує ушкодження від падіння з висоти 10 метрів або менше, якщо вона дієздатна.
Лисяча хитрість. Ціль робить з перевагою перевірки Інтелекту.
Орлина велич. Ціль робить з перевагою перевірки Ха- ризми.
Сила бика. Ціль робить з перевагою перевірки Сили, а її вантажопідйомність подвоюється.
Совина мудрість. Ціль робить з перевагою перевірки Мудрості.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 2-го.
* */
  [Spell.EnhanceAbility]: {
    name: 'ПОКРАЩЕННЯ ХАРАКТЕРИСТИКИ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600,
    distance: 0,
    self: false,
    target: 'істота, до якої ти торкаєшся',
    numberOfTargets: 1,
    description:
      'Ти торкаєшся до істоти та покращуєш її за допомогою магії. Вибери один із наступних ефектів; ціль отримує цей ефект, доки заклинання триває. Ведмежа витривалість. Ціль робить з перевагою перевірки Статури. Вона також отримує 2к6 тимчасового здо- ров’я, яке зникає в кінці заклинання. Котяча спритність. Ціль робить з перевагою перевір- ки Вправності. Крім того, вона не отримує ушкодження від падіння з висоти 10 метрів або менше, якщо вона дієздатна. Лисяча хитрість. Ціль робить з перевагою перевірки Інтелекту. Орлина велич. Ціль робить з перевагою перевірки Ха- ризми. Сила бика. Ціль робить з перевагою перевірки Сили, а її вантажопідйомність подвоюється. Совина мудрість. Ціль робить з перевагою перевірки Мудрості. На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 2-го.',
    components: {
      c: true,
      t: true,
      m: 'хутро або перо звіра',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: true,
      from: 3,
      description:
        'Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 2-го.',
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПОРИВ ВІТРУ
2 рівень, втілення
Час виконання: 1 вчинок
Дистанція: На себе (12-метрова лінія) Компоненти: С, Т, М (горошина)
Тривалість: Концентрація, не довше 1 хвилини
Порив сильного вітру довжиною 12 метрів і шириною 2 метри виривається від тебе в обраному напрямку, доки за- клинання триває. Всі істоти, які починають свій хід у цій лі- нії, повинні зробити успішний кидок рятунку Сили, інакше їх відштовхне на 3 метри від тебе в напрямку руху вітру. Всі істоти в лінії повинні витрачати по 2 метри пересування за кожен 1 метр, на який вони пересуваються в твій бік. Вітер розсіює гази і випаровування, а також гасить свічки, факе- ли та інші незахищені джерела вогню. Захищений вогонь, як наприклад, в ліхтарях, він змушує тремтіти, і існує 50% шанс, що згаснуть і вони. Доки заклинання триває, ти мо- жеш в кожен свій хід бонусним вчинком міняти напрям, в якому дме вітер.
* */
  [Spell.GustOfWind]: {
    name: 'ПОРИВ ВІТРУ',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Порив сильного вітру довжиною 12 метрів і шириною 2 метри виривається від тебе в обраному напрямку, доки за- клинання триває. Всі істоти, які починають свій хід у цій лі- нії, повинні зробити успішний кидок рятунку Сили, інакше їх відштовхне на 3 метри від тебе в напрямку руху вітру. Всі істоти в лінії повинні витрачати по 2 метри пересування за кожен 1 метр, на який вони пересуваються в твій бік. Вітер розсіює гази і випаровування, а також гасить свічки, факе- ли та інші незахищені джерела вогню. Захищений вогонь, як наприклад, в ліхтарях, він змушує тремтіти, і існує 50% шанс, що згаснуть і вони. Доки заклинання триває, ти мо- жеш в кожен свій хід бонусним вчинком міняти напрям, в якому дме вітер.',
    components: {
      c: true,
      t: true,
      m: 'горошина',
    },
    area: '',
    saveThough: 'Сили',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,

    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПОШТОВА ТВАРИНА
2 рівень, причарування (ритуал)
Час виконання: 1 вчинок Дистанція: 6 метрів
Компоненти: С, Т, М (шматочок їжі) Тривалість: 24 години
За допомогою цього заклинання ти передаєш через тварину повідомлення. Вибери Крихітного звіра, якого бачиш в ме- жах дистанції, такого як білка, синиця або кажан. Ти вказу- єш місце, яке колись вже відвідував, і одержувача, описуючи його ознаки, такі як «чоловік або жінка в уніформі міської варти» або «рудий дверг у загостреному капелюсі». Ти та- кож вимовляєш повідомлення довжиною не більше 25 слів.
Цей звір протягом тривалості заклинання рухається у вказане місце, покриваючи приблизно 80 кілометрів за 24 години при польоті або 40 кілометрів при інших видах пе- ресування. Прибувши на місце, звір передає твоє повідом- лення описаній тобою істоті, імітуючи звук твого голосу. Звір передасть послання тільки істоті, яка підходить під да- ний тобою опис. Якщо звір не досягне місця до закінчення тривалості заклинання, повідомлення буде втрачено, а звір почне вертатися до того місця, де ти виконав на нього це за- клинання.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, його трива- лість збільшується на 48 годин за кожен рівень слота вище 2-го.
* */
  [Spell.AnimalMessenger]: {
    name: 'ПОШТОВА ТВАРИНА',
    lvl: 2,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 86400,
    distance: 6,
    self: false,
    target: 'Крихітний звір, якого бачиш в межах дистанції',
    numberOfTargets: 1,
    description:
      'За допомогою цього заклинання ти передаєш через тварину повідомлення. Вибери Крихітного звіра, якого бачиш в ме- жах дистанції, такого як білка, синиця або кажан. Ти вказу- єш місце, яке колись вже відвідував, і одержувача, описуючи його ознаки, такі як «чоловік або жінка в уніформі міської варти» або «рудий дверг у загостреному капелюсі». Ти та- ж вимовляєш повідомлення довжиною не більше 25 слів. Цей звір протягом тривалості заклинання рухається у вказане місце, покриваючи приблизно 80 кілометрів за 24 години при польоті або 40 кілометрів при інших видах пе- ресування. Прибувши на місце, звір передає твоє повідом- лення описаній тобою істоті, імітуючи звук твого голосу. Звір передасть послання тільки істоті, яка підходить під да- ний тобою опис. Якщо звір не досягне місця до закінчення тривалості заклинання, повідомлення буде втрачено, а звір почне вертатися до того місця, де ти виконав на нього це за- клинання.',

    components: {
      c: true,
      t: true,
      m: 'шматочок їжі',
    },
    area: '',
    saveThough: '',
    attack: '',
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: true,
    damageType: [],

    source: Source.BasicRules,
  },
  /*
  * ПОШУК ПАСТОК
2 рівень, віщування
Час виконання: 1 вчинок Дистанція: 24 метри Компоненти: С, Т Тривалість: Миттєва
Ти відчуваєш присутність будь-яких пасток в межах дистан- ції, які знаходяться в межах лінії огляду.
Для цього заклинання пасткою вважається все, що запо- діює несподіваний ефект (задуманий таким своїм творцем), який вважається для тебе шкідливим або небажаним. Та- ким чином, це заклинання відчує область, захищену закли- нанням сигналізація, символи захисту, або механічною паст- кою, але не розпізнає хитку підлогу, нестійку стелю, або яму в землі.
Це заклинання вказує лише присутність пасток. Ти не дізнаєшся розташування всіх пасток, але зате знаєш загаль- ний характер небезпеки, який виходить від відчутої тобою пастки.
* */
  [Spell.FindTraps]: {
    name: 'ПОШУК ПАСТОК',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 24,
    self: false,
    target: '',
    numberOfTargets: 0,
    description:
      'Ти відчуваєш присутність будь-яких пасток в межах дистан- ції, які знаходяться в межах лінії огляду. Для цього заклинання пасткою вважається все, що запо- діює несподіваний ефект (задуманий таким своїм творцем), який вважається для тебе шкідливим або небажаним. Та- ким чином, це заклинання відчує область, захищену закли- нанням сигналізація, символи захисту, або механічною паст- кою, але не розпізнає хитку підлогу, нестійку стелю, або яму в землі. Це заклинання вказує лише присутність пасток. Ти не дізнаєшся розташування всіх пасток, але зате знаєш загаль- ний характер небезпеки, який виходить від відчутої тобою пастки.',
    components: {
      c: true,
      t: true,
      m: '',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },

    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПОШУК ПРЕДМЕТА
2 рівень, віщування
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (роздвоєна гілочка) Тривалість: Концентрація, не довше 10 хвилин
Опиши або назви відомий тобі предмет. Ти відчуваєш на- прям до цього предмету, доки він знаходиться в межах 300 метрів від тебе. Якщо предмет пересувається, ти дізнаєшся його напрямок. Це заклинання може шукати конкретний відомий тобі предмет, якщо ти хоча б раз бачив його побли- зу (в межах 6 метрів). В якості альтернативи, це заклинання може шукати найближчий предмет певного виду, напри- клад, особливий предмет одягу, ювелірну прикрасу, меблі, інструмент або зброю. Це заклинання не може виявити предмет, якщо прямий шлях між вами перерізаний свин- цем, нехай навіть самим тонким листом.
* */
  [Spell.LocateObject]: {
    name: 'ПОШУК ПРЕДМЕТА',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Опиши або назви відомий тобі предмет. Ти відчуваєш на- прям до цього предмету, доки він знаходиться в межах 300 метрів від тебе. Якщо предмет пересувається, ти дізнаєшся його напрямок. Це заклинання може шукати конкретний відомий тобі предмет, якщо ти хоча б раз бачив його побли- зу (в межах 6 метрів). В якості альтернативи, це заклинання може шукати найближчий предмет певного виду, напри- клад, особливий предмет одягу, ювелірну прикрасу, меблі, інструмент або зброю. Це заклинання не може виявити предмет, якщо прямий шлях між вами перерізаний свин- цем, нехай навіть самим тонким листом.',
    components: {
      c: true,
      t: true,
      m: 'роздвоєна гілочка',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПОШУК СКАКУНА
2 рівень, виклик
Час виконання: 10 хвилин Дистанція: 6 метрів Компоненти: С, Т Тривалість: Миттєва
Ти викликаєш дух, який приймає вигляд неймовірно ро- зумного, сильного та вірного скакуна, створюючи довго- строковий зв’язок з ним. З’являючись у вільному просторі в межах дистанції, скакун приймає обраний тобою вигляд, такий як бойовий кінь, поні, верблюд, лось або мастиф (Майстер може дозволити викликати в якості скакунів і ін- ших тварин). Скакун здобуває параметри обраної форми, хоча насправді він є небожителем, феєю або породженням (на твій вибір). Крім того, якщо у твого скакуна Інтелект 5 або нижчий, його Інтелект стає рівним 6, і він отримує здатність розуміти одну мову на твій вибір, на якій ти роз- мовляєш.
Твій скакун служить тобі як в бою, так і поза ним, і у тебе є з ним інстинктивний зв’язок, який дозволяє битися, як єдине ціле. Перебуваючи верхом на скакуні, ти можеш зро- бити так, що виконані тобою заклинання, які націлені тіль- ки на тебе, будуть націлені ще й на твого скакуна.
Коли здоров’я скакуна опускається до 0, він зникає, не за- лишаючи фізичного тіла. Ти також можеш у будь-який час відпустити скакуна вчинком, змушуючи його зникнути. У будь-якому випадку, повторне виконання цього заклинання закликає цього ж скакуна, відновлюючи його здоров’я до максимуму. Доки скакун перебуває в межах 1.5 кілометра від тебе, ви можете телепатично спілкуватися один з одним.
У тебе не може бути більше одного скакуна, викликаного цим заклинанням, одночасно. Ти можеш вчинком назавж- ди відпустити скакуна, звільнивши його від зв’язку і змушу- ючи зникнути.
* */
  [Spell.FindSteed]: {
    name: 'ПОШУК СКАКУНА',
    lvl: 2,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.LongTerm,
    castTime: 600, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 6,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Ти викликаєш дух, який приймає вигляд неймовірно ро- зумного, сильного та вірного скакуна, створюючи довго- строковий зв’язок з ним. З’являючись у вільному просторі в межах дистанції, скакун приймає обраний тобою вигляд, такий як бойовий кінь, поні, верблюд, лось або мастиф (Майстер може дозволити викликати в якості скакунів і ін- ших тварин). Скакун здобуває параметри обраної форми, хоча насправді він є небожителем, феєю або породженням (на твій вибір). Крім того, якщо у твого скакуна Інтелект 5 або нижчий, його Інтелект стає рівним 6, і він отримує здатність розуміти одну мову на твій вибір, на якій ти роз- мовляєш. Твій скакун служить тобі як в бою, так і поза ним, і у тебе є з ним інстинктивний зв’язок, який дозволяє битися, як єдине ціле. Перебуваючи верхом на скакуні, ти можеш зро- бити так, що виконані тобою заклинання, які націлені тіль- ки на тебе, будуть націлені ще й на твого скакуна. Коли здоров’я скакуна опускається до 0, він зникає, не за- лишаючи фізичного тіла. Ти також можеш у будь-який час відпустити скакуна вчинком, змушуючи його зникнути. У будь-якому випадку, повторне виконання цього заклинання закликає цього ж скакуна, відновлюючи його здоров’я до максимуму. Доки скакун перебуває в межах 1.5 кілометра від тебе, ви можете телепатично спілкуватися один з одним. У тебе не може бути більше одного скакуна, викликаного цим заклинанням, одночасно. Ти можеш вчинком назавж- ди відпустити скакуна, звільнивши його від зв’язку і змушу- ючи зникнути.',
    components: {
      c: true,
      t: true,
      m: '',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПОШУК ТВАРИН АБО РОСЛИН
2 рівень, віщування (ритуал)
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С, Т, М (шматочок шерсті собаки) Тривалість: Миттєва
Назви певний вид звіра або рослини. Зосередившись на го- лосі природи в довкіллі, ти дізнаєшся напрямок і відстань до найближчої істоти або рослини цього виду в межах 8 кі- лометрів, якщо вони взагалі є.
* */
  [Spell.LocateAnimalsOrPlants]: {
    name: 'ПОШУК ТВАРИН АБО РОСЛИН',
    lvl: 2,
    school: MagicSchool.Divination, // віщування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Назви певний вид звіра або рослини. Зосередившись на го- лосі природи в довкіллі, ти дізнаєшся напрямок і відстань до найближчої істоти або рослини цього виду в межах 8 кі- лометрів, якщо вони взагалі є.',
    components: {
      c: true,
      t: true,
      m: 'шматочок шерсті собаки',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: true,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПРИМАРА
2 рівень, ілюзія
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (клапоть овечої шерсті) Тривалість: Концентрація, не довше 1 хвилини
Ти створюєш ілюзію у свідомості істоти, яку бачиш в межах дистанції. Ціль повинна зробити кидок рятунку Інтелекту. При провалі ти створюєш уявний предмет, істоту або інше видиме явище на твій вибір, яке поміститься в куб з довжи- ною ребра 2 метри, і сприймається тільки ціллю, поки за- клинання діє. Це заклинання не робить ніякого ефекту на нежить і конструктів.
Ілюзія включає звуки, температуру та інші подразники, очевидні тільки для цієї істоти. Ціль може вчинком дослід- жувати ілюзію перевіркою Інтелекту (Обстеження) проти СК твоїх заклинань. Якщо перевірка була успішною, ціль розуміє, що перед нею ілюзія, і заклинання закінчується. Доки ціль знаходиться під дією цього заклинання, вона вважає ілюзію справжньою. Вона сама придумує пояснення нелогічності взаємодії з ілюзією. Наприклад, спробував- ши пройти по вигаданому мосту над провалом, вона впаде вниз. Якщо ціль виживе, вона все одно буде вважати, що міст існує, а пройти їй завадило щось інше: її штовхнули, вона посковзнулася, або її збив сильний порив вітру.
Ціль настільки впевнена в існуванні ілюзії, що навіть здат- на отримувати від неї ушкодження. Ілюзія у формі істоти може атакувати ціль. Ілюзія, яка виглядає як вогонь, басейн
з кислотою або лава, можуть спалити ціль. Кожен раунд у твій хід ілюзія може заподіяти цілі ушкодження психічною енергією 1к6, якщо та знаходиться в області ілюзії або в ме- жах 1 метра від ілюзії істоти або небезпеки, здатної завдава- ти ушкодження, наприклад, атакою. Ціль отримує ушко- дження того виду, який відповідає формі ілюзії.
* */

  [Spell.PhantasmalForce]: {
    name: 'ПРИМАРА',
    lvl: 2,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target: 'Істота, яку бачиш в межах дистанції',
    numberOfTargets: 1,
    description:
      'Ти створюєш ілюзію у свідомості істоти, яку бачиш в межах дистанції. Ціль повинна зробити кидок рятунку Інтелекту. При провалі ти створюєш уявний предмет, істоту або інше видиме явище на твій вибір, яке поміститься в куб з довжи- ною ребра 2 метри, і сприймається тільки ціллю, поки за- клинання діє. Це заклинання не робить ніякого ефекту на нежить і конструктів. Ілюзія включає звуки, температуру та інші подразники, очевидні тільки для цієї істоти. Ціль може вчинком дослід- жувати ілюзію перевіркою Інтелекту (Обстеження) проти СК твоїх заклинань. Якщо перевірка була успішною, ціль розуміє, що перед нею ілюзія, і заклинання закінчується. Доки ціль знаходиться під дією цього заклинання, вона вважає ілюзію справжньою. Вона сама придумує пояснення нелогічності взаємодії з ілюзією. Наприклад, спробував- ши пройти по вигаданому мосту над провалом, вона впаде вниз. Якщо ціль виживе, вона все одно буде вважати, що міст існує, а пройти їй завадило щось інше: її штовхнули, вона посковзнулася, або її збив сильний порив вітру. Ціль настільки впевнена в існуванні ілюзії, що навіть здат- на отримувати від неї ушкодження. Ілюзія у формі істоти може атакувати ціль. Ілюзія, яка виглядає як вогонь, басейн з кислотою або лава, можуть спалити ціль. Кожен раунд у твій хід ілюзія може заподіяти цілі ушкодження психічною енергією 1к6, якщо та знаходиться в області ілюзії або в ме- жах 1 метра від і люзії істоти або небезпеки, здатної завдава- ти ушкодження, наприклад, атакою. Ціль отримує ушко- дження того виду, який відповідає формі ілюзії.',

    components: {
      c: true,
      t: true,
      m: 'клапоть овечої шерсті',
    },

    area: '',
    saveThough: 'Інтелект',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ПРОМІНЬ СЛАБКОСТІ
2 рівень, некромантія
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т
Тривалість: Концентрація, не довше 1 хвилини
Чорний промінь вилітає з твого пальця і спрямовується в істоту, яка знаходиться в межах дистанції. Здійсни по цілі далекобійну атаку заклинанням. При попаданні ціль до кінця тривалості заклинання заподіює тільки половину уш- коджень своїми атаками зброєю, які використовують Силу. В кінці кожного свого ходу ціль може здійснювати кидок рятунку Статури від цього заклинання. При успіху закли- нання закінчується.
*/
  [Spell.RayOfEnfeeblement]: {
    name: 'ПРОМІНЬ СЛАБКОСТІ',
    lvl: 2,
    school: MagicSchool.Necromancy, // некромантія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target: 'Істота, яка знаходиться в межах дистанції',
    numberOfTargets: 1,
    description:
      'Чорний промінь вилітає з твого пальця і спрямовується в істоту, яка знаходиться в межах дистанції. Здійсни по цілі далекобійну атаку заклинанням. При попаданні ціль до кінця тривалості заклинання заподіює тільки половину уш- коджень своїми атаками зброєю, які використовують Силу. В кінці кожного свого ходу ціль може здійснювати кидок рятунку Статури від цього заклинання. При успіху закли- нання закінчується.',

    components: {
      c: true,
      t: true,
      m: '',
    },

    area: '',
    saveThough: 'Статура',
    attack: 'Далекобійна атака заклинанням',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [DamageType.Necrotic],
    source: Source.BasicRules,
  },
  /*
  * РІСТ ШИПІВ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: 30 метрів
Компоненти: С, Т, М (сім гострих шипів або сім загостре-
них гілочок)
Тривалість: Концентрація, не довше 10 хвилин
Підлога в межах 4-метрового радіуса з центром в точці в ме- жах дистанції покривається шипами і колючками. Ця міс- цевість стає важкопрохідною на час тривалості заклинання. Коли істота входить в цю область або йде по ній, вона от- римує 2к4 колотих ушкоджень за кожен 1 пройдений метр.
Трансформація поверхні проходить практично непоміт- но, і шипи добре замасковані. Істоти, які не бачили цю міс- цевість в момент виконання заклинання, повинні зробити перевірку Мудрості (Уважності) проти СК твоїх заклинань, щоб розпізнати місцевість небезпечною, перед тим як в неї увійти.
* */
  [Spell.SpikeGrowth]: {
    name: 'РІСТ ШИПІВ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 30,
    self: false,
    target: 'Підлога в межах 4-метрового радіуса з центром в точці в ме- жах дистанції',
    numberOfTargets: 1,
    description:
      'Підлога в межах 4-метрового радіуса з центром в точці в ме- жах дистанції покривається шипами і колючками. Ця міс- цевість стає важкопрохідною на час тривалості заклинання. Коли істота входить в цю область або йде по ній, вона от- римує 2к4 колотих ушкоджень за кожен 1 пройдений метр. Трансформація поверхні проходить практично непоміт- но, і шипи добре замасковані. Істоти, які не бачили цю міс- цевість в момент виконання заклинання, повинні зробити перевірку Мудрості (Уважності) проти СК твоїх заклинань, щоб розпізнати місцевість небезпечною, перед тим як в неї увійти.',

    components: {
      c: true,
      t: true,
      m: 'сім гострих шипів або сім загостре- них гілочок',
    },

    area: '4-метровий радіус з центром в точці в ме- жах дистанції',
    saveThough: 'Мудрість',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [DamageType.Piercing],
    source: Source.BasicRules,
  },
  /*
  * РОЗМИТА ФОРМА
2 рівень, ілюзія
Час виконання: 1 вчинок
Дистанція: На себе
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
Твоє тіло стає розмитим і вітряним для всіх, хто бачить тебе. Доки заклинання триває, всі істоти роблять по тобі кидки атак з перешкодою. Атакуючий отримує імунітет до цього ефекту, якщо покладається не на зір, а, наприклад, на сліпий зір, або може бачити крізь ілюзії, наприклад, за до- помогою істинного зору.
*/
  [Spell.Blur]: {
    name: 'РОЗМИТА ФОРМА',
    lvl: 2,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Твоє тіло стає розмитим і вітряним для всіх, хто бачить тебе. Доки заклинання триває, всі істоти роблять по тобі кидки атак з перешкодою. Атакуючий отримує імунітет до цього ефекту, якщо покладається не на зір, а, наприклад, на сліпий зір, або може бачити крізь ілюзії, наприклад, за до- помогою істинного зору.',
    components: {
      c: true,
      t: false,
      m: '',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * РОЗПЕЧЕНИЙ МЕТАЛ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (шматок заліза і полум’я) Тривалість: Миттєва
Вибери рукотворний металевий предмет на зразок метале- вої зброї або комплекту важкого або середнього обладунку, який ти бачиш в межах дистанції. Ти робиш його розпеченим до червоного. Кожна істота, яка знаходяться у фізич- ному контакті з цим предметом, отримує 2к8 ушкоджень вогнем, коли ти виконуєш це заклинання. Доки заклинання триває, ти можеш бонусним вчинком в кожному наступно- му ходу знову завдавати ці ушкодження.
Якщо істота тримає або носить предмет, і отримує від нього ушкодження, вона повинна зробити успішний кидок рятунку Статури, інакше вона упускає цей предмет, якщо може. Якщо вона не може упустити предмет, то до початку твого наступного ходу робить з перешкодою усі кидки атак та перевірки характеристик.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, його ушко- дження збільшуються на 1к8 за кожен рівень слота вище другого. */
  [Spell.HeatMetal]: {
    name: 'РОЗПЕЧЕНИЙ МЕТАЛ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.BonusAction,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 12,
    self: false,
    target:
      'Рукотворний металевий предмет на зразок метале- вої зброї або комплекту важкого або середнього обладунку, який ти бачиш в межах дистанції',
    numberOfTargets: 1,
    description:
      'Вибери рукотворний металевий предмет на зразок метале- вої зброї або комплекту важкого або середнього обладунку, який ти бачиш в межах дистанції. Ти робиш його розпеченим до червоного. Кожна істота, яка знаходяться у фізич- ному контакті з цим предметом, отримує 2к8 ушкоджень вогнем, коли ти виконуєш це заклинання. Доки заклинання триває, ти можеш бонусним вчинком в кожному наступно- му ходу знову завдавати ці ушкодження. Якщо істота тримає або носить предмет, і отримує від нього ушкодження, вона повинна зробити успішний кидок рятунку Статури, інакше вона упускає цей предмет, якщо може. Якщо вона не може упустити предмет, то до початку твого наступного ходу робить з перешкодою усі кидки атак та перевірки характеристик.',

    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    damageType: [DamageType.Fire],

    source: Source.BasicRules,
    saveThough: 'Статура',
    attack: '',
    highLvl: {
      has: true,
      from: 3,
      description: 'його ушко- дження збільшуються на 1к8 за кожен рівень слота вище другого.',
    },
    area: '',

    components: {
      c: true,
      t: false,
      m: 'шматок заліза і полум’я',
    },
  },
  /*
  * СЛІПОТА/ГЛУХОТА
2 рівень, некромантія
Час виконання: 1 вчинок Дистанція: 6 метрів Компоненти: С Тривалість: 1 хвилина
Ти можеш засліпити ворога або зробити його глухим. Ви- бери одну істоту, яку бачиш в межах дистанції, котра одразу ж робить кидок рятунку Статури. У разі провалу ціль стає на час тривалості заклинання осліплена або оглухла (на твій вибір). В кінці кожного свого ходу ціль може здійснювати кидок рятунку Статури. У разі успіху заклинання закінчу- ється
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 3 рівня або вищого, ти можеш об- рати його цілями по одній додатковій істоті за кожен рівень слота вище другого.
* */

  [Spell.BlindnessDeafness]: {
    name: 'СЛІПОТА/ГЛУХОТА',
    lvl: 2,
    school: MagicSchool.Necromancy, // некромантія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 6,
    self: false,
    target: 'Істота, яку бачиш в межах дистанції',
    numberOfTargets: 1,
    description:
      'Ти можеш засліпити ворога або зробити його глухим. Ви- бери одну істоту, яку бачиш в межах дистанції, котра одразу ж робить кидок рятунку Статури. У разі провалу ціль стає на час тривалості заклинання осліплена або оглухла (на твій вибір). В кінці кожного свого ходу ціль може здійснювати кидок рятунку Статури. У разі успіху заклинання закінчу- ється',
    components: {
      c: true,
      t: false,
      m: '',
    },
    area: '',
    saveThough: 'Статура',
    attack: '',
    highLvl: {
      has: true,
      from: 3,
      description:
        'ти можеш об- рати його цілями по одній додатковій істоті за кожен рівень слота вище другого.',
    },
    concentration: false,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * СТІНА ЗІ СТРІЛ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: 1 метр
Компоненти: С, Т, М (як мінімум чотири стріли або арба-
летних болта) Тривалість: 8 годин
Ти встромляєш чотири немагічні боєприпаси — стріли або арбалетні болти — в землю у межах дистанції і виконуєш на них заклинання, яке захищає область. Доки заклинан- ня триває, кожен раз, коли інша істота крім тебе вперше за хід опиняється в межах 1 метра від боєприпасів або закінчує там хід, один боєприпас вилітає і атакує її. Істота має зробити успішний кидок рятунку Вправності, інакше вона отримає 1к6 колотих ушкоджень. Боєприпас при цьому знищується. Заклинання закінчується, коли закінчуються боєприпаси.
Виконуючи це заклинання, ти можеш вказати будь-яких істот, яких це заклинання ігноруватиме.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, кількість бо- єприпасів збільшується на два за кожен рівень слота вище 2-го.
*  */
  [Spell.CordonOfArrows]: {
    name: 'СТІНА ЗІ СТРІЛ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 28800,
    distance: 1,
    self: false,
    target: 'Чотири немагічні боєприпаси — стріли або арбалетні болти',
    numberOfTargets: 4,
    description:
      'Ти встромляєш чотири немагічні боєприпаси — стріли або арбалетні болти — в землю у межах дистанції і виконуєш на них заклинання, яке захищає область. Доки заклинан- ня триває, кожен раз, коли інша істота крім тебе вперше за хід опиняється в межах 1 метра від боєприпасів або закінчує там хід, один боєприпас вилітає і атакує її. Істота має зробити успішний кидок рятунку Вправності, інакше вона отримає 1к6 колотих ушкоджень. Боєприпас при цьому знищується. Заклинання закінчується, коли закінчуються боєприпаси. Виконуючи це заклинання, ти можеш вказати будь-яких істот, яких це заклинання ігноруватиме.',
    components: {
      c: true,
      t: true,
      m: 'як мінімум чотири стріли або арбалетних болта',
    },
    area: '',
    saveThough: 'Вправність',
    attack: '',
    highLvl: {
      has: true,
      from: 3,
      description: 'кількість бо- єприпасів збільшується на два за кожен рівень слота вище 2-го.',
    },
    concentration: false,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [DamageType.Piercing],
    source: Source.BasicRules,
  },
  /*
  * ТАВРУВАЛЬНА КАРА
2 рівень, втілення
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С
Тривалість: Концентрація, не довше 1 хвилини
Коли ти наступного разу попадеш по істоті атакою руко- пашною зброєю, доки це заклинання триває, твоя зброя випустить астральне сяйво. Ця атака заподіює цілі додатко- во 2к6 ушкоджень випромінюванням. Ціль стає видимою, якщо була невидима, починає випускати тьмяне світло в межах 1 метра, і не може стати невидимою, доки це закли- нання триває.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 3 рівня або вищого, його додатко- ві ушкодження збільшуються на 1к6 за кожен рівень слота вище 2-го.
* */
  [Spell.BrandingSmite]: {
    name: 'ТАВРУВАЛЬНА КАРА',
    lvl: 2,
    school: MagicSchool.Evocation, // втілення
    actionType: Action.BonusAction,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Коли ти наступного разу попадеш по істоті атакою руко- пашною зброєю, доки це заклинання триває, твоя зброя випустить астральне сяйво. Ця атака заподіює цілі додатко- во 2к6 ушкоджень випромінюванням. Ціль стає видимою, якщо була невидима, починає випускати тьмяне світло в межах 1 метра, і не може стати невидимою, доки це закли- нання триває.',
    components: {
      c: true,
      t: false,
      m: '',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: true,
      from: 3,
      description:
        'його додатко- ві ушкодження збільшуються на 1к6 за кожен рівень слота вище 2-го.',
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,

    damageType: [DamageType.Radiant],
    source: Source.BasicRules,
  },
  /*
  * ТЕМНИЙ ЗІР
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (щіпка сушеної моркви або агат) Тривалість: 8 годин
Ти торкаєшся до згідної істоти і даруєш їй можливість ба- чити в темряві. Доки заклинання триває, ця істота має тем- ний зір в межах 12 метрів.
* */
  [Spell.Darkvision]: {
    name: 'ТЕМНИЙ ЗІР',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 28800,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 1,
    description:
      'Ти торкаєшся до згідної істоти і даруєш їй можливість ба- чити в темряві. Доки заклинання триває, ця істота має тем- ний зір в межах 12 метрів.',
    components: {
      c: true,
      t: true,
      m: 'щіпка сушеної моркви або агат',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: false,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,

    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ТИША
2 рівень, ілюзія (ритуал)
Час виконання: 1 вчинок
Дистанція: 24 метри
Компоненти: С, Т
Тривалість: Концентрація, не довше 10 хвилин
Доки заклинання триває, ніякі звуки не можуть пролунати в межах сфери з радіусом 4 метри з центром в точці, обра- ній тобою в межах дистанції, а також не можуть проходити крізь неї. Всі істоти та предмети, які повністю знаходяться в сфері, отримують імунітет до ушкоджень звуком, і істоти вважаються оглухлі, коли повністю знаходяться в ній. Там неможливо виконувати заклинання зі словесним компо- нентом.
* */

  [Spell.Silence]: {
    name: 'ТИША',
    lvl: 2,
    school: MagicSchool.Illusion, // ілюзія
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 600,
    distance: 24,
    self: false,
    target: 'Сфера з радіусом 4 метри з центром в точці, обра- ній тобою в межах дистанції',
    numberOfTargets: 1,
    description:
      'Доки заклинання триває, ніякі звуки не можуть пролунати в межах сфери з радіусом 4 метри з центром в точці, обра- ній тобою в межах дистанції, а також не можуть проходити крізь неї. Всі істоти та предмети, які повністю знаходяться в сфері, отримують імунітет до ушкоджень звуком, і істоти вважаються оглухлі, коли повністю знаходяться в ній. Там неможливо виконувати заклинання зі словесним компо- нентом.',
    components: {
      c: true,
      t: true,
      m: '',
    },
    area: 'Сфера з радіусом 4 метри з центром в точці, обра- ній тобою в межах дистанції',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: true,

    damageType: [],
    source: Source.BasicRules,
  },
  /*
  * ТРЮК З МОТУЗКОЮ
2 рівень, видозміна
Час виконання: 1 вчинок
Дистанція: Дотик
Компоненти: С, Т, М (екстракт зерна і петля з пергаменту) Тривалість: 1 година
Ти торкаєшся до мотузки довжиною не більше 12 метрів. Один її кінець піднімається в повітря, а інша частина висить перпендикулярно до підлоги. На верхньому кінці мотузки з’являється невидимий вхід у міжпростір, який існує, доки заклинання триває. У цей міжпростір можна потрапити, вилізши по мотузці нагору. У ньому може поміститися ві- сім істот із розміром не більше Середнього. Мотузку мож- на затягнути всередину, після чого зовні її не буде видно. Атаки і заклинання не можуть проходити через вхід всере- дину міжпростору і назовні, але ті, хто знаходяться всереди- ні, можуть все бачити, ніби через вікно 1 × 1 метр з центром на мотузці. Все, що знаходиться в міжпросторі, вивалюєть- ся назовні, коли заклинання закінчується.
* */

  [Spell.RopeTrick]: {
    name: 'ТРЮК З МОТУЗКОЮ',
    lvl: 2,
    school: MagicSchool.Transmutation, // видозміна
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 3600,
    distance: 0,
    self: true,
    target: 'Мотузка довжиною не більше 12 метрів',
    numberOfTargets: 1,
    description:
      'Ти торкаєшся до мотузки довжиною не більше 12 метрів. Один її кінець піднімається в повітря, а інша частина висить перпендикулярно до підлоги. На верхньому кінці мотузки з’являється невидимий вхід у міжпростір, який існує, доки заклинання триває. У цей міжпростір можна потрапити, вилізши по мотузці нагору. У ньому може поміститися ві- сім істот із розміром не більше Середнього. Мотузку мож- на затягнути всередину, після чого зовні її не буде видно. Атаки і заклинання не можуть проходити через вхід всере- дину міжпростору і назовні, але ті, хто знаходяться всереди- ні, можуть все бачити, ніби через вікно 1 × 1 метр з центром на мотузці. Все, що знаходиться в міжпросторі, вивалюєть- ся назовні, коли заклинання закінчується.',
    components: {
      c: true,
      t: true,
      m: 'екстракт зерна і петля з пергаменту',
    },
    area: '',
    saveThough: '',
    attack: '',

    highLvl: {
      has: false,
    },
    concentration: false,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    source: Source.BasicRules,
    damageType: [],
  },
  /*
  * ТУМАННИЙ КРОК
2 рівень, виклик
Час виконання: 1 бонусний вчинок Дистанція: На себе
Компоненти: С
Тривалість: Миттєва
Огорнувши себе сріблястим туманом, ти телепортуєшся не більше як на 6 метрів у вільний простір, який бачиш.
* */

  [Spell.MistyStep]: {
    name: 'ТУМАННИЙ КРОК',
    lvl: 2,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.BonusAction,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 0,
    distance: 0,
    self: true,
    target: '',
    numberOfTargets: 0,
    description:
      'Огорнувши себе сріблястим туманом, ти телепортуєшся не більше як на 6 метрів у вільний простір, який бачиш.',
    components: {
      c: true,
      t: false,
      m: '',
    },
    area: '',
    saveThough: '',
    attack: '',

    highLvl: {
      has: false,
    },
    concentration: false,
    canEndEarlier: false,
    freeWay: false,
    ritual: false,
    source: Source.BasicRules,
    damageType: [],
  },
  /*
  * УТРИМАННЯ ОСОБИ
2 рівень, причарування
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (невеликий прямий шматочок заліза) Тривалість: Концентрація, не довше 1 хвилини
Вибери гуманоїда, якого бачиш в межах дистанції. Ціль по- винна зробити успішний кидок рятунку Мудрості, інакше стане паралізованою на період тривалості заклинання. В кінці кожного свого ходу ціль може здійснювати новий ки- док рятунку Мудрості. У разі успіху заклинання на цій цілі закінчується.
На вищих рівнях: Якщо ти виконуєш це заклинання, витрачаючи магічний слот 3 рівня або вищого, ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 2-го. Ці гуманоїди повинні знаходитися в межах 6 метрів один від одного, коли ти націлюєшся на них.
* */

  [Spell.HoldPerson]: {
    name: 'УТРИМАННЯ ОСОБИ',
    lvl: 2,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target: 'Гуманоїд, якого бачиш в межах дистанції',
    numberOfTargets: 1,
    description:
      'Вибери гуманоїда, якого бачиш в межах дистанції. Ціль по- винна зробити успішний кидок рятунку Мудрості, інакше стане паралізованою на період тривалості заклинання. В кінці кожного свого ходу ціль може здійснювати новий ки- док рятунку Мудрості. У разі успіху заклинання на цій цілі закінчується.',
    components: {
      c: true,
      t: true,
      m: 'невеликий прямий шматочок заліза',
    },
    area: '',
    saveThough: 'Мудрість',
    attack: '',

    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,

    highLvl: {
      has: true,
      from: 3,
      description:
        'ти можеш зробити його цілями по одній додатковій істоті за кожен рівень слота вище 2-го. Ці гуманоїди повинні знаходитися в межах 6 метрів один від одного, коли ти націлюєшся на них.',
    },
  },
  /*
  * ХМАРА КИНДЖАЛІВ
2 рівень, виклик
Час виконання: 1 вчинок
Дистанція: 12 метрів
Компоненти: С, Т, М (шматок скла) Тривалість: Концентрація, не довше 1 хвилини
Ти заповнюєш повітря кинджалами, які обертаються в кубі з довжиною ребра 1 метр, з центром в точці, обраній тобою
в межах дистанції. Істота отримує 4к4 рубаних ушкоджень, коли вперше за хід входить в область заклинання або почи- нає там хід.
На вищих рівнях: Якщо ти виконуєш це заклинання, ви- трачаючи магічний слот 3 рівня або вищого, його ушкоджен- ня збільшуються на 2к4 за кожен рівень слота вище 2-го.
*/

  [Spell.CloudOfDaggers]: {
    name: 'ХМАРА КИНДЖАЛІВ',
    lvl: 2,
    school: MagicSchool.Conjuration, // виклик
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target: 'Точка, обрана тобою в межах дистанції',
    numberOfTargets: 1,
    description:
      'Ти заповнюєш повітря кинджалами, які обертаються в кубі з довжиною ребра 1 метр, з центром в точці, обраній тобою в межах дистанції. Істота отримує 4к4 рубаних ушкоджень, коли вперше за хід входить в область заклинання або почи- нає там хід.',
    components: {
      c: true,
      t: true,
      m: 'шматок скла',
    },
    area: 'Куб з довжиною ребра 1 метр',
    saveThough: '',
    attack: '',

    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [DamageType.Slashing],
    source: Source.BasicRules,

    highLvl: {
      has: true,
      from: 3,
      description: 'його ушкоджен- ня збільшуються на 2к4 за кожен рівень слота вище 2-го.',
    },
  },
  /*
  * ЧАРІВНЕ МОВЛЕННЯ
2 рівень, причарування
Час виконання: 1 вчинок Дистанція: 12 метрів Компоненти: С, Т Тривалість: 1 хвилина
Ти промовляєш відволікаючу промову, змушуючи обра- них тобою істот, яких ти бачиш в межах дистанції, і які при цьому можуть чути тебе, зробити кидок рятунку Мудрості. Істоти, які не можуть бути причарованими, автоматично досягають успіху в кидку рятунку, а якщо ти або твої супут- ники б’єтесь з істотою, вона робить цей кидок рятунку з перевагою. При провалі ціль отримує перешкоду до пере- вірок Мудрості (Уважності), які здійснює для виявлення ін- ших істот крім тебе, доки заклинання триває або доки ціль не перестане тебе чути. Заклинання закінчується, якщо ти стаєш недієздатним або втрачаєш можливість говорити.
*
* */

  [Spell.Enthrall]: {
    name: 'ЧАРІВНЕ МОВЛЕННЯ',
    lvl: 2,
    school: MagicSchool.Enchantment, // причарування
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 60,
    distance: 12,
    self: false,
    target: 'Істоти, яких ти бачиш в межах дистанції, і які при цьому можуть чути тебе',
    numberOfTargets: 1,
    description:
      'Ти промовляєш відволікаючу промову, змушуючи обра- них тобою істот, яких ти бачиш в межах дистанції, і які при цьому можуть чути тебе, зробити кидок рятунку Мудрості. Істоти, які не можуть бути причарованими, автоматично досягають успіху в кидку рятунку, а якщо ти або твої супут- ники б’єтесь з істотою, вона робить цей кидок рятунку з перевагою. При провалі ціль отримує перешкоду до пере- вірок Мудрості (Уважності), які здійснює для виявлення ін- ших істот крім тебе, доки заклинання триває або доки ціль не перестане тебе чути. Заклинання закінчується, якщо ти стаєш недієздатним або втрачаєш можливість говорити.',
    components: {
      c: true,
      t: true,
    },
    area: '',
    saveThough: 'Мудрість',
    attack: '',
    concentration: false,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
};

// console.log('2 lvl spells: ', Object.keys(spells));

export default spells;
