import { Lvl2, Spell } from '@/spells/list/basic';
import { Action, ISpell, MagicSchool, Source } from '@/types/spell';

const spells: { -readonly [key in keyof typeof Spell]?: ISpell } = {
  /*
    * ТВАРИННА ФОРМА
  2 рівень, втілення
  Час виконання: 1 вчинок
  Дистанція: 6 метрів
  Компоненти: С, Т
  Тривалість: Концентрація, не довше 24 годин
  Твоя магія перетворює інших на звірів. Вибери будь-яку кількість згідних істот, яких ти бачиш в межах дистанції. Ти змінюєш вигляд кожної цілі на вигляд звіра Великого або меншого розміру з показником небезпечності не вище 4.
  У наступні ходи ти можеш своїм вчинком надавати цим істотам нову форму. Перетворення тримається всю трива- лість заклинання, або доки здоров’я цілі не опуститься до 0, або доки вона не помре. У кожної цілі може бути свій ви- гляд. Ігрові параметри цілей змінюються на параметри об- раних звірів, але у них залишаються свої думки та показни- ки Інтелекту, Мудрості і Харизми. Ціль приймає здоров’я нового вигляду, а після повернення у свій вигляд у неї буде кількість здоров’я як перед перетворенням. Якщо у свій вигляд вона повертається в результаті опускання здоров’я до 0, то усі зайві ушкодження переносяться на її природну форму. Якщо зайві ушкодження не опустили здоров’я при- родної форми нижче 0, істота не втрачає свідомість.
  Дії істоти обмежені тими, які доступні новій формі, і вона не може розмовляти і виконувати заклинання. Споря- дження цілі зливається з новою зовнішністю. Ціль не може активовувати та використовувати своє спорядження, і не отримує від нього жодних переваг.
  */
  [Spell.AnimalShapes]: {
    name: 'ТВАРИННА ФОРМА',
    lvl: 2,
    school: MagicSchool.Transmutation, // втілення
    actionType: Action.Action,
    castTime: 0, // 1 вчинок === 0 секунд
    duration: 1440,
    distance: 6,
    self: false,
    target: 'Будь-яка кількість згідних істот, яких ти бачиш в межах дистанції',
    numberOfTargets: 0,
    description:
      'Твоя магія перетворює інших на звірів. Вибери будь-яку кількість згідних істот, яких ти бачиш в межах дистанції. Ти змінюєш вигляд кожної цілі на вигляд звіра Великого або меншого розміру з показником небезпечності не вище 4. У наступні ходи ти можеш своїм вчинком надавати цим істотам нову форму. Перетворення тримається всю трива- лість заклинання, або доки здоров’я цілі не опуститься до 0, або доки вона не помре. У кожної цілі може бути свій ви- гляд. Ігрові параметри цілей змінюються на параметри об- раних звірів, але у них залишаються свої думки та показни- ки Інтелекту, Мудрості і Харизми. Ціль приймає здоров’я нового вигляду, а після повернення у свій вигляд у неї буде кількість здоров’я як перед перетворенням. Якщо у свій вигляд вона повертається в результаті опускання здоров’я до 0, то усі зайві ушкодження переносяться на її природну форму. Якщо зайві ушкодження не опустили здоров’я при- родної форми нижче 0, істота не втрачає свідомість. Дії істоти обмежені тими, які доступні новій формі, і вона не може розмовляти і виконувати заклинання. Споря- дження цілі зливається з новою зовнішністю. Ціль не може активовувати та використовувати своє спорядження, і не отримує від нього жодних переваг.',
    components: {
      c: true,
      t: true,
      m: '',
    },
    area: '',
    saveThough: '',
    attack: '',
    highLvl: {
      has: false,
    },
    concentration: true,
    canEndEarlier: true,
    freeWay: false,
    ritual: false,
    damageType: [],
    source: Source.BasicRules,
  },
};

// const l = Object.keys(Lvl2);
// const r = [];
//
// for (let i = 0; i < l.length; i += 1) {
//   if (!spells[l[i]]) r.push(l[i]);
// }
// console.log('8 lvl spells: ', r);
export default spells;
